[Timeout] BlockStatement
src/components/ExerciseList.tsx:14:68
   selectedExerciseId,
   onSelectExercise,
 }: ExerciseListProps) {
-  const getLastSetSummary = (exercise: WorkoutExercise): string => {
-    if (exercise.sets.length === 0) {
-      return 'Sem séries';
-    }
-    const lastSet = exercise.sets[exercise.sets.length - 1];
-    return `${lastSet.repetitions} reps @ ${lastSet.weightInKg}kg`;
-  };
+  const getLastSetSummary = (exercise: WorkoutExercise): string => {};
 
   return (

[Timeout] EqualityOperator
src/components/ExerciseList.tsx:15:9
   onSelectExercise,
 }: ExerciseListProps) {
   const getLastSetSummary = (exercise: WorkoutExercise): string => {
-    if (exercise.sets.length === 0) {
+    if (exercise.sets.length !== 0) {
       return 'Sem séries';
     }

[Timeout] ConditionalExpression
src/components/ExerciseList.tsx:15:9
   onSelectExercise,
 }: ExerciseListProps) {
   const getLastSetSummary = (exercise: WorkoutExercise): string => {
-    if (exercise.sets.length === 0) {
+    if (true) {
       return 'Sem séries';
     }

[Timeout] ArithmeticOperator
src/components/ExerciseList.tsx:18:35
     if (exercise.sets.length === 0) {
       return 'Sem séries';
     }
-    const lastSet = exercise.sets[exercise.sets.length - 1];
+    const lastSet = exercise.sets[exercise.sets.length + 1];
     return `${lastSet.repetitions} reps @ ${lastSet.weightInKg}kg`;
   };

[Timeout] StringLiteral
src/components/ExerciseList.tsx:23:28
   };
 
   return (
-    <div style={{ display: 'flex', flexDirection: 'column', gap: 'var(--spacing-sm)' }}>
+    <div style={{ display: "", flexDirection: 'column', gap: 'var(--spacing-sm)' }}>
       {exercises.map((exercise) => (
         <div

[Timeout] ArrowFunction
src/components/ExerciseList.tsx:28:20
         <div
           key={exercise.id}
           className="card"
-          onClick={() => onSelectExercise(exercise.id)}
+          onClick={() => undefined}
           style={{
             cursor: 'pointer',

[Timeout] StringLiteral
src/components/ExerciseList.tsx:30:21
           className="card"
           onClick={() => onSelectExercise(exercise.id)}
           style={{
-            cursor: 'pointer',
+            cursor: "",
             padding: 'var(--spacing-sm) var(--spacing-md)',
             backgroundColor: selectedExerciseId === exercise.id

[Timeout] ConditionalExpression
src/components/ExerciseList.tsx:32:30
           style={{
             cursor: 'pointer',
             padding: 'var(--spacing-sm) var(--spacing-md)',
-            backgroundColor: selectedExerciseId === exercise.id
+            backgroundColor: false
               ? 'var(--accent-light)'
               : 'var(--card-background)',

[Timeout] ConditionalExpression
src/components/ExerciseList.tsx:32:30
           style={{
             cursor: 'pointer',
             padding: 'var(--spacing-sm) var(--spacing-md)',
-            backgroundColor: selectedExerciseId === exercise.id
+            backgroundColor: true
               ? 'var(--accent-light)'
               : 'var(--card-background)',

[Timeout] EqualityOperator
src/components/ExerciseList.tsx:35:21
             backgroundColor: selectedExerciseId === exercise.id
               ? 'var(--accent-light)'
               : 'var(--card-background)',
-            border: selectedExerciseId === exercise.id
+            border: selectedExerciseId !== exercise.id
               ? '2px solid var(--accent-color)'
               : '1px solid var(--border-color)',

[Timeout] ConditionalExpression
src/components/ExerciseList.tsx:35:21
             backgroundColor: selectedExerciseId === exercise.id
               ? 'var(--accent-light)'
               : 'var(--card-background)',
-            border: selectedExerciseId === exercise.id
+            border: true
               ? '2px solid var(--accent-color)'
               : '1px solid var(--border-color)',

[Timeout] StringLiteral
src/components/ExerciseList.tsx:36:17
               ? 'var(--accent-light)'
               : 'var(--card-background)',
             border: selectedExerciseId === exercise.id
-              ? '2px solid var(--accent-color)'
+              ? ""
               : '1px solid var(--border-color)',
           }}

[Timeout] StringLiteral
src/components/ExerciseList.tsx:40:58
               : '1px solid var(--border-color)',
           }}
         >
-          <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
+          <div style={{ display: 'flex', justifyContent: "", alignItems: 'center' }}>
             <div style={{ flex: 1 }}>
               <h3 style={{ fontSize: '1rem', margin: 0 }}>{exercise.name || 'Sem nome'}</h3>

[Timeout] ConditionalExpression
src/components/ExerciseList.tsx:42:60
         >
           <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
             <div style={{ flex: 1 }}>
-              <h3 style={{ fontSize: '1rem', margin: 0 }}>{exercise.name || 'Sem nome'}</h3>
+              <h3 style={{ fontSize: '1rem', margin: 0 }}>{false}</h3>
               <span className="text-muted" style={{ fontSize: '0.85rem' }}>
                 {getLastSetSummary(exercise)}

[Timeout] ConditionalExpression
src/components/ExerciseList.tsx:42:60
         >
           <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
             <div style={{ flex: 1 }}>
-              <h3 style={{ fontSize: '1rem', margin: 0 }}>{exercise.name || 'Sem nome'}</h3>
+              <h3 style={{ fontSize: '1rem', margin: 0 }}>{true}</h3>
               <span className="text-muted" style={{ fontSize: '0.85rem' }}>
                 {getLastSetSummary(exercise)}

[Timeout] StringLiteral
src/components/ExerciseList.tsx:43:63
           <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
             <div style={{ flex: 1 }}>
               <h3 style={{ fontSize: '1rem', margin: 0 }}>{exercise.name || 'Sem nome'}</h3>
-              <span className="text-muted" style={{ fontSize: '0.85rem' }}>
+              <span className="text-muted" style={{ fontSize: "" }}>
                 {getLastSetSummary(exercise)}
               </span>

[Timeout] StringLiteral
src/components/ExerciseList.tsx:47:53
                 {getLastSetSummary(exercise)}
               </span>
             </div>
-            <span style={{ fontSize: '1rem', color: 'var(--text-secondary)' }}>
+            <span style={{ fontSize: '1rem', color: "" }}>
               ▶
             </span>
