[Timeout] BlockStatement
src/App.tsx:5:23
 import { HistoryView } from './views/HistoryView';
 import { ActiveWorkoutView } from './views/ActiveWorkoutView';
 
-function AppContent() {
-  const { currentView } = useContextWorkout();
-
-  return (
-    <div>
-      {currentView === 'history' ? (
-        <HistoryView />
-      ) : (
-        <ActiveWorkoutView />
-      )}
-    </div>
-  );
-}
+function AppContent() {}
 
 function App() {

[Timeout] ConditionalExpression
src/App.tsx:10:8
 
   return (
     <div>
-      {currentView === 'history' ? (
+      {true ? (
         <HistoryView />
       ) : (

[Timeout] ConditionalExpression
src/App.tsx:10:8
 
   return (
     <div>
-      {currentView === 'history' ? (
+      {false ? (
         <HistoryView />
       ) : (

[Timeout] BlockStatement
src/App.tsx:19:16
   );
 }
 
-function App() {
-  return (
-    <WorkoutProvider>
-      <AppContent />
-    </WorkoutProvider>
-  );
-}
+function App() {}
 
 export default App;
