[Timeout] BlockStatement
src/components/ExerciseScreen.tsx:62:50
 }: ExerciseScreenProps) {
   const form = useExerciseScreen({ initialExercise: exercise, onUpdateExercise });
 
-  const handleFormSubmit = (event: FormEvent) => {
-    event.preventDefault();
-    form.handleAddSet();
-  };
+  const handleFormSubmit = (event: FormEvent) => {};
 
   return (

[Timeout] CallExpression
src/components/ExerciseScreen.tsx:63:5
   const form = useExerciseScreen({ initialExercise: exercise, onUpdateExercise });
 
   const handleFormSubmit = (event: FormEvent) => {
-    event.preventDefault();
+    ;
     form.handleAddSet();
   };

[Timeout] CallExpression
src/components/ExerciseScreen.tsx:64:5
 
   const handleFormSubmit = (event: FormEvent) => {
     event.preventDefault();
-    form.handleAddSet();
+    ;
   };
 

[Timeout] ObjectLiteral
src/components/ExerciseScreen.tsx:70:16
   return (
     <div className="card" style={{ padding: 'var(--spacing-md)' }}>
       <div
-        style={{
-          display: 'flex',
-          justifyContent: 'space-between',
-          alignItems: 'center',
-          marginBottom: 'var(--spacing-md)',
-        }}
+        style={{}}
       >
         <MtButton

[Timeout] StringLiteral
src/components/ExerciseScreen.tsx:84:45
         >
           <ArrowLeft size={16} strokeWidth={2.5} strokeLinecap="round" strokeLinejoin="round" />
         </MtButton>
-        <div style={{ display: 'flex', gap: 'var(--spacing-xs)' }}>
+        <div style={{ display: 'flex', gap: "" }}>
           <MtButton
             size="small"

[Timeout] StringLiteral
src/components/ExerciseScreen.tsx:84:32
         >
           <ArrowLeft size={16} strokeWidth={2.5} strokeLinecap="round" strokeLinejoin="round" />
         </MtButton>
-        <div style={{ display: 'flex', gap: 'var(--spacing-xs)' }}>
+        <div style={{ display: "", gap: 'var(--spacing-xs)' }}>
           <MtButton
             size="small"

[Timeout] BooleanLiteral
src/components/ExerciseScreen.tsx:88:23
           <MtButton
             size="small"
             onClick={exerciseNavigation.onNavigatePrevious}
-            disabled={!exerciseNavigation.hasPrevious}
+            disabled={exerciseNavigation.hasPrevious}
             title="Exercício anterior"
           >

[Timeout] BooleanLiteral
src/components/ExerciseScreen.tsx:96:23
           <MtButton
             size="small"
             onClick={exerciseNavigation.onNavigateNext}
-            disabled={!exerciseNavigation.hasNext}
+            disabled={exerciseNavigation.hasNext}
             title="Próximo exercício"
           >

[Timeout] ObjectLiteral
src/components/ExerciseScreen.tsx:115:21
           placeholder="Ex: Supino Reto"
         />
 
-        <div style={{ display: 'flex', gap: 'var(--spacing-sm)' }}>
+        <div style={{}}>
           <MtField
             label="Carga (kg)"

[Timeout] StringLiteral
src/components/ExerciseScreen.tsx:138:41
         <MtLastWorkoutSets exerciseName={form.exercise.name} />
 
         <div>
-          <label style={{ marginBottom: 'var(--spacing-xs)' }}>Séries</label>
+          <label style={{ marginBottom: "" }}>Séries</label>
           {form.exercise.sets.length === 0 ? (
             <MtEmptyState

[Timeout] ConditionalExpression
src/components/ExerciseScreen.tsx:139:12
 
         <div>
           <label style={{ marginBottom: 'var(--spacing-xs)' }}>Séries</label>
-          {form.exercise.sets.length === 0 ? (
+          {true ? (
             <MtEmptyState
               size="small"

[Timeout] EqualityOperator
src/components/ExerciseScreen.tsx:139:12
 
         <div>
           <label style={{ marginBottom: 'var(--spacing-xs)' }}>Séries</label>
-          {form.exercise.sets.length === 0 ? (
+          {form.exercise.sets.length !== 0 ? (
             <MtEmptyState
               size="small"

[Timeout] StringLiteral
src/components/ExerciseScreen.tsx:147:30
           ) : (
             <ol
               style={{
-                paddingLeft: 'var(--spacing-md)',
+                paddingLeft: "",
                 display: 'flex',
                 flexDirection: 'column',

[Timeout] StringLiteral
src/components/ExerciseScreen.tsx:150:22
                 paddingLeft: 'var(--spacing-md)',
                 display: 'flex',
                 flexDirection: 'column',
-                gap: 'var(--spacing-xs)',
+                gap: "",
               }}
             >

[Timeout] ArrowFunction
src/components/ExerciseScreen.tsx:153:39
                 gap: 'var(--spacing-xs)',
               }}
             >
-              {form.exercise.sets.map((set, index) => (
-                <ExerciseSetItem
-                  key={index}
-                  set={set}
-                  index={index}
-                  onDelete={form.handleDeleteSet}
-                  onUpdate={form.handleUpdateSet}
-                />
-              ))}
+              {form.exercise.sets.map(() => undefined)}
             </ol>
           )}

[Timeout] StringLiteral
src/components/ExerciseScreen.tsx:169:24
         <form
           onSubmit={handleFormSubmit}
           style={{
-            borderTop: '1px solid var(--border-color)',
+            borderTop: "",
             paddingTop: 'var(--spacing-md)',
           }}

[Timeout] ObjectLiteral
src/components/ExerciseScreen.tsx:173:23
             paddingTop: 'var(--spacing-md)',
           }}
         >
-          <div style={{ display: 'flex', gap: 'var(--spacing-xs)', marginBottom: 'var(--spacing-sm)' }}>
+          <div style={{}}>
             <MtButton
               type="button"

[Timeout] ConditionalExpression
src/components/ExerciseScreen.tsx:179:25
               size="small"
               style={{ flex: 1 }}
               onClick={form.handleCopyLastSetReps}
-              disabled={form.exercise.sets.length === 0}
+              disabled={false}
               title="Copiar reps da última série"
             >

[Timeout] ConditionalExpression
src/components/ExerciseScreen.tsx:179:25
               size="small"
               style={{ flex: 1 }}
               onClick={form.handleCopyLastSetReps}
-              disabled={form.exercise.sets.length === 0}
+              disabled={true}
               title="Copiar reps da última série"
             >

[Timeout] UnaryOperator
src/components/ExerciseScreen.tsx:188:57
               type="button"
               size="small"
               style={{ flex: 1 }}
-              onClick={() => form.handleQuickAdjustReps(-1)}
+              onClick={() => form.handleQuickAdjustReps(+1)}
               title="Diminuir 1 repetição"
             >

[Timeout] ArrowFunction
src/components/ExerciseScreen.tsx:188:24
               type="button"
               size="small"
               style={{ flex: 1 }}
-              onClick={() => form.handleQuickAdjustReps(-1)}
+              onClick={() => undefined}
               title="Diminuir 1 repetição"
             >

[Timeout] ArrowFunction
src/components/ExerciseScreen.tsx:197:24
               type="button"
               size="small"
               style={{ flex: 1 }}
-              onClick={() => form.handleQuickAdjustReps(1)}
+              onClick={() => undefined}
               title="Aumentar 1 repetição"
             >

[Timeout] StringLiteral
src/components/ExerciseScreen.tsx:207:20
           <div
             style={{
               display: 'flex',
-              gap: 'var(--spacing-xs)',
+              gap: "",
               alignItems: 'flex-end',
             }}

[Timeout] StringLiteral
src/components/ExerciseScreen.tsx:208:27
             style={{
               display: 'flex',
               gap: 'var(--spacing-xs)',
-              alignItems: 'flex-end',
+              alignItems: "",
             }}
           >

[Timeout] ArrowFunction
src/components/ExerciseScreen.tsx:215:25
               label="Reps"
               labelStyle={{ fontSize: '0.75rem' }}
               value={form.repetitionsInput}
-              onChange={(event) => form.setRepetitionsInput(event.target.value)}
+              onChange={() => undefined}
               type="number"
               placeholder="Reps"

[Timeout] StringLiteral
src/components/ExerciseScreen.tsx:223:39
             />
             <MtField
               label="Carga"
-              labelStyle={{ fontSize: '0.75rem' }}
+              labelStyle={{ fontSize: "" }}
               value={form.weightInput}
               onChange={(event) => form.setWeightInput(event.target.value)}

[Timeout] ArrowFunction
src/components/ExerciseScreen.tsx:225:25
               label="Carga"
               labelStyle={{ fontSize: '0.75rem' }}
               value={form.weightInput}
-              onChange={(event) => form.setWeightInput(event.target.value)}
+              onChange={() => undefined}
               type="number"
               step="any"

[Timeout] ArrowFunction
src/components/ExerciseScreen.tsx:235:25
               label="Descanso"
               labelStyle={{ fontSize: '0.75rem' }}
               value={form.restInput}
-              onChange={(event) => form.setRestInput(event.target.value)}
+              onChange={() => undefined}
               type="number"
               placeholder="s"

[Timeout] StringLiteral
src/components/ExerciseScreen.tsx:246:26
               style={{
                 height: '42px',
                 width: '42px',
-                padding: '0',
+                padding: "",
                 borderRadius: 'var(--border-radius)',
               }}

[Timeout] StringLiteral
src/components/ExerciseScreen.tsx:247:31
                 height: '42px',
                 width: '42px',
                 padding: '0',
-                borderRadius: 'var(--border-radius)',
+                borderRadius: "",
               }}
               title="Adicionar série"
