[Timeout] BooleanLiteral
src/components/ExerciseSetItem.tsx:30:46
   onUpdate,
   style,
 }: ExerciseSetItemProps) {
-  const [isEditing, setIsEditing] = useState(false);
+  const [isEditing, setIsEditing] = useState(true);
   const [localReps, setLocalReps] = useState(set.repetitions);
   const [localWeight, setLocalWeight] = useState(set.weightInKg);

[Timeout] ConditionalExpression
src/components/ExerciseSetItem.tsx:34:84
   const [localReps, setLocalReps] = useState(set.repetitions);
   const [localWeight, setLocalWeight] = useState(set.weightInKg);
   const [localRest, setLocalRest] = useState(set.restTimeInSeconds);
-  const [localTechniques, setLocalTechniques] = useState<AdvancedTechnique[]>([...(set.advancedTechniques || [])]);
+  const [localTechniques, setLocalTechniques] = useState<AdvancedTechnique[]>([...(false)]);
 
   const toggleTechnique = (tech: AdvancedTechnique) => {

[Timeout] ConditionalExpression
src/components/ExerciseSetItem.tsx:34:84
   const [localReps, setLocalReps] = useState(set.repetitions);
   const [localWeight, setLocalWeight] = useState(set.weightInKg);
   const [localRest, setLocalRest] = useState(set.restTimeInSeconds);
-  const [localTechniques, setLocalTechniques] = useState<AdvancedTechnique[]>([...(set.advancedTechniques || [])]);
+  const [localTechniques, setLocalTechniques] = useState<AdvancedTechnique[]>([...(true)]);
 
   const toggleTechnique = (tech: AdvancedTechnique) => {

[Timeout] BlockStatement
src/components/ExerciseSetItem.tsx:36:56
   const [localRest, setLocalRest] = useState(set.restTimeInSeconds);
   const [localTechniques, setLocalTechniques] = useState<AdvancedTechnique[]>([...(set.advancedTechniques || [])]);
 
-  const toggleTechnique = (tech: AdvancedTechnique) => {
-    const idx = localTechniques.indexOf(tech);
-    if (idx >= 0) {
-      setLocalTechniques(localTechniques.filter((t) => t !== tech));
-    } else {
-      setLocalTechniques([...localTechniques, tech]);
-    }
-  };
+  const toggleTechnique = (tech: AdvancedTechnique) => {};
 
   const handleSave = () => {

[Timeout] EqualityOperator
src/components/ExerciseSetItem.tsx:38:9
 
   const toggleTechnique = (tech: AdvancedTechnique) => {
     const idx = localTechniques.indexOf(tech);
-    if (idx >= 0) {
+    if (idx > 0) {
       setLocalTechniques(localTechniques.filter((t) => t !== tech));
     } else {

[Timeout] ConditionalExpression
src/components/ExerciseSetItem.tsx:38:9
 
   const toggleTechnique = (tech: AdvancedTechnique) => {
     const idx = localTechniques.indexOf(tech);
-    if (idx >= 0) {
+    if (true) {
       setLocalTechniques(localTechniques.filter((t) => t !== tech));
     } else {

[Timeout] ConditionalExpression
src/components/ExerciseSetItem.tsx:39:56
   const toggleTechnique = (tech: AdvancedTechnique) => {
     const idx = localTechniques.indexOf(tech);
     if (idx >= 0) {
-      setLocalTechniques(localTechniques.filter((t) => t !== tech));
+      setLocalTechniques(localTechniques.filter((t) => true));
     } else {
       setLocalTechniques([...localTechniques, tech]);

[Timeout] EqualityOperator
src/components/ExerciseSetItem.tsx:39:56
   const toggleTechnique = (tech: AdvancedTechnique) => {
     const idx = localTechniques.indexOf(tech);
     if (idx >= 0) {
-      setLocalTechniques(localTechniques.filter((t) => t !== tech));
+      setLocalTechniques(localTechniques.filter((t) => t === tech));
     } else {
       setLocalTechniques([...localTechniques, tech]);

[Timeout] BlockStatement
src/components/ExerciseSetItem.tsx:40:12
     const idx = localTechniques.indexOf(tech);
     if (idx >= 0) {
       setLocalTechniques(localTechniques.filter((t) => t !== tech));
-    } else {
-      setLocalTechniques([...localTechniques, tech]);
-    }
+    } else {}
   };
 

[Timeout] BlockStatement
src/components/ExerciseSetItem.tsx:45:28
     }
   };
 
-  const handleSave = () => {
-    const updatedSet: ExerciseSet = {
-      ...set,
-      repetitions: localReps,
-      weightInKg: localWeight,
-      restTimeInSeconds: localRest,
-      advancedTechniques: localTechniques,
-    };
-    onUpdate(index, updatedSet);
-    setIsEditing(false);
-  };
+  const handleSave = () => {};
 
   const handleCancel = () => {

[Timeout] ObjectLiteral
src/components/ExerciseSetItem.tsx:46:37
   };
 
   const handleSave = () => {
-    const updatedSet: ExerciseSet = {
-      ...set,
-      repetitions: localReps,
-      weightInKg: localWeight,
-      restTimeInSeconds: localRest,
-      advancedTechniques: localTechniques,
-    };
+    const updatedSet: ExerciseSet = {};
     onUpdate(index, updatedSet);
     setIsEditing(false);

[Timeout] CallExpression
src/components/ExerciseSetItem.tsx:53:5
       restTimeInSeconds: localRest,
       advancedTechniques: localTechniques,
     };
-    onUpdate(index, updatedSet);
+    ;
     setIsEditing(false);
   };

[Timeout] BooleanLiteral
src/components/ExerciseSetItem.tsx:54:18
       advancedTechniques: localTechniques,
     };
     onUpdate(index, updatedSet);
-    setIsEditing(false);
+    setIsEditing(true);
   };
 

[Timeout] BlockStatement
src/components/ExerciseSetItem.tsx:57:30
     setIsEditing(false);
   };
 
-  const handleCancel = () => {
-    // Restaura valores originais antes de sair do modo de edição
-    setLocalReps(set.repetitions);
-    setLocalWeight(set.weightInKg);
-    setLocalRest(set.restTimeInSeconds);
-    setLocalTechniques([...(set.advancedTechniques || [])]);
-    setIsEditing(false);
-  };
+  const handleCancel = () => {};
 
   const handleDelete = () => {

[Timeout] CallExpression
src/components/ExerciseSetItem.tsx:59:5
 
   const handleCancel = () => {
     // Restaura valores originais antes de sair do modo de edição
-    setLocalReps(set.repetitions);
+    ;
     setLocalWeight(set.weightInKg);
     setLocalRest(set.restTimeInSeconds);

[Timeout] CallExpression
src/components/ExerciseSetItem.tsx:60:5
   const handleCancel = () => {
     // Restaura valores originais antes de sair do modo de edição
     setLocalReps(set.repetitions);
-    setLocalWeight(set.weightInKg);
+    ;
     setLocalRest(set.restTimeInSeconds);
     setLocalTechniques([...(set.advancedTechniques || [])]);

[Timeout] CallExpression
src/components/ExerciseSetItem.tsx:61:5
     // Restaura valores originais antes de sair do modo de edição
     setLocalReps(set.repetitions);
     setLocalWeight(set.weightInKg);
-    setLocalRest(set.restTimeInSeconds);
+    ;
     setLocalTechniques([...(set.advancedTechniques || [])]);
     setIsEditing(false);

[Timeout] ConditionalExpression
src/components/ExerciseSetItem.tsx:62:29
     setLocalReps(set.repetitions);
     setLocalWeight(set.weightInKg);
     setLocalRest(set.restTimeInSeconds);
-    setLocalTechniques([...(set.advancedTechniques || [])]);
+    setLocalTechniques([...(true)]);
     setIsEditing(false);
   };

[Timeout] ConditionalExpression
src/components/ExerciseSetItem.tsx:62:29
     setLocalReps(set.repetitions);
     setLocalWeight(set.weightInKg);
     setLocalRest(set.restTimeInSeconds);
-    setLocalTechniques([...(set.advancedTechniques || [])]);
+    setLocalTechniques([...(false)]);
     setIsEditing(false);
   };

[Timeout] BooleanLiteral
src/components/ExerciseSetItem.tsx:63:18
     setLocalWeight(set.weightInKg);
     setLocalRest(set.restTimeInSeconds);
     setLocalTechniques([...(set.advancedTechniques || [])]);
-    setIsEditing(false);
+    setIsEditing(true);
   };
 

[Timeout] BlockStatement
src/components/ExerciseSetItem.tsx:66:30
     setIsEditing(false);
   };
 
-  const handleDelete = () => {
-    // O usuário precisa confirmar antes de apagar a série
-    const confirmou = window.confirm(
-      `Tem certeza que deseja apagar a série #${index + 1}? Esta ação não pode ser desfeita.`
-    );
-    if (confirmou) {
-      onDelete(index);
-    }
-  };
+  const handleDelete = () => {};
 
   // Técnicas avançadas realmente selecionadas neste set (dados reais do estado da entidade)

[Timeout] ArithmeticOperator
src/components/ExerciseSetItem.tsx:69:49
   const handleDelete = () => {
     // O usuário precisa confirmar antes de apagar a série
     const confirmou = window.confirm(
-      `Tem certeza que deseja apagar a série #${index + 1}? Esta ação não pode ser desfeita.`
+      `Tem certeza que deseja apagar a série #${index - 1}? Esta ação não pode ser desfeita.`
     );
     if (confirmou) {

[Timeout] StringLiteral
src/components/ExerciseSetItem.tsx:69:7
   const handleDelete = () => {
     // O usuário precisa confirmar antes de apagar a série
     const confirmou = window.confirm(
-      `Tem certeza que deseja apagar a série #${index + 1}? Esta ação não pode ser desfeita.`
+      ``
     );
     if (confirmou) {

[Timeout] BlockStatement
src/components/ExerciseSetItem.tsx:71:20
     const confirmou = window.confirm(
       `Tem certeza que deseja apagar a série #${index + 1}? Esta ação não pode ser desfeita.`
     );
-    if (confirmou) {
-      onDelete(index);
-    }
+    if (confirmou) {}
   };
 

[Timeout] ConditionalExpression
src/components/ExerciseSetItem.tsx:71:9
     const confirmou = window.confirm(
       `Tem certeza que deseja apagar a série #${index + 1}? Esta ação não pode ser desfeita.`
     );
-    if (confirmou) {
+    if (false) {
       onDelete(index);
     }

[Timeout] CallExpression
src/components/ExerciseSetItem.tsx:72:7
       `Tem certeza que deseja apagar a série #${index + 1}? Esta ação não pode ser desfeita.`
     );
     if (confirmou) {
-      onDelete(index);
+      ;
     }
   };

[Timeout] LogicalOperator
src/components/ExerciseSetItem.tsx:77:22
   };
 
   // Técnicas avançadas realmente selecionadas neste set (dados reais do estado da entidade)
-  const techniques = set.advancedTechniques || [];
+  const techniques = set.advancedTechniques && [];
 
   // Tela de visualização normal (read-only)

[Timeout] ConditionalExpression
src/components/ExerciseSetItem.tsx:77:22
   };
 
   // Técnicas avançadas realmente selecionadas neste set (dados reais do estado da entidade)
-  const techniques = set.advancedTechniques || [];
+  const techniques = false;
 
   // Tela de visualização normal (read-only)

[Timeout] ConditionalExpression
src/components/ExerciseSetItem.tsx:80:7
   const techniques = set.advancedTechniques || [];
 
   // Tela de visualização normal (read-only)
-  if (!isEditing) {
+  if (false) {
     return (
       <li style={{ fontSize: '0.95rem', ...style }}>

[Timeout] ConditionalExpression
src/components/ExerciseSetItem.tsx:80:7
   const techniques = set.advancedTechniques || [];
 
   // Tela de visualização normal (read-only)
-  if (!isEditing) {
+  if (true) {
     return (
       <li style={{ fontSize: '0.95rem', ...style }}>

[Timeout] ObjectLiteral
src/components/ExerciseSetItem.tsx:84:18
     return (
       <li style={{ fontSize: '0.95rem', ...style }}>
         <div
-          style={{
-            display: 'flex',
-            justifyContent: 'space-between',
-            alignItems: 'center',
-          }}
+          style={{}}
         >
           <span style={{ flex: 1, minWidth: 0 }}>

[Timeout] ObjectLiteral
src/components/ExerciseSetItem.tsx:90:24
             alignItems: 'center',
           }}
         >
-          <span style={{ flex: 1, minWidth: 0 }}>
+          <span style={{}}>
             <div style={{ display: 'flex', flexDirection: 'column', minWidth: 0 }}>
               {/* Linha principal: "5 reps @ 10kg - 120" nunca deve quebrar a linha */}

[Timeout] StringLiteral
src/components/ExerciseSetItem.tsx:97:33
                 style={{
                   whiteSpace: 'nowrap',
                   overflow: 'hidden',
-                  textOverflow: 'ellipsis',
+                  textOverflow: "",
                 }}
               >

[Timeout] LogicalOperator
src/components/ExerciseSetItem.tsx:101:18
                 }}
               >
                 <strong>{set.repetitions} reps</strong> @ {set.weightInKg}kg
-                {set.restTimeInSeconds > 0 && ` - ${set.restTimeInSeconds}s`}
+                {set.restTimeInSeconds > 0 || ` - ${set.restTimeInSeconds}s`}
               </span>
 

[Timeout] ConditionalExpression
src/components/ExerciseSetItem.tsx:101:18
                 }}
               >
                 <strong>{set.repetitions} reps</strong> @ {set.weightInKg}kg
-                {set.restTimeInSeconds > 0 && ` - ${set.restTimeInSeconds}s`}
+                {false}
               </span>
 

[Timeout] EqualityOperator
src/components/ExerciseSetItem.tsx:105:16
               </span>
 
               {/* Técnicas avançadas jogadas abaixo da linha principal (texto simples) */}
-              {techniques.length > 0 && (
+              {techniques.length >= 0 && (
                 <span
                   style={{

[Timeout] ConditionalExpression
src/components/ExerciseSetItem.tsx:105:16
               </span>
 
               {/* Técnicas avançadas jogadas abaixo da linha principal (texto simples) */}
-              {techniques.length > 0 && (
-                <span
-                  style={{
-                    marginTop: 'var(--spacing-xs)',
-                    fontSize: '0.75rem',
-                    color: 'var(--text-secondary)',
-                  }}
-                >
-                  {techniques.join(', ')}
-                </span>
-              )}
+              {true}
             </div>
           </span>

[Timeout] StringLiteral
src/components/ExerciseSetItem.tsx:109:31
                 <span
                   style={{
                     marginTop: 'var(--spacing-xs)',
-                    fontSize: '0.75rem',
+                    fontSize: "",
                     color: 'var(--text-secondary)',
                   }}

[Timeout] ObjectLiteral
src/components/ExerciseSetItem.tsx:122:22
           <div>
             <button
               className="text"
-              style={{ padding: '2px 6px' }}
+              style={{}}
               onClick={(event) => {
                 event.stopPropagation();

[Timeout] BlockStatement
src/components/ExerciseSetItem.tsx:123:35
             <button
               className="text"
               style={{ padding: '2px 6px' }}
-              onClick={(event) => {
-                event.stopPropagation();
-                setIsEditing(true);
-              }}
+              onClick={(event) => {}}
               title="Editar série"
             >

[Timeout] CallExpression
src/components/ExerciseSetItem.tsx:124:17
               className="text"
               style={{ padding: '2px 6px' }}
               onClick={(event) => {
-                event.stopPropagation();
+                ;
                 setIsEditing(true);
               }}

[Timeout] BooleanLiteral
src/components/ExerciseSetItem.tsx:125:30
               style={{ padding: '2px 6px' }}
               onClick={(event) => {
                 event.stopPropagation();
-                setIsEditing(true);
+                setIsEditing(false);
               }}
               title="Editar série"

[Timeout] StringLiteral
src/components/ExerciseSetItem.tsx:139:28
 
   // Tela de edição inline
   return (
-    <li style={{ fontSize: '0.9rem', ...style }}>
+    <li style={{ fontSize: "", ...style }}>
       <div style={{ display: 'flex', flexDirection: 'column', gap: 'var(--spacing-xs)' }}>
         <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>

[Timeout] ObjectLiteral
src/components/ExerciseSetItem.tsx:141:21
   return (
     <li style={{ fontSize: '0.9rem', ...style }}>
       <div style={{ display: 'flex', flexDirection: 'column', gap: 'var(--spacing-xs)' }}>
-        <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
+        <div style={{}}>
           <strong>Série #{index + 1}</strong>
           <div style={{ display: 'flex', gap: 'var(--spacing-xs)' }}>

[Timeout] StringLiteral
src/components/ExerciseSetItem.tsx:141:32
   return (
     <li style={{ fontSize: '0.9rem', ...style }}>
       <div style={{ display: 'flex', flexDirection: 'column', gap: 'var(--spacing-xs)' }}>
-        <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
+        <div style={{ display: "", justifyContent: 'space-between', alignItems: 'center' }}>
           <strong>Série #{index + 1}</strong>
           <div style={{ display: 'flex', gap: 'var(--spacing-xs)' }}>

[Timeout] ArithmeticOperator
src/components/ExerciseSetItem.tsx:142:27
     <li style={{ fontSize: '0.9rem', ...style }}>
       <div style={{ display: 'flex', flexDirection: 'column', gap: 'var(--spacing-xs)' }}>
         <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
-          <strong>Série #{index + 1}</strong>
+          <strong>Série #{index - 1}</strong>
           <div style={{ display: 'flex', gap: 'var(--spacing-xs)' }}>
             {/* O botão de apagar foi movido para dentro da edição para economizar espaço na linha principal */}

[Timeout] ObjectLiteral
src/components/ExerciseSetItem.tsx:143:23
       <div style={{ display: 'flex', flexDirection: 'column', gap: 'var(--spacing-xs)' }}>
         <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
           <strong>Série #{index + 1}</strong>
-          <div style={{ display: 'flex', gap: 'var(--spacing-xs)' }}>
+          <div style={{}}>
             {/* O botão de apagar foi movido para dentro da edição para economizar espaço na linha principal */}
             <button

[Timeout] ObjectLiteral
src/components/ExerciseSetItem.tsx:163:22
             </button>
             <button
               className="small"
-              style={{ padding: '4px 8px', fontSize: '0.75rem' }}
+              style={{}}
               onClick={handleCancel}
               title="Cancelar"

[Timeout] StringLiteral
src/components/ExerciseSetItem.tsx:163:54
             </button>
             <button
               className="small"
-              style={{ padding: '4px 8px', fontSize: '0.75rem' }}
+              style={{ padding: '4px 8px', fontSize: "" }}
               onClick={handleCancel}
               title="Cancelar"

[Timeout] StringLiteral
src/components/ExerciseSetItem.tsx:182:37
         >
           <MtField
             label="Reps"
-            labelStyle={{ fontSize: '0.75rem' }}
+            labelStyle={{ fontSize: "" }}
             value={String(localReps)}
             onChange={(event) => setLocalReps(Number(event.target.value))}

[Timeout] ArrowFunction
src/components/ExerciseSetItem.tsx:184:23
             label="Reps"
             labelStyle={{ fontSize: '0.75rem' }}
             value={String(localReps)}
-            onChange={(event) => setLocalReps(Number(event.target.value))}
+            onChange={() => undefined}
             type="number"
             placeholder="Reps"

[Timeout] ObjectLiteral
src/components/ExerciseSetItem.tsx:191:25
           />
           <MtField
             label="Carga"
-            labelStyle={{ fontSize: '0.75rem' }}
+            labelStyle={{}}
             value={String(localWeight)}
             onChange={(event) => setLocalWeight(Number(event.target.value))}

[Timeout] ArrowFunction
src/components/ExerciseSetItem.tsx:193:23
             label="Carga"
             labelStyle={{ fontSize: '0.75rem' }}
             value={String(localWeight)}
-            onChange={(event) => setLocalWeight(Number(event.target.value))}
+            onChange={() => undefined}
             type="number"
             step="any"

[Timeout] ObjectLiteral
src/components/ExerciseSetItem.tsx:197:20
             type="number"
             step="any"
             placeholder="kg"
-            style={{ flex: 1 }}
+            style={{}}
           />
           <MtField

[Timeout] ArrowFunction
src/components/ExerciseSetItem.tsx:203:23
             label="Descanso"
             labelStyle={{ fontSize: '0.75rem' }}
             value={String(localRest)}
-            onChange={(event) => setLocalRest(Number(event.target.value))}
+            onChange={() => undefined}
             type="number"
             placeholder="s"
