[Timeout] StringLiteral
src/components/ExerciseTechniquePills.tsx:13:60
   itemStyle?: CSSProperties;
 }
 
-const TECHNIQUES: AdvancedTechnique[] = ['FS', 'RP', 'DS', 'ISO'];
+const TECHNIQUES: AdvancedTechnique[] = ['FS', 'RP', 'DS', ""];
 
 export function ExerciseTechniquePills({

[Timeout] ArrayDeclaration
src/components/ExerciseTechniquePills.tsx:13:41
   itemStyle?: CSSProperties;
 }
 
-const TECHNIQUES: AdvancedTechnique[] = ['FS', 'RP', 'DS', 'ISO'];
+const TECHNIQUES: AdvancedTechnique[] = [];
 
 export function ExerciseTechniquePills({

[Timeout] ConditionalExpression
src/components/ExerciseTechniquePills.tsx:25:8
 }: ExerciseTechniquePillsProps) {
   return (
     <div style={style}>
-      {label && (
-        <label style={{ fontSize: '0.75rem', marginBottom: 'var(--spacing-xs)', display: 'block', ...labelStyle }}>
-          {label}
-        </label>
-      )}
+      {true}
       <div style={{ display: 'flex', gap: 'var(--spacing-xs)', flexWrap: 'wrap' }}>
         {TECHNIQUES.map((technique) => {

[Timeout] ConditionalExpression
src/components/ExerciseTechniquePills.tsx:25:8
 }: ExerciseTechniquePillsProps) {
   return (
     <div style={style}>
-      {label && (
-        <label style={{ fontSize: '0.75rem', marginBottom: 'var(--spacing-xs)', display: 'block', ...labelStyle }}>
-          {label}
-        </label>
-      )}
+      {false}
       <div style={{ display: 'flex', gap: 'var(--spacing-xs)', flexWrap: 'wrap' }}>
         {TECHNIQUES.map((technique) => {

[Timeout] BlockStatement
src/components/ExerciseTechniquePills.tsx:31:40
         </label>
       )}
       <div style={{ display: 'flex', gap: 'var(--spacing-xs)', flexWrap: 'wrap' }}>
-        {TECHNIQUES.map((technique) => {
-          const isActive = selectedTechniques.includes(technique);
-          return (
-            <span
-              key={technique}
-              className={`pill ${isActive ? 'active' : ''}`}
-              onClick={() => onToggle(technique)}
-              style={itemStyle}
-            >
-              {technique}
-            </span>
-          );
-        })}
+        {TECHNIQUES.map((technique) => {})}
       </div>
     </div>

[Timeout] StringLiteral
src/components/ExerciseTechniquePills.tsx:36:45
           return (
             <span
               key={technique}
-              className={`pill ${isActive ? 'active' : ''}`}
+              className={`pill ${isActive ? "" : ''}`}
               onClick={() => onToggle(technique)}
               style={itemStyle}

[Timeout] ArrowFunction
src/components/ExerciseTechniquePills.tsx:37:24
             <span
               key={technique}
               className={`pill ${isActive ? 'active' : ''}`}
-              onClick={() => onToggle(technique)}
+              onClick={() => undefined}
               style={itemStyle}
             >
