[Timeout] BlockStatement
src/components/RestTimer.tsx:12:48
 export function RestTimer({ stopwatch, targetSeconds }: RestTimerProps) {
   const { seconds } = stopwatch;
 
-  const formatTime = (totalSeconds: number) => {
-    const minutes = Math.floor(totalSeconds / 60);
-    const remainingSeconds = totalSeconds % 60;
-    return `${minutes}:${remainingSeconds.toString().padStart(2, '0')}`;
-  };
+  const formatTime = (totalSeconds: number) => {};
 
   const isRestComplete = seconds >= targetSeconds && targetSeconds > 0;

[Timeout] ArithmeticOperator
src/components/RestTimer.tsx:13:32
   const { seconds } = stopwatch;
 
   const formatTime = (totalSeconds: number) => {
-    const minutes = Math.floor(totalSeconds / 60);
+    const minutes = Math.floor(totalSeconds * 60);
     const remainingSeconds = totalSeconds % 60;
     return `${minutes}:${remainingSeconds.toString().padStart(2, '0')}`;

[Timeout] ArithmeticOperator
src/components/RestTimer.tsx:14:30
 
   const formatTime = (totalSeconds: number) => {
     const minutes = Math.floor(totalSeconds / 60);
-    const remainingSeconds = totalSeconds % 60;
+    const remainingSeconds = totalSeconds * 60;
     return `${minutes}:${remainingSeconds.toString().padStart(2, '0')}`;
   };

[Timeout] EqualityOperator
src/components/RestTimer.tsx:18:26
     return `${minutes}:${remainingSeconds.toString().padStart(2, '0')}`;
   };
 
-  const isRestComplete = seconds >= targetSeconds && targetSeconds > 0;
+  const isRestComplete = seconds > targetSeconds && targetSeconds > 0;
 
   return (

[Timeout] EqualityOperator
src/components/RestTimer.tsx:18:26
     return `${minutes}:${remainingSeconds.toString().padStart(2, '0')}`;
   };
 
-  const isRestComplete = seconds >= targetSeconds && targetSeconds > 0;
+  const isRestComplete = seconds < targetSeconds && targetSeconds > 0;
 
   return (

[Timeout] ObjectLiteral
src/components/RestTimer.tsx:22:14
 
   return (
     <div
-      style={{
-        display: 'flex',
-        justifyContent: 'space-between',
-        alignItems: 'center',
-        padding: 'var(--spacing-sm) 0',
-        marginTop: 'var(--spacing-sm)',
-        borderTop: '1px solid var(--border-color)',
-      }}
+      style={{}}
     >
       <div style={{ display: 'flex', alignItems: 'center', gap: 'var(--spacing-xs)' }}>

[Timeout] StringLiteral
src/components/RestTimer.tsx:26:18
         display: 'flex',
         justifyContent: 'space-between',
         alignItems: 'center',
-        padding: 'var(--spacing-sm) 0',
+        padding: "",
         marginTop: 'var(--spacing-sm)',
         borderTop: '1px solid var(--border-color)',

[Timeout] StringLiteral
src/components/RestTimer.tsx:31:30
         borderTop: '1px solid var(--border-color)',
       }}
     >
-      <div style={{ display: 'flex', alignItems: 'center', gap: 'var(--spacing-xs)' }}>
+      <div style={{ display: "", alignItems: 'center', gap: 'var(--spacing-xs)' }}>
         <Clock size={16} strokeWidth={2} strokeLinecap="round" strokeLinejoin="round" />
         <span style={{ fontSize: '0.85rem', color: 'var(--text-secondary)' }}>Descanso</span>

[Timeout] ObjectLiteral
src/components/RestTimer.tsx:33:22
     >
       <div style={{ display: 'flex', alignItems: 'center', gap: 'var(--spacing-xs)' }}>
         <Clock size={16} strokeWidth={2} strokeLinecap="round" strokeLinejoin="round" />
-        <span style={{ fontSize: '0.85rem', color: 'var(--text-secondary)' }}>Descanso</span>
+        <span style={{}}>Descanso</span>
       </div>
 

[Timeout] StringLiteral
src/components/RestTimer.tsx:33:52
     >
       <div style={{ display: 'flex', alignItems: 'center', gap: 'var(--spacing-xs)' }}>
         <Clock size={16} strokeWidth={2} strokeLinecap="round" strokeLinejoin="round" />
-        <span style={{ fontSize: '0.85rem', color: 'var(--text-secondary)' }}>Descanso</span>
+        <span style={{ fontSize: '0.85rem', color: "" }}>Descanso</span>
       </div>
 

[Timeout] ObjectLiteral
src/components/RestTimer.tsx:45:22
           transition: 'color 0.3s ease',
         }}
       >
-        <span style={{ fontSize: '1.25rem', fontWeight: 'bold', fontFamily: 'monospace' }}>
+        <span style={{}}>
           {formatTime(seconds)}
         </span>

[Timeout] StringLiteral
src/components/RestTimer.tsx:45:57
           transition: 'color 0.3s ease',
         }}
       >
-        <span style={{ fontSize: '1.25rem', fontWeight: 'bold', fontFamily: 'monospace' }}>
+        <span style={{ fontSize: '1.25rem', fontWeight: "", fontFamily: 'monospace' }}>
           {formatTime(seconds)}
         </span>

[Timeout] StringLiteral
src/components/RestTimer.tsx:48:34
         <span style={{ fontSize: '1.25rem', fontWeight: 'bold', fontFamily: 'monospace' }}>
           {formatTime(seconds)}
         </span>
-        <span style={{ fontSize: '0.85rem', color: 'var(--text-secondary)' }}>
+        <span style={{ fontSize: "", color: 'var(--text-secondary)' }}>
           /{formatTime(targetSeconds)}
         </span>

[Timeout] ObjectLiteral
src/components/RestTimer.tsx:48:22
         <span style={{ fontSize: '1.25rem', fontWeight: 'bold', fontFamily: 'monospace' }}>
           {formatTime(seconds)}
         </span>
-        <span style={{ fontSize: '0.85rem', color: 'var(--text-secondary)' }}>
+        <span style={{}}>
           /{formatTime(targetSeconds)}
         </span>

[Timeout] StringLiteral
src/components/RestTimer.tsx:53:30
         </span>
       </div>
 
-      <div style={{ display: 'flex', gap: 'var(--spacing-xs)' }}>
+      <div style={{ display: "", gap: 'var(--spacing-xs)' }}>
         <button
           className="small"

[Timeout] StringLiteral
src/components/RestTimer.tsx:53:43
         </span>
       </div>
 
-      <div style={{ display: 'flex', gap: 'var(--spacing-xs)' }}>
+      <div style={{ display: 'flex', gap: "" }}>
         <button
           className="small"

[Timeout] ArrowFunction
src/components/RestTimer.tsx:56:20
       <div style={{ display: 'flex', gap: 'var(--spacing-xs)' }}>
         <button
           className="small"
-          onClick={() => stopwatch.reset()}
+          onClick={() => undefined}
           title="Resetar"
           style={{ padding: '4px 8px' }}

[Timeout] StringLiteral
src/components/RestTimer.tsx:58:29
           className="small"
           onClick={() => stopwatch.reset()}
           title="Resetar"
-          style={{ padding: '4px 8px' }}
+          style={{ padding: "" }}
         >
           <RotateCcw size={14} strokeWidth={2.5} strokeLinecap="round" strokeLinejoin="round" />
