[Timeout] StringLiteral
src/components/active-workout/ActiveWorkoutHeader.tsx:44:67
   onSaveOrFinish,
   onCancel,
 }: ActiveWorkoutHeaderProps) {
-  const formattedDate = new Date(session.date).toLocaleDateString('pt-BR', {
+  const formattedDate = new Date(session.date).toLocaleDateString("", {
     weekday: 'short',
     day: '2-digit',

[Timeout] StringLiteral
src/components/active-workout/ActiveWorkoutHeader.tsx:48:11
     weekday: 'short',
     day: '2-digit',
     month: '2-digit',
-    hour: '2-digit',
+    hour: "",
     minute: '2-digit',
   });

[Timeout] StringLiteral
src/components/active-workout/ActiveWorkoutHeader.tsx:49:13
     day: '2-digit',
     month: '2-digit',
     hour: '2-digit',
-    minute: '2-digit',
+    minute: "",
   });
 

[Timeout] BlockStatement
src/components/active-workout/ActiveWorkoutHeader.tsx:52:30
     minute: '2-digit',
   });
 
-  const handleCancel = () => {
-    const confirmado = window.confirm(
-      'Tem certeza de que deseja cancelar este treino? O progresso não será salvo.'
-    );
-    if (confirmado) {
-      onCancel();
-    }
-  };
+  const handleCancel = () => {};
 
   const handleSaveOrFinish = () => {

[Timeout] ConditionalExpression
src/components/active-workout/ActiveWorkoutHeader.tsx:56:9
     const confirmado = window.confirm(
       'Tem certeza de que deseja cancelar este treino? O progresso não será salvo.'
     );
-    if (confirmado) {
+    if (false) {
       onCancel();
     }

[Timeout] ConditionalExpression
src/components/active-workout/ActiveWorkoutHeader.tsx:56:9
     const confirmado = window.confirm(
       'Tem certeza de que deseja cancelar este treino? O progresso não será salvo.'
     );
-    if (confirmado) {
+    if (true) {
       onCancel();
     }

[Timeout] CallExpression
src/components/active-workout/ActiveWorkoutHeader.tsx:57:7
       'Tem certeza de que deseja cancelar este treino? O progresso não será salvo.'
     );
     if (confirmado) {
-      onCancel();
+      ;
     }
   };

[Timeout] BlockStatement
src/components/active-workout/ActiveWorkoutHeader.tsx:61:36
     }
   };
 
-  const handleSaveOrFinish = () => {
-    const confirmMessage = isEditing
-      ? 'Tem certeza de que deseja salvar este treino?'
-      : 'Tem certeza de que deseja encerrar este treino?';
-    const confirmado = window.confirm(confirmMessage);
-    if (confirmado) {
-      onSaveOrFinish();
-    }
-  };
+  const handleSaveOrFinish = () => {};
 
   return (

[Timeout] ConditionalExpression
src/components/active-workout/ActiveWorkoutHeader.tsx:66:9
       ? 'Tem certeza de que deseja salvar este treino?'
       : 'Tem certeza de que deseja encerrar este treino?';
     const confirmado = window.confirm(confirmMessage);
-    if (confirmado) {
+    if (true) {
       onSaveOrFinish();
     }

[Timeout] ConditionalExpression
src/components/active-workout/ActiveWorkoutHeader.tsx:66:9
       ? 'Tem certeza de que deseja salvar este treino?'
       : 'Tem certeza de que deseja encerrar este treino?';
     const confirmado = window.confirm(confirmMessage);
-    if (confirmado) {
+    if (false) {
       onSaveOrFinish();
     }

[Timeout] CallExpression
src/components/active-workout/ActiveWorkoutHeader.tsx:67:7
       : 'Tem certeza de que deseja encerrar este treino?';
     const confirmado = window.confirm(confirmMessage);
     if (confirmado) {
-      onSaveOrFinish();
+      ;
     }
   };

[Timeout] ObjectLiteral
src/components/active-workout/ActiveWorkoutHeader.tsx:74:20
   return (
     <header>
       <div>
-        <h1 style={{ fontSize: '1.1rem' }}>
+        <h1 style={{}}>
           {formattedDate}
         </h1>

[Timeout] StringLiteral
src/components/active-workout/ActiveWorkoutHeader.tsx:77:61
         <h1 style={{ fontSize: '1.1rem' }}>
           {formattedDate}
         </h1>
-        <span className="text-secondary" style={{ fontSize: '0.8rem', display: 'block' }}>
+        <span className="text-secondary" style={{ fontSize: "", display: 'block' }}>
           {isEditing ? 'Modo Edição' : `Duração: ${formatTimerValue(durationStopwatch.seconds)}`}
         </span>

[Timeout] StringLiteral
src/components/active-workout/ActiveWorkoutHeader.tsx:78:24
           {formattedDate}
         </h1>
         <span className="text-secondary" style={{ fontSize: '0.8rem', display: 'block' }}>
-          {isEditing ? 'Modo Edição' : `Duração: ${formatTimerValue(durationStopwatch.seconds)}`}
+          {isEditing ? "" : `Duração: ${formatTimerValue(durationStopwatch.seconds)}`}
         </span>
       </div>

[Timeout] StringLiteral
src/components/active-workout/ActiveWorkoutHeader.tsx:95:52
           size="small"
           variant="primary"
           onClick={handleSaveOrFinish}
-          title={isEditing ? 'Salvar alterações' : 'Encerrar treino'}
+          title={isEditing ? 'Salvar alterações' : ""}
           style={{ minWidth: '40px', minHeight: '40px' }}
         >

[Timeout] StringLiteral
src/components/active-workout/ActiveWorkoutHeader.tsx:96:49
           variant="primary"
           onClick={handleSaveOrFinish}
           title={isEditing ? 'Salvar alterações' : 'Encerrar treino'}
-          style={{ minWidth: '40px', minHeight: '40px' }}
+          style={{ minWidth: '40px', minHeight: "" }}
         >
           <Check size={16} strokeWidth={2.5} strokeLinecap="round" strokeLinejoin="round" />

[Timeout] StringLiteral
src/components/active-workout/ActiveWorkoutHeader.tsx:96:30
           variant="primary"
           onClick={handleSaveOrFinish}
           title={isEditing ? 'Salvar alterações' : 'Encerrar treino'}
-          style={{ minWidth: '40px', minHeight: '40px' }}
+          style={{ minWidth: "", minHeight: '40px' }}
         >
           <Check size={16} strokeWidth={2.5} strokeLinecap="round" strokeLinejoin="round" />

[Timeout] BlockStatement
src/components/active-workout/ActiveWorkoutHeader.tsx:108:57
 /**
  * Formata o tempo total em segundos para o formato MM:SS (ou HH:MM:SS).
  */
-function formatTimerValue(totalSeconds: number): string {
-  const hours = Math.floor(totalSeconds / 3600);
-  const minutes = Math.floor((totalSeconds % 3600) / 60);
-  const seconds = totalSeconds % 60;
-
-  const paddedMinutes = String(minutes).padStart(2, '0');
-  const paddedSeconds = String(seconds).padStart(2, '0');
-
-  if (hours > 0) {
-    return `${String(hours).padStart(2, '0')}:${paddedMinutes}:${paddedSeconds}`;
-  }
-  return `${paddedMinutes}:${paddedSeconds}`;
-}
+function formatTimerValue(totalSeconds: number): string {}
 

[Timeout] ArithmeticOperator
src/components/active-workout/ActiveWorkoutHeader.tsx:109:28
  * Formata o tempo total em segundos para o formato MM:SS (ou HH:MM:SS).
  */
 function formatTimerValue(totalSeconds: number): string {
-  const hours = Math.floor(totalSeconds / 3600);
+  const hours = Math.floor(totalSeconds * 3600);
   const minutes = Math.floor((totalSeconds % 3600) / 60);
   const seconds = totalSeconds % 60;

[Timeout] ArithmeticOperator
src/components/active-workout/ActiveWorkoutHeader.tsx:110:31
  */
 function formatTimerValue(totalSeconds: number): string {
   const hours = Math.floor(totalSeconds / 3600);
-  const minutes = Math.floor((totalSeconds % 3600) / 60);
+  const minutes = Math.floor((totalSeconds * 3600) / 60);
   const seconds = totalSeconds % 60;
 

[Timeout] ArithmeticOperator
src/components/active-workout/ActiveWorkoutHeader.tsx:110:30
  */
 function formatTimerValue(totalSeconds: number): string {
   const hours = Math.floor(totalSeconds / 3600);
-  const minutes = Math.floor((totalSeconds % 3600) / 60);
+  const minutes = Math.floor(totalSeconds % 3600 * 60);
   const seconds = totalSeconds % 60;
 

[Timeout] ArithmeticOperator
src/components/active-workout/ActiveWorkoutHeader.tsx:111:19
 function formatTimerValue(totalSeconds: number): string {
   const hours = Math.floor(totalSeconds / 3600);
   const minutes = Math.floor((totalSeconds % 3600) / 60);
-  const seconds = totalSeconds % 60;
+  const seconds = totalSeconds * 60;
 
   const paddedMinutes = String(minutes).padStart(2, '0');

[Timeout] StringLiteral
src/components/active-workout/ActiveWorkoutHeader.tsx:114:53
   const seconds = totalSeconds % 60;
 
   const paddedMinutes = String(minutes).padStart(2, '0');
-  const paddedSeconds = String(seconds).padStart(2, '0');
+  const paddedSeconds = String(seconds).padStart(2, "");
 
   if (hours > 0) {

[Timeout] EqualityOperator
src/components/active-workout/ActiveWorkoutHeader.tsx:116:7
   const paddedMinutes = String(minutes).padStart(2, '0');
   const paddedSeconds = String(seconds).padStart(2, '0');
 
-  if (hours > 0) {
+  if (hours >= 0) {
     return `${String(hours).padStart(2, '0')}:${paddedMinutes}:${paddedSeconds}`;
   }

[Timeout] EqualityOperator
src/components/active-workout/ActiveWorkoutHeader.tsx:116:7
   const paddedMinutes = String(minutes).padStart(2, '0');
   const paddedSeconds = String(seconds).padStart(2, '0');
 
-  if (hours > 0) {
+  if (hours <= 0) {
     return `${String(hours).padStart(2, '0')}:${paddedMinutes}:${paddedSeconds}`;
   }

[Timeout] StringLiteral
src/components/active-workout/ActiveWorkoutHeader.tsx:117:41
   const paddedSeconds = String(seconds).padStart(2, '0');
 
   if (hours > 0) {
-    return `${String(hours).padStart(2, '0')}:${paddedMinutes}:${paddedSeconds}`;
+    return `${String(hours).padStart(2, "")}:${paddedMinutes}:${paddedSeconds}`;
   }
   return `${paddedMinutes}:${paddedSeconds}`;

[Timeout] StringLiteral
src/components/active-workout/ActiveWorkoutHeader.tsx:119:10
   if (hours > 0) {
     return `${String(hours).padStart(2, '0')}:${paddedMinutes}:${paddedSeconds}`;
   }
-  return `${paddedMinutes}:${paddedSeconds}`;
+  return ``;
 }
 
