[Timeout] BlockStatement
src/components/active-workout/CueManager.tsx:18:43
 }: CueManagerProps) {
   const [cueInput, setCueInput] = useState<string>('');
 
-  const handleAddCue = (value: string) => {
-    onAddCue(value);
-    setCueInput('');
-  };
+  const handleAddCue = (value: string) => {};
 
   const cueItems = cues.map((cue, index) => ({

[Timeout] CallExpression
src/components/active-workout/CueManager.tsx:19:5
   const [cueInput, setCueInput] = useState<string>('');
 
   const handleAddCue = (value: string) => {
-    onAddCue(value);
+    ;
     setCueInput('');
   };

[Timeout] ArrowFunction
src/components/active-workout/CueManager.tsx:23:29
     setCueInput('');
   };
 
-  const cueItems = cues.map((cue, index) => ({
-    id: `cue-${index}`,
-    content: cue,
-  }));
+  const cueItems = cues.map(() => undefined);
 
   const handleRemoveCue = (id: string) => {

[Timeout] ObjectLiteral
src/components/active-workout/CueManager.tsx:23:46
     setCueInput('');
   };
 
-  const cueItems = cues.map((cue, index) => ({
-    id: `cue-${index}`,
-    content: cue,
-  }));
+  const cueItems = cues.map((cue, index) => ({}));
 
   const handleRemoveCue = (id: string) => {

[Timeout] BlockStatement
src/components/active-workout/CueManager.tsx:28:43
     content: cue,
   }));
 
-  const handleRemoveCue = (id: string) => {
-    const index = parseInt(id.replace('cue-', ''), 10);
-    onRemoveCue(index);
-  };
+  const handleRemoveCue = (id: string) => {};
 
   return (

[Timeout] CallExpression
src/components/active-workout/CueManager.tsx:30:5
 
   const handleRemoveCue = (id: string) => {
     const index = parseInt(id.replace('cue-', ''), 10);
-    onRemoveCue(index);
+    ;
   };
 

[Timeout] ArrowFunction
src/components/active-workout/CueManager.tsx:38:19
       <h2>Cues da Sessão (Lembretes)</h2>
       <MtInputForm
         value={cueInput}
-        onChange={(event) => setCueInput(event.target.value)}
+        onChange={() => undefined}
         onSubmit={handleAddCue}
         placeholder="Ex: Controlar a descida no agachamento"
