[Timeout] StringLiteral
src/components/active-workout/ExerciseSearch.tsx:19:58
   onAddExercise,
   getSuggestions,
 }: ExerciseSearchProps) {
-  const [searchInput, setSearchInput] = useState<string>('');
+  const [searchInput, setSearchInput] = useState<string>("Stryker was here!");
   const [suggestions, setSuggestions] = useState<ExerciseSuggestion[]>([]);
 

[Timeout] BlockStatement
src/components/active-workout/ExerciseSearch.tsx:22:19
   const [searchInput, setSearchInput] = useState<string>('');
   const [suggestions, setSuggestions] = useState<ExerciseSuggestion[]>([]);
 
-  useEffect(() => {
-    if (searchInput.trim() === '') {
-      setSuggestions([]);
-    } else {
-      setSuggestions(getSuggestions(searchInput));
-    }
-  }, [searchInput, getSuggestions]);
+  useEffect(() => {}, [searchInput, getSuggestions]);
 
   const handleSelectSuggestion = (suggestion: { id: string; label: string }) => {

[Timeout] EqualityOperator
src/components/active-workout/ExerciseSearch.tsx:23:9
   const [suggestions, setSuggestions] = useState<ExerciseSuggestion[]>([]);
 
   useEffect(() => {
-    if (searchInput.trim() === '') {
+    if (searchInput.trim() !== '') {
       setSuggestions([]);
     } else {

[Timeout] MethodExpression
src/components/active-workout/ExerciseSearch.tsx:23:9
   const [suggestions, setSuggestions] = useState<ExerciseSuggestion[]>([]);
 
   useEffect(() => {
-    if (searchInput.trim() === '') {
+    if (searchInput === '') {
       setSuggestions([]);
     } else {

[Timeout] ArrayDeclaration
src/components/active-workout/ExerciseSearch.tsx:24:22
 
   useEffect(() => {
     if (searchInput.trim() === '') {
-      setSuggestions([]);
+      setSuggestions(["Stryker was here"]);
     } else {
       setSuggestions(getSuggestions(searchInput));

[Timeout] BlockStatement
src/components/active-workout/ExerciseSearch.tsx:25:12
   useEffect(() => {
     if (searchInput.trim() === '') {
       setSuggestions([]);
-    } else {
-      setSuggestions(getSuggestions(searchInput));
-    }
+    } else {}
   }, [searchInput, getSuggestions]);
 

[Timeout] CallExpression
src/components/active-workout/ExerciseSearch.tsx:26:7
     if (searchInput.trim() === '') {
       setSuggestions([]);
     } else {
-      setSuggestions(getSuggestions(searchInput));
+      ;
     }
   }, [searchInput, getSuggestions]);

[Timeout] BlockStatement
src/components/active-workout/ExerciseSearch.tsx:30:81
     }
   }, [searchInput, getSuggestions]);
 
-  const handleSelectSuggestion = (suggestion: { id: string; label: string }) => {
-    onAddExercise(suggestion.id);
-    setSearchInput('');
-  };
+  const handleSelectSuggestion = (suggestion: { id: string; label: string }) => {};
 
   const suggestionItems = suggestions.map((suggestion) => ({

[Timeout] CallExpression
src/components/active-workout/ExerciseSearch.tsx:31:5
   }, [searchInput, getSuggestions]);
 
   const handleSelectSuggestion = (suggestion: { id: string; label: string }) => {
-    onAddExercise(suggestion.id);
+    ;
     setSearchInput('');
   };

[Timeout] StringLiteral
src/components/active-workout/ExerciseSearch.tsx:32:20
 
   const handleSelectSuggestion = (suggestion: { id: string; label: string }) => {
     onAddExercise(suggestion.id);
-    setSearchInput('');
+    setSearchInput("Stryker was here!");
   };
 

[Timeout] ArrowFunction
src/components/active-workout/ExerciseSearch.tsx:35:43
     setSearchInput('');
   };
 
-  const suggestionItems = suggestions.map((suggestion) => ({
-    id: suggestion.name,
-    label: suggestion.name,
-  }));
+  const suggestionItems = suggestions.map(() => undefined);
 
   const handleAddExercise = () => {

[Timeout] ObjectLiteral
src/components/active-workout/ExerciseSearch.tsx:35:60
     setSearchInput('');
   };
 
-  const suggestionItems = suggestions.map((suggestion) => ({
-    id: suggestion.name,
-    label: suggestion.name,
-  }));
+  const suggestionItems = suggestions.map((suggestion) => ({}));
 
   const handleAddExercise = () => {

[Timeout] BlockStatement
src/components/active-workout/ExerciseSearch.tsx:40:35
     label: suggestion.name,
   }));
 
-  const handleAddExercise = () => {
-    onAddExercise(searchInput);
-    setSearchInput('');
-  };
+  const handleAddExercise = () => {};
 
   return (

[Timeout] CallExpression
src/components/active-workout/ExerciseSearch.tsx:41:5
   }));
 
   const handleAddExercise = () => {
-    onAddExercise(searchInput);
+    ;
     setSearchInput('');
   };

[Timeout] StringLiteral
src/components/active-workout/ExerciseSearch.tsx:42:20
 
   const handleAddExercise = () => {
     onAddExercise(searchInput);
-    setSearchInput('');
+    setSearchInput("Stryker was here!");
   };
 

[Timeout] ObjectLiteral
src/components/active-workout/ExerciseSearch.tsx:46:38
   };
 
   return (
-    <section className="card" style={{ marginTop: 'var(--spacing-md)' }}>
+    <section className="card" style={{}}>
       <h2>Adicionar Exercício</h2>
       <div style={{ display: 'flex', gap: 'var(--spacing-xs)', marginTop: 'var(--spacing-xs)', position: 'relative' }}>

[Timeout] StringLiteral
src/components/active-workout/ExerciseSearch.tsx:48:75
   return (
     <section className="card" style={{ marginTop: 'var(--spacing-md)' }}>
       <h2>Adicionar Exercício</h2>
-      <div style={{ display: 'flex', gap: 'var(--spacing-xs)', marginTop: 'var(--spacing-xs)', position: 'relative' }}>
+      <div style={{ display: 'flex', gap: 'var(--spacing-xs)', marginTop: "", position: 'relative' }}>
         <MtInput
           value={searchInput}

[Timeout] ArrowFunction
src/components/active-workout/ExerciseSearch.tsx:51:21
       <div style={{ display: 'flex', gap: 'var(--spacing-xs)', marginTop: 'var(--spacing-xs)', position: 'relative' }}>
         <MtInput
           value={searchInput}
-          onChange={(event) => setSearchInput(event.target.value)}
+          onChange={() => undefined}
           placeholder="Buscar ou digitar nome do exercício..."
           onKeyDown={(event) => {

[Timeout] BlockStatement
src/components/active-workout/ExerciseSearch.tsx:53:33
           value={searchInput}
           onChange={(event) => setSearchInput(event.target.value)}
           placeholder="Buscar ou digitar nome do exercício..."
-          onKeyDown={(event) => {
-            if (event.key === 'Enter') {
-              handleAddExercise();
-            }
-          }}
+          onKeyDown={(event) => {}}
         />
         <MtButton

[Timeout] EqualityOperator
src/components/active-workout/ExerciseSearch.tsx:54:17
           onChange={(event) => setSearchInput(event.target.value)}
           placeholder="Buscar ou digitar nome do exercício..."
           onKeyDown={(event) => {
-            if (event.key === 'Enter') {
+            if (event.key !== 'Enter') {
               handleAddExercise();
             }

[Timeout] ConditionalExpression
src/components/active-workout/ExerciseSearch.tsx:54:17
           onChange={(event) => setSearchInput(event.target.value)}
           placeholder="Buscar ou digitar nome do exercício..."
           onKeyDown={(event) => {
-            if (event.key === 'Enter') {
+            if (true) {
               handleAddExercise();
             }

[Timeout] CallExpression
src/components/active-workout/ExerciseSearch.tsx:55:15
           placeholder="Buscar ou digitar nome do exercício..."
           onKeyDown={(event) => {
             if (event.key === 'Enter') {
-              handleAddExercise();
+              ;
             }
           }}
