[Timeout] BlockStatement
src/components/history/ActiveWorkoutCard.tsx:9:107
   formatWorkoutDate: (dateString: string) => string;
 }
 
-export function ActiveWorkoutCard({ activeSession, onResume, formatWorkoutDate }: ActiveWorkoutCardProps) {
-  return (
-    <div className="card" style={{ 
-      borderLeft: '4px solid var(--warning-color)',
-      marginBottom: 'var(--spacing-md)'
-    }}>
-      <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
-        <div>
-          <h3 style={{ color: 'var(--warning-color)', marginBottom: '4px' }}>Treino em Andamento</h3>
-          <p className="text-secondary" style={{ fontSize: '0.85rem' }}>
-            Iniciado em: {formatWorkoutDate(activeSession.date)}
-          </p>
-        </div>
-        <button className="primary small" onClick={onResume}>
-          Retomar
-        </button>
-      </div>
-    </div>
-  );
-}
+export function ActiveWorkoutCard({ activeSession, onResume, formatWorkoutDate }: ActiveWorkoutCardProps) {}

[Timeout] StringLiteral
src/components/history/ActiveWorkoutCard.tsx:15:30
       borderLeft: '4px solid var(--warning-color)',
       marginBottom: 'var(--spacing-md)'
     }}>
-      <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
+      <div style={{ display: "", justifyContent: 'space-between', alignItems: 'center' }}>
         <div>
           <h3 style={{ color: 'var(--warning-color)', marginBottom: '4px' }}>Treino em Andamento</h3>

[Timeout] StringLiteral
src/components/history/ActiveWorkoutCard.tsx:15:54
       borderLeft: '4px solid var(--warning-color)',
       marginBottom: 'var(--spacing-md)'
     }}>
-      <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
+      <div style={{ display: 'flex', justifyContent: "", alignItems: 'center' }}>
         <div>
           <h3 style={{ color: 'var(--warning-color)', marginBottom: '4px' }}>Treino em Andamento</h3>

[Timeout] ObjectLiteral
src/components/history/ActiveWorkoutCard.tsx:17:22
     }}>
       <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
         <div>
-          <h3 style={{ color: 'var(--warning-color)', marginBottom: '4px' }}>Treino em Andamento</h3>
+          <h3 style={{}}>Treino em Andamento</h3>
           <p className="text-secondary" style={{ fontSize: '0.85rem' }}>
             Iniciado em: {formatWorkoutDate(activeSession.date)}

[Timeout] StringLiteral
src/components/history/ActiveWorkoutCard.tsx:18:60
       <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
         <div>
           <h3 style={{ color: 'var(--warning-color)', marginBottom: '4px' }}>Treino em Andamento</h3>
-          <p className="text-secondary" style={{ fontSize: '0.85rem' }}>
+          <p className="text-secondary" style={{ fontSize: "" }}>
             Iniciado em: {formatWorkoutDate(activeSession.date)}
           </p>
