[Timeout] BlockStatement
src/components/history/BackupSection.tsx:30:88
   const fileInputRef = useRef<HTMLInputElement>(null);
   const { workoutsSinceLastBackup, exportBackup, importBackup } = useBackupSection(workoutHistoryLength);
 
-  const handleFileUpload = useCallback((event: React.ChangeEvent<HTMLInputElement>) => {
-    const fileList = event.target.files;
-    if (!fileList || fileList.length === 0) {
-      return;
-    }
-
-    const selectedFile = fileList[0];
-    const fileReader = new FileReader();
-
-    fileReader.onload = (fileEvent) => {
-      const fileContent = fileEvent.target?.result;
-      if (typeof fileContent === 'string') {
-        const importSucceeded = importBackup(fileContent);
-        if (importSucceeded) {
-          onImportSuccess();
-          alert('Dados importados com sucesso!');
-        } else {
-          alert('Erro ao importar. Verifique se o arquivo JSON está no formato correto.');
-        }
-      }
-    };
-
-    fileReader.readAsText(selectedFile);
-  }, [importBackup, onImportSuccess]);
+  const handleFileUpload = useCallback((event: React.ChangeEvent<HTMLInputElement>) => {}, [importBackup, onImportSuccess]);
 
   const handleExportBackup = useCallback(() => {

[Timeout] BooleanLiteral
src/components/history/BackupSection.tsx:32:9
 
   const handleFileUpload = useCallback((event: React.ChangeEvent<HTMLInputElement>) => {
     const fileList = event.target.files;
-    if (!fileList || fileList.length === 0) {
+    if (fileList || fileList.length === 0) {
       return;
     }

[Timeout] BlockStatement
src/components/history/BackupSection.tsx:32:45
 
   const handleFileUpload = useCallback((event: React.ChangeEvent<HTMLInputElement>) => {
     const fileList = event.target.files;
-    if (!fileList || fileList.length === 0) {
-      return;
-    }
+    if (!fileList || fileList.length === 0) {}
 
     const selectedFile = fileList[0];

[Timeout] BlockStatement
src/components/history/BackupSection.tsx:39:40
     const selectedFile = fileList[0];
     const fileReader = new FileReader();
 
-    fileReader.onload = (fileEvent) => {
-      const fileContent = fileEvent.target?.result;
-      if (typeof fileContent === 'string') {
-        const importSucceeded = importBackup(fileContent);
-        if (importSucceeded) {
-          onImportSuccess();
-          alert('Dados importados com sucesso!');
-        } else {
-          alert('Erro ao importar. Verifique se o arquivo JSON está no formato correto.');
-        }
-      }
-    };
+    fileReader.onload = (fileEvent) => {};
 
     fileReader.readAsText(selectedFile);

[Timeout] OptionalChaining
src/components/history/BackupSection.tsx:40:27
     const fileReader = new FileReader();
 
     fileReader.onload = (fileEvent) => {
-      const fileContent = fileEvent.target?.result;
+      const fileContent = fileEvent.target.result;
       if (typeof fileContent === 'string') {
         const importSucceeded = importBackup(fileContent);

[Timeout] ConditionalExpression
src/components/history/BackupSection.tsx:41:11
 
     fileReader.onload = (fileEvent) => {
       const fileContent = fileEvent.target?.result;
-      if (typeof fileContent === 'string') {
+      if (false) {
         const importSucceeded = importBackup(fileContent);
         if (importSucceeded) {

[Timeout] ConditionalExpression
src/components/history/BackupSection.tsx:41:11
 
     fileReader.onload = (fileEvent) => {
       const fileContent = fileEvent.target?.result;
-      if (typeof fileContent === 'string') {
+      if (true) {
         const importSucceeded = importBackup(fileContent);
         if (importSucceeded) {

[Timeout] ConditionalExpression
src/components/history/BackupSection.tsx:43:13
       const fileContent = fileEvent.target?.result;
       if (typeof fileContent === 'string') {
         const importSucceeded = importBackup(fileContent);
-        if (importSucceeded) {
+        if (false) {
           onImportSuccess();
           alert('Dados importados com sucesso!');

[Timeout] BlockStatement
src/components/history/BackupSection.tsx:43:30
       const fileContent = fileEvent.target?.result;
       if (typeof fileContent === 'string') {
         const importSucceeded = importBackup(fileContent);
-        if (importSucceeded) {
-          onImportSuccess();
-          alert('Dados importados com sucesso!');
-        } else {
+        if (importSucceeded) {} else {
           alert('Erro ao importar. Verifique se o arquivo JSON está no formato correto.');
         }

[Timeout] CallExpression
src/components/history/BackupSection.tsx:44:11
       if (typeof fileContent === 'string') {
         const importSucceeded = importBackup(fileContent);
         if (importSucceeded) {
-          onImportSuccess();
+          ;
           alert('Dados importados com sucesso!');
         } else {

[Timeout] BlockStatement
src/components/history/BackupSection.tsx:46:16
         if (importSucceeded) {
           onImportSuccess();
           alert('Dados importados com sucesso!');
-        } else {
-          alert('Erro ao importar. Verifique se o arquivo JSON está no formato correto.');
-        }
+        } else {}
       }
     };

[Timeout] CallExpression
src/components/history/BackupSection.tsx:52:5
       }
     };
 
-    fileReader.readAsText(selectedFile);
+    ;
   }, [importBackup, onImportSuccess]);
 

[Timeout] ArrayDeclaration
src/components/history/BackupSection.tsx:53:6
     };
 
     fileReader.readAsText(selectedFile);
-  }, [importBackup, onImportSuccess]);
+  }, []);
 
   const handleExportBackup = useCallback(() => {

[Timeout] BlockStatement
src/components/history/BackupSection.tsx:55:48
     fileReader.readAsText(selectedFile);
   }, [importBackup, onImportSuccess]);
 
-  const handleExportBackup = useCallback(() => {
-    exportBackup();
-  }, [exportBackup]);
+  const handleExportBackup = useCallback(() => {}, [exportBackup]);
 
   const handleTriggerFileInput = useCallback(() => {

[Timeout] CallExpression
src/components/history/BackupSection.tsx:56:5
   }, [importBackup, onImportSuccess]);
 
   const handleExportBackup = useCallback(() => {
-    exportBackup();
+    ;
   }, [exportBackup]);
 

[Timeout] ArrayDeclaration
src/components/history/BackupSection.tsx:57:6
 
   const handleExportBackup = useCallback(() => {
     exportBackup();
-  }, [exportBackup]);
+  }, []);
 
   const handleTriggerFileInput = useCallback(() => {

[Timeout] BlockStatement
src/components/history/BackupSection.tsx:59:52
     exportBackup();
   }, [exportBackup]);
 
-  const handleTriggerFileInput = useCallback(() => {
-    fileInputRef.current?.click();
-  }, []);
+  const handleTriggerFileInput = useCallback(() => {}, []);
 
   return (

[Timeout] OptionalChaining
src/components/history/BackupSection.tsx:60:5
   }, [exportBackup]);
 
   const handleTriggerFileInput = useCallback(() => {
-    fileInputRef.current?.click();
+    fileInputRef.current.click();
   }, []);
 

[Timeout] ObjectLiteral
src/components/history/BackupSection.tsx:68:19
       <MtSectionTitle icon={<CloudUpload size={18} strokeWidth={2} color="var(--accent-color)" />}>
         Backup
       </MtSectionTitle>
-      <div style={{ display: 'flex', gap: 'var(--spacing-xs)', marginTop: 'var(--spacing-xs)' }}>
+      <div style={{}}>
         <MtButton size="small" onClick={handleExportBackup} style={{ flex: 1 }}>
           <Download size={14} strokeWidth={2.5} strokeLinecap="round" strokeLinejoin="round" />

[Timeout] ObjectLiteral
src/components/history/BackupSection.tsx:69:68
         Backup
       </MtSectionTitle>
       <div style={{ display: 'flex', gap: 'var(--spacing-xs)', marginTop: 'var(--spacing-xs)' }}>
-        <MtButton size="small" onClick={handleExportBackup} style={{ flex: 1 }}>
+        <MtButton size="small" onClick={handleExportBackup} style={{}}>
           <Download size={14} strokeWidth={2.5} strokeLinecap="round" strokeLinejoin="round" />
           Exportar

[Timeout] ConditionalExpression
src/components/history/BackupSection.tsx:85:8
           style={{ display: 'none' }}
         />
       </div>
-      {workoutsSinceLastBackup > 0 && (
-        <MtAlert variant="warning" style={{ marginTop: 'var(--spacing-xs)' }}>
-          {workoutsSinceLastBackup} {workoutsSinceLastBackup === 1 ? 'treino novo' : 'treinos novos'} desde último backup
-        </MtAlert>
-      )}
+      {false}
     </section>
   );

[Timeout] LogicalOperator
src/components/history/BackupSection.tsx:85:8
           style={{ display: 'none' }}
         />
       </div>
-      {workoutsSinceLastBackup > 0 && (
-        <MtAlert variant="warning" style={{ marginTop: 'var(--spacing-xs)' }}>
-          {workoutsSinceLastBackup} {workoutsSinceLastBackup === 1 ? 'treino novo' : 'treinos novos'} desde último backup
-        </MtAlert>
-      )}
+      {workoutsSinceLastBackup > 0 || <MtAlert variant="warning" style={{
+  marginTop: 'var(--spacing-xs)'
+}}>
+          {workoutsSinceLastBackup} {workoutsSinceLastBackup === 1 ? 'treino novo' : 'treinos novos'} desde último backup
+        </MtAlert>}
     </section>
   );

[Timeout] EqualityOperator
src/components/history/BackupSection.tsx:87:38
       </div>
       {workoutsSinceLastBackup > 0 && (
         <MtAlert variant="warning" style={{ marginTop: 'var(--spacing-xs)' }}>
-          {workoutsSinceLastBackup} {workoutsSinceLastBackup === 1 ? 'treino novo' : 'treinos novos'} desde último backup
+          {workoutsSinceLastBackup} {workoutsSinceLastBackup !== 1 ? 'treino novo' : 'treinos novos'} desde último backup
         </MtAlert>
       )}

[Timeout] ConditionalExpression
src/components/history/BackupSection.tsx:87:38
       </div>
       {workoutsSinceLastBackup > 0 && (
         <MtAlert variant="warning" style={{ marginTop: 'var(--spacing-xs)' }}>
-          {workoutsSinceLastBackup} {workoutsSinceLastBackup === 1 ? 'treino novo' : 'treinos novos'} desde último backup
+          {workoutsSinceLastBackup} {false ? 'treino novo' : 'treinos novos'} desde último backup
         </MtAlert>
       )}
