[Timeout] ObjectLiteral
src/components/history/FloatingActionButton.tsx:22:14
       onClick={onClick}
       title={title}
       aria-label={ariaLabel}
-      style={{
-        position: 'fixed',
-        bottom: '24px',
-        right: '24px',
-        width: '56px',
-        height: '56px',
-        borderRadius: '50%',
-        fontSize: '28px',
-        boxShadow: '0 4px 12px rgba(0, 0, 0, 0.2)',
-        padding: '0',
-        display: 'flex',
-        alignItems: 'center',
-        justifyContent: 'center',
-        border: 'none',
-        lineHeight: '1',
-        zIndex: 99,
-      }}
+      style={{}}
     >
       {children}

[Timeout] StringLiteral
src/components/history/FloatingActionButton.tsx:25:16
       style={{
         position: 'fixed',
         bottom: '24px',
-        right: '24px',
+        right: "",
         width: '56px',
         height: '56px',

[Timeout] StringLiteral
src/components/history/FloatingActionButton.tsx:27:17
         bottom: '24px',
         right: '24px',
         width: '56px',
-        height: '56px',
+        height: "",
         borderRadius: '50%',
         fontSize: '28px',

[Timeout] StringLiteral
src/components/history/FloatingActionButton.tsx:28:23
         right: '24px',
         width: '56px',
         height: '56px',
-        borderRadius: '50%',
+        borderRadius: "",
         fontSize: '28px',
         boxShadow: '0 4px 12px rgba(0, 0, 0, 0.2)',
