[Timeout] BlockStatement
src/components/history/VersionInfo.tsx:5:60
   version: string;
 }
 
-export function VersionInfo({ version }: VersionInfoProps) {
-  return (
-    <span
-      style={{
-        position: 'fixed',
-        bottom: '24px',
-        left: '24px',
-        fontSize: '0.75rem',
-        color: 'var(--text-secondary)',
-        opacity: 0.4,
-        userSelect: 'none',
-        pointerEvents: 'none',
-        zIndex: 99,
-      }}
-    >
-      v{version}
-    </span>
-  );
-}
+export function VersionInfo({ version }: VersionInfoProps) {}

[Timeout] ObjectLiteral
src/components/history/VersionInfo.tsx:8:14
 export function VersionInfo({ version }: VersionInfoProps) {
   return (
     <span
-      style={{
-        position: 'fixed',
-        bottom: '24px',
-        left: '24px',
-        fontSize: '0.75rem',
-        color: 'var(--text-secondary)',
-        opacity: 0.4,
-        userSelect: 'none',
-        pointerEvents: 'none',
-        zIndex: 99,
-      }}
+      style={{}}
     >
       v{version}

[Timeout] StringLiteral
src/components/history/VersionInfo.tsx:11:15
       style={{
         position: 'fixed',
         bottom: '24px',
-        left: '24px',
+        left: "",
         fontSize: '0.75rem',
         color: 'var(--text-secondary)',

[Timeout] StringLiteral
src/components/history/VersionInfo.tsx:13:16
         bottom: '24px',
         left: '24px',
         fontSize: '0.75rem',
-        color: 'var(--text-secondary)',
+        color: "",
         opacity: 0.4,
         userSelect: 'none',
