[Timeout] BlockStatement
src/components/history/WorkoutHistoryItem.tsx:22:46
 }: WorkoutHistoryItemProps) {
   const timerRef = useRef<number | null>(null);
 
-  const handleTouchStart = useCallback(() => {
-    timerRef.current = window.setTimeout(() => {
-      onLongPress(session.id);
-    }, 600);
-  }, [session.id, onLongPress]);
+  const handleTouchStart = useCallback(() => {}, [session.id, onLongPress]);
 
   const handleTouchEnd = useCallback(() => {

[Timeout] BlockStatement
src/components/history/WorkoutHistoryItem.tsx:23:48
   const timerRef = useRef<number | null>(null);
 
   const handleTouchStart = useCallback(() => {
-    timerRef.current = window.setTimeout(() => {
-      onLongPress(session.id);
-    }, 600);
+    timerRef.current = window.setTimeout(() => {}, 600);
   }, [session.id, onLongPress]);
 

[Timeout] CallExpression
src/components/history/WorkoutHistoryItem.tsx:24:7
 
   const handleTouchStart = useCallback(() => {
     timerRef.current = window.setTimeout(() => {
-      onLongPress(session.id);
+      ;
     }, 600);
   }, [session.id, onLongPress]);

[Timeout] BlockStatement
src/components/history/WorkoutHistoryItem.tsx:28:44
     }, 600);
   }, [session.id, onLongPress]);
 
-  const handleTouchEnd = useCallback(() => {
-    if (timerRef.current) {
-      clearTimeout(timerRef.current);
-      timerRef.current = null;
-    }
-  }, []);
+  const handleTouchEnd = useCallback(() => {}, []);
 
   const handleTouchMove = useCallback(() => {

[Timeout] BlockStatement
src/components/history/WorkoutHistoryItem.tsx:29:27
   }, [session.id, onLongPress]);
 
   const handleTouchEnd = useCallback(() => {
-    if (timerRef.current) {
-      clearTimeout(timerRef.current);
-      timerRef.current = null;
-    }
+    if (timerRef.current) {}
   }, []);
 

[Timeout] ConditionalExpression
src/components/history/WorkoutHistoryItem.tsx:29:9
   }, [session.id, onLongPress]);
 
   const handleTouchEnd = useCallback(() => {
-    if (timerRef.current) {
+    if (false) {
       clearTimeout(timerRef.current);
       timerRef.current = null;

[Timeout] CallExpression
src/components/history/WorkoutHistoryItem.tsx:30:7
 
   const handleTouchEnd = useCallback(() => {
     if (timerRef.current) {
-      clearTimeout(timerRef.current);
+      ;
       timerRef.current = null;
     }

[Timeout] BlockStatement
src/components/history/WorkoutHistoryItem.tsx:35:45
     }
   }, []);
 
-  const handleTouchMove = useCallback(() => {
-    if (timerRef.current) {
-      clearTimeout(timerRef.current);
-      timerRef.current = null;
-    }
-  }, []);
+  const handleTouchMove = useCallback(() => {}, []);
 
   const handleContextMenu = useCallback((e: React.MouseEvent) => {

[Timeout] ConditionalExpression
src/components/history/WorkoutHistoryItem.tsx:36:9
   }, []);
 
   const handleTouchMove = useCallback(() => {
-    if (timerRef.current) {
+    if (false) {
       clearTimeout(timerRef.current);
       timerRef.current = null;

[Timeout] BlockStatement
src/components/history/WorkoutHistoryItem.tsx:36:27
   }, []);
 
   const handleTouchMove = useCallback(() => {
-    if (timerRef.current) {
-      clearTimeout(timerRef.current);
-      timerRef.current = null;
-    }
+    if (timerRef.current) {}
   }, []);
 

[Timeout] BlockStatement
src/components/history/WorkoutHistoryItem.tsx:42:66
     }
   }, []);
 
-  const handleContextMenu = useCallback((e: React.MouseEvent) => {
-    e.preventDefault();
-    onLongPress(session.id);
-  }, [session.id, onLongPress]);
+  const handleContextMenu = useCallback((e: React.MouseEvent) => {}, [session.id, onLongPress]);
 
   return (

[Timeout] CallExpression
src/components/history/WorkoutHistoryItem.tsx:43:5
   }, []);
 
   const handleContextMenu = useCallback((e: React.MouseEvent) => {
-    e.preventDefault();
+    ;
     onLongPress(session.id);
   }, [session.id, onLongPress]);

[Timeout] CallExpression
src/components/history/WorkoutHistoryItem.tsx:44:5
 
   const handleContextMenu = useCallback((e: React.MouseEvent) => {
     e.preventDefault();
-    onLongPress(session.id);
+    ;
   }, [session.id, onLongPress]);
 

[Timeout] ArrayDeclaration
src/components/history/WorkoutHistoryItem.tsx:45:6
   const handleContextMenu = useCallback((e: React.MouseEvent) => {
     e.preventDefault();
     onLongPress(session.id);
-  }, [session.id, onLongPress]);
+  }, []);
 
   return (

[Timeout] ArrowFunction
src/components/history/WorkoutHistoryItem.tsx:50:16
   return (
     <div
       className="workout-history-item"
-      onClick={() => onTap(session)}
+      onClick={() => undefined}
       onContextMenu={handleContextMenu}
       onTouchStart={handleTouchStart}

[Timeout] EqualityOperator
src/components/history/WorkoutHistoryItem.tsx:58:12
     >
       <div className="workout-history-item__header">
         <strong className="workout-history-item__name">
-          {session.name !== 'Treino Livre' ? session.name : 'Treino Livre'}
+          {session.name === 'Treino Livre' ? session.name : 'Treino Livre'}
         </strong>
         <span className="workout-history-item__duration">

[Timeout] ConditionalExpression
src/components/history/WorkoutHistoryItem.tsx:58:12
     >
       <div className="workout-history-item__header">
         <strong className="workout-history-item__name">
-          {session.name !== 'Treino Livre' ? session.name : 'Treino Livre'}
+          {true ? session.name : 'Treino Livre'}
         </strong>
         <span className="workout-history-item__duration">
