[Timeout] ConditionalExpression
src/components/history/WorkoutHistoryList.tsx:23:7
   formatWorkoutDuration,
   onCreateFirstWorkout,
 }: WorkoutHistoryListProps) {
-  if (sessions.length === 0) {
+  if (true) {
     return (
       <MtEmptyState

[Timeout] BlockStatement
src/components/history/WorkoutHistoryList.tsx:23:30
   formatWorkoutDuration,
   onCreateFirstWorkout,
 }: WorkoutHistoryListProps) {
-  if (sessions.length === 0) {
-    return (
-      <MtEmptyState
-        icon={
-          <Sun size={48} strokeWidth={1.5} color="var(--text-light)" />
-        }
-        title="Nenhum treino registrado"
-        actionLabel="Criar primeiro treino"
-        onAction={onCreateFirstWorkout}
-      />
-    );
-  }
+  if (sessions.length === 0) {}
 
   return (

[Timeout] StringLiteral
src/components/history/WorkoutHistoryList.tsx:37:66
   }
 
   return (
-    <div style={{ display: 'flex', flexDirection: 'column', gap: 'var(--spacing-sm)' }}>
+    <div style={{ display: 'flex', flexDirection: 'column', gap: "" }}>
       {sessions.map((session) => (
         <WorkoutHistoryItem

[Timeout] ArrowFunction
src/components/history/WorkoutHistoryList.tsx:38:21
 
   return (
     <div style={{ display: 'flex', flexDirection: 'column', gap: 'var(--spacing-sm)' }}>
-      {sessions.map((session) => (
-        <WorkoutHistoryItem
-          key={session.id}
-          session={session}
-          onTap={onSessionTap}
-          onLongPress={onSessionLongPress}
-          formatWorkoutDate={formatWorkoutDate}
-          formatWorkoutDuration={formatWorkoutDuration}
-        />
-      ))}
+      {sessions.map(() => undefined)}
     </div>
   );
