[Timeout] ArrowFunction
src/components/history/useBackupSection.ts:33:5
   );
 
   const workoutsSinceLastBackup = useMemo(
-    () => Math.max(0, workoutHistoryLength - lastBackupWorkoutCount),
+    () => undefined,
     [workoutHistoryLength, lastBackupWorkoutCount]
   );

[Timeout] ArithmeticOperator
src/components/history/useBackupSection.ts:33:23
   );
 
   const workoutsSinceLastBackup = useMemo(
-    () => Math.max(0, workoutHistoryLength - lastBackupWorkoutCount),
+    () => Math.max(0, workoutHistoryLength + lastBackupWorkoutCount),
     [workoutHistoryLength, lastBackupWorkoutCount]
   );

[Timeout] BlockStatement
src/components/history/useBackupSection.ts:37:42
     [workoutHistoryLength, lastBackupWorkoutCount]
   );
 
-  const exportBackup = useCallback(() => {
-    exportWorkoutBackup();
-    setLastBackupWorkoutCount(workoutHistoryLength);
-  }, [workoutHistoryLength]);
+  const exportBackup = useCallback(() => {}, [workoutHistoryLength]);
 
   const importBackup = useCallback((jsonString: string): boolean => {

[Timeout] CallExpression
src/components/history/useBackupSection.ts:38:5
   );
 
   const exportBackup = useCallback(() => {
-    exportWorkoutBackup();
+    ;
     setLastBackupWorkoutCount(workoutHistoryLength);
   }, [workoutHistoryLength]);

[Timeout] CallExpression
src/components/history/useBackupSection.ts:39:5
 
   const exportBackup = useCallback(() => {
     exportWorkoutBackup();
-    setLastBackupWorkoutCount(workoutHistoryLength);
+    ;
   }, [workoutHistoryLength]);
 

[Timeout] BlockStatement
src/components/history/useBackupSection.ts:42:69
     setLastBackupWorkoutCount(workoutHistoryLength);
   }, [workoutHistoryLength]);
 
-  const importBackup = useCallback((jsonString: string): boolean => {
-    const importSucceeded = importWorkoutBackup(jsonString);
-    if (importSucceeded) {
-      setLastBackupWorkoutCount(getWorkoutHistory().length);
-    }
-    return importSucceeded;
-  }, []);
+  const importBackup = useCallback((jsonString: string): boolean => {}, []);
 
   return {

[Timeout] ConditionalExpression
src/components/history/useBackupSection.ts:44:9
 
   const importBackup = useCallback((jsonString: string): boolean => {
     const importSucceeded = importWorkoutBackup(jsonString);
-    if (importSucceeded) {
+    if (true) {
       setLastBackupWorkoutCount(getWorkoutHistory().length);
     }

[Timeout] ConditionalExpression
src/components/history/useBackupSection.ts:44:9
 
   const importBackup = useCallback((jsonString: string): boolean => {
     const importSucceeded = importWorkoutBackup(jsonString);
-    if (importSucceeded) {
+    if (false) {
       setLastBackupWorkoutCount(getWorkoutHistory().length);
     }

[Timeout] CallExpression
src/components/history/useBackupSection.ts:45:7
   const importBackup = useCallback((jsonString: string): boolean => {
     const importSucceeded = importWorkoutBackup(jsonString);
     if (importSucceeded) {
-      setLastBackupWorkoutCount(getWorkoutHistory().length);
+      ;
     }
     return importSucceeded;

[Timeout] ObjectLiteral
src/components/history/useBackupSection.ts:50:10
     return importSucceeded;
   }, []);
 
-  return {
-    workoutsSinceLastBackup,
-    exportBackup,
-    importBackup,
-  };
+  return {};
 }
 
