[Timeout] EqualityOperator
src/components/ui/EditableList.tsx:22:7
   emptyMessage = 'Nenhum item',
   renderItem,
 }: EditableListProps) {
-  if (items.length === 0) {
+  if (items.length !== 0) {
     return (
       <p className="text-secondary" style={{ fontSize: '0.85rem', fontStyle: 'italic' }}>

[Timeout] ConditionalExpression
src/components/ui/EditableList.tsx:22:7
   emptyMessage = 'Nenhum item',
   renderItem,
 }: EditableListProps) {
-  if (items.length === 0) {
+  if (false) {
     return (
       <p className="text-secondary" style={{ fontSize: '0.85rem', fontStyle: 'italic' }}>

[Timeout] StringLiteral
src/components/ui/EditableList.tsx:24:56
 }: EditableListProps) {
   if (items.length === 0) {
     return (
-      <p className="text-secondary" style={{ fontSize: '0.85rem', fontStyle: 'italic' }}>
+      <p className="text-secondary" style={{ fontSize: "", fontStyle: 'italic' }}>
         {emptyMessage}
       </p>

[Timeout] StringLiteral
src/components/ui/EditableList.tsx:36:18
         display: 'flex',
         justifyContent: 'space-between',
         alignItems: 'center',
-        padding: '6px 10px',
+        padding: "",
         backgroundColor: 'var(--background-color)',
         borderRadius: 'var(--border-radius)',

[Timeout] StringLiteral
src/components/ui/EditableList.tsx:38:23
         alignItems: 'center',
         padding: '6px 10px',
         backgroundColor: 'var(--background-color)',
-        borderRadius: 'var(--border-radius)',
+        borderRadius: "",
         fontSize: '0.9rem',
       }}

[Timeout] StringLiteral
src/components/ui/EditableList.tsx:39:19
         padding: '6px 10px',
         backgroundColor: 'var(--background-color)',
         borderRadius: 'var(--border-radius)',
-        fontSize: '0.9rem',
+        fontSize: "",
       }}
     >

[Timeout] StringLiteral
src/components/ui/EditableList.tsx:48:19
         style={{
           padding: '0 4px',
           fontSize: '0.8rem',
-          border: 'none',
+          border: "",
           boxShadow: 'none',
           background: 'none',

[Timeout] StringLiteral
src/components/ui/EditableList.tsx:50:23
           fontSize: '0.8rem',
           border: 'none',
           boxShadow: 'none',
-          background: 'none',
+          background: "",
         }}
         onClick={() => onRemove(item.id)}

[Timeout] ArrowFunction
src/components/ui/EditableList.tsx:52:18
           boxShadow: 'none',
           background: 'none',
         }}
-        onClick={() => onRemove(item.id)}
+        onClick={() => undefined}
         title="Remover"
       >

[Timeout] StringLiteral
src/components/ui/EditableList.tsx:61:29
   );
 
   return (
-    <ul style={{ listStyle: 'none', display: 'flex', flexDirection: 'column', gap: '4px', marginTop: 'var(--spacing-sm)' }}>
+    <ul style={{ listStyle: "", display: 'flex', flexDirection: 'column', gap: '4px', marginTop: 'var(--spacing-sm)' }}>
       {items.map((item, index) => (
         <li key={item.id}>

[Timeout] StringLiteral
src/components/ui/EditableList.tsx:61:46
   );
 
   return (
-    <ul style={{ listStyle: 'none', display: 'flex', flexDirection: 'column', gap: '4px', marginTop: 'var(--spacing-sm)' }}>
+    <ul style={{ listStyle: 'none', display: "", flexDirection: 'column', gap: '4px', marginTop: 'var(--spacing-sm)' }}>
       {items.map((item, index) => (
         <li key={item.id}>

[Timeout] ArrowFunction
src/components/ui/EditableList.tsx:62:18
 
   return (
     <ul style={{ listStyle: 'none', display: 'flex', flexDirection: 'column', gap: '4px', marginTop: 'var(--spacing-sm)' }}>
-      {items.map((item, index) => (
-        <li key={item.id}>
-          {renderItem ? renderItem(item, index) : defaultRenderItem(item)}
-        </li>
-      ))}
+      {items.map(() => undefined)}
     </ul>
   );
