[Timeout] ObjectLiteral
src/components/ui/MtAlert.tsx:14:12
 }
 
 const variantStyles: Record<MtAlertVariant, { bg: string; color: string }> = {
-  warning: { bg: 'var(--warning-light)', color: 'var(--warning-color)' },
+  warning: {},
   danger: { bg: 'var(--danger-light)', color: 'var(--danger-color)' },
   success: { bg: 'var(--success-light)', color: 'var(--success-color)' },

[Timeout] StringLiteral
src/components/ui/MtAlert.tsx:15:17
 
 const variantStyles: Record<MtAlertVariant, { bg: string; color: string }> = {
   warning: { bg: 'var(--warning-light)', color: 'var(--warning-color)' },
-  danger: { bg: 'var(--danger-light)', color: 'var(--danger-color)' },
+  danger: { bg: "", color: 'var(--danger-color)' },
   success: { bg: 'var(--success-light)', color: 'var(--success-color)' },
   info: { bg: 'var(--accent-light)', color: 'var(--accent-color)' },

[Timeout] ObjectLiteral
src/components/ui/MtAlert.tsx:16:12
 const variantStyles: Record<MtAlertVariant, { bg: string; color: string }> = {
   warning: { bg: 'var(--warning-light)', color: 'var(--warning-color)' },
   danger: { bg: 'var(--danger-light)', color: 'var(--danger-color)' },
-  success: { bg: 'var(--success-light)', color: 'var(--success-color)' },
+  success: {},
   info: { bg: 'var(--accent-light)', color: 'var(--accent-color)' },
 };

[Timeout] StringLiteral
src/components/ui/MtAlert.tsx:17:45
   warning: { bg: 'var(--warning-light)', color: 'var(--warning-color)' },
   danger: { bg: 'var(--danger-light)', color: 'var(--danger-color)' },
   success: { bg: 'var(--success-light)', color: 'var(--success-color)' },
-  info: { bg: 'var(--accent-light)', color: 'var(--accent-color)' },
+  info: { bg: 'var(--accent-light)', color: "" },
 };
 

[Timeout] BlockStatement
src/components/ui/MtAlert.tsx:20:50
   info: { bg: 'var(--accent-light)', color: 'var(--accent-color)' },
 };
 
-const defaultIcon = (variant: MtAlertVariant) => {
-  const size = 14;
-  const strokeWidth = 2.5;
-  switch (variant) {
-    case 'warning':
-      return <AlertTriangle size={size} strokeWidth={strokeWidth} />;
-    case 'danger':
-      return <XCircle size={size} strokeWidth={strokeWidth} />;
-    case 'success':
-      return <CheckCircle size={size} strokeWidth={strokeWidth} />;
-    case 'info':
-    default:
-      return <Info size={size} strokeWidth={strokeWidth} />;
-  }
-};
+const defaultIcon = (variant: MtAlertVariant) => {};
 export function MtAlert({ variant = 'info', icon, children, style }: MtAlertProps) {
   const colors = variantStyles[variant];

[Timeout] ConditionalExpression
src/components/ui/MtAlert.tsx:24:5
   const size = 14;
   const strokeWidth = 2.5;
   switch (variant) {
-    case 'warning':
-      return <AlertTriangle size={size} strokeWidth={strokeWidth} />;
+    case 'warning':
     case 'danger':
       return <XCircle size={size} strokeWidth={strokeWidth} />;

[Timeout] ConditionalExpression
src/components/ui/MtAlert.tsx:26:5
   switch (variant) {
     case 'warning':
       return <AlertTriangle size={size} strokeWidth={strokeWidth} />;
-    case 'danger':
-      return <XCircle size={size} strokeWidth={strokeWidth} />;
+    case 'danger':
     case 'success':
       return <CheckCircle size={size} strokeWidth={strokeWidth} />;

[Timeout] StringLiteral
src/components/ui/MtAlert.tsx:26:10
   switch (variant) {
     case 'warning':
       return <AlertTriangle size={size} strokeWidth={strokeWidth} />;
-    case 'danger':
+    case "":
       return <XCircle size={size} strokeWidth={strokeWidth} />;
     case 'success':

[Timeout] ConditionalExpression
src/components/ui/MtAlert.tsx:28:5
       return <AlertTriangle size={size} strokeWidth={strokeWidth} />;
     case 'danger':
       return <XCircle size={size} strokeWidth={strokeWidth} />;
-    case 'success':
-      return <CheckCircle size={size} strokeWidth={strokeWidth} />;
+    case 'success':
     case 'info':
     default:

[Timeout] StringLiteral
src/components/ui/MtAlert.tsx:30:10
       return <XCircle size={size} strokeWidth={strokeWidth} />;
     case 'success':
       return <CheckCircle size={size} strokeWidth={strokeWidth} />;
-    case 'info':
+    case "":
     default:
       return <Info size={size} strokeWidth={strokeWidth} />;

[Timeout] ConditionalExpression
src/components/ui/MtAlert.tsx:31:5
     case 'success':
       return <CheckCircle size={size} strokeWidth={strokeWidth} />;
     case 'info':
-    default:
-      return <Info size={size} strokeWidth={strokeWidth} />;
+    default:
   }
 };

[Timeout] BlockStatement
src/components/ui/MtAlert.tsx:35:84
       return <Info size={size} strokeWidth={strokeWidth} />;
   }
 };
-export function MtAlert({ variant = 'info', icon, children, style }: MtAlertProps) {
-  const colors = variantStyles[variant];
-
-  return (
-    <div
-      style={{
-        display: 'flex',
-        alignItems: 'center',
-        gap: '6px',
-        padding: '8px 10px',
-        backgroundColor: colors.bg,
-        borderRadius: 'var(--border-radius)',
-        fontSize: '0.8rem',
-        color: colors.color,
-        fontWeight: 600,
-        ...style,
-      }}
-    >
-      {icon ?? defaultIcon(variant)}
-      {children}
-    </div>
-  );
-}
+export function MtAlert({ variant = 'info', icon, children, style }: MtAlertProps) {}
 

[Timeout] ObjectLiteral
src/components/ui/MtAlert.tsx:40:14
 
   return (
     <div
-      style={{
-        display: 'flex',
-        alignItems: 'center',
-        gap: '6px',
-        padding: '8px 10px',
-        backgroundColor: colors.bg,
-        borderRadius: 'var(--border-radius)',
-        fontSize: '0.8rem',
-        color: colors.color,
-        fontWeight: 600,
-        ...style,
-      }}
+      style={{}}
     >
       {icon ?? defaultIcon(variant)}

[Timeout] StringLiteral
src/components/ui/MtAlert.tsx:47:19
         padding: '8px 10px',
         backgroundColor: colors.bg,
         borderRadius: 'var(--border-radius)',
-        fontSize: '0.8rem',
+        fontSize: "",
         color: colors.color,
         fontWeight: 600,

[Timeout] LogicalOperator
src/components/ui/MtAlert.tsx:53:8
         ...style,
       }}
     >
-      {icon ?? defaultIcon(variant)}
+      {icon && defaultIcon(variant)}
       {children}
     </div>
