[Timeout] StringLiteral
src/components/ui/MtButton.tsx:20:13
 export function MtButton({
   children,
   onClick,
-  variant = 'default',
+  variant = "",
   size = 'medium',
   style,

[Timeout] StringLiteral
src/components/ui/MtButton.tsx:21:10
   children,
   onClick,
   variant = 'default',
-  size = 'medium',
+  size = "",
   style,
   title,

[Timeout] BooleanLiteral
src/components/ui/MtButton.tsx:24:14
   size = 'medium',
   style,
   title,
-  disabled = false,
+  disabled = true,
   type = 'button',
 }: MtButtonProps) {

[Timeout] StringLiteral
src/components/ui/MtButton.tsx:25:10
   style,
   title,
   disabled = false,
-  type = 'button',
+  type = "",
 }: MtButtonProps) {
   const variantClass = variant === 'default' ? '' : ` ${variant}`;

[Timeout] BlockStatement
src/components/ui/MtButton.tsx:26:19
   title,
   disabled = false,
   type = 'button',
-}: MtButtonProps) {
-  const variantClass = variant === 'default' ? '' : ` ${variant}`;
-  const sizeClass = size === 'small' ? ' small' : '';
-
-  return (
-    <button
-      type={type}
-      className={`${variantClass}${sizeClass}`.trim()}
-      onClick={onClick}
-      title={title}
-      disabled={disabled}
-      style={{
-        display: 'flex',
-        alignItems: 'center',
-        justifyContent: 'center',
-        gap: '6px',
-        ...style,
-        opacity: disabled ? 0.5 : 1,
-      }}
-    >
-      {children}
-    </button>
-  );
-}
+}: MtButtonProps) {}

[Timeout] ConditionalExpression
src/components/ui/MtButton.tsx:27:24
   disabled = false,
   type = 'button',
 }: MtButtonProps) {
-  const variantClass = variant === 'default' ? '' : ` ${variant}`;
+  const variantClass = false ? '' : ` ${variant}`;
   const sizeClass = size === 'small' ? ' small' : '';
 

[Timeout] ConditionalExpression
src/components/ui/MtButton.tsx:27:24
   disabled = false,
   type = 'button',
 }: MtButtonProps) {
-  const variantClass = variant === 'default' ? '' : ` ${variant}`;
+  const variantClass = true ? '' : ` ${variant}`;
   const sizeClass = size === 'small' ? ' small' : '';
 

[Timeout] ConditionalExpression
src/components/ui/MtButton.tsx:28:21
   type = 'button',
 }: MtButtonProps) {
   const variantClass = variant === 'default' ? '' : ` ${variant}`;
-  const sizeClass = size === 'small' ? ' small' : '';
+  const sizeClass = true ? ' small' : '';
 
   return (

[Timeout] EqualityOperator
src/components/ui/MtButton.tsx:28:21
   type = 'button',
 }: MtButtonProps) {
   const variantClass = variant === 'default' ? '' : ` ${variant}`;
-  const sizeClass = size === 'small' ? ' small' : '';
+  const sizeClass = size !== 'small' ? ' small' : '';
 
   return (

[Timeout] MethodExpression
src/components/ui/MtButton.tsx:33:18
   return (
     <button
       type={type}
-      className={`${variantClass}${sizeClass}`.trim()}
+      className={`${variantClass}${sizeClass}`}
       onClick={onClick}
       title={title}
