[Timeout] StringLiteral
src/components/ui/MtEmptyState.tsx:26:10
   description,
   actionLabel,
   onAction,
-  size = 'large',
+  size = "",
   align = 'center',
   style,

[Timeout] ConditionalExpression
src/components/ui/MtEmptyState.tsx:31:7
   style,
 }: MtEmptyStateProps) {
   // Estado vazio compacto, usado inline dentro de seções (ex: lista de séries).
-  if (size === 'small') {
+  if (false) {
     if (!description && !actionLabel) {
       return (

[Timeout] EqualityOperator
src/components/ui/MtEmptyState.tsx:31:7
   style,
 }: MtEmptyStateProps) {
   // Estado vazio compacto, usado inline dentro de seções (ex: lista de séries).
-  if (size === 'small') {
+  if (size !== 'small') {
     if (!description && !actionLabel) {
       return (

[Timeout] BooleanLiteral
src/components/ui/MtEmptyState.tsx:32:25
 }: MtEmptyStateProps) {
   // Estado vazio compacto, usado inline dentro de seções (ex: lista de séries).
   if (size === 'small') {
-    if (!description && !actionLabel) {
+    if (!description && actionLabel) {
       return (
         <p className="text-secondary" style={{ fontSize: '0.85rem', fontStyle: 'italic', ...style }}>

[Timeout] ConditionalExpression
src/components/ui/MtEmptyState.tsx:32:9
 }: MtEmptyStateProps) {
   // Estado vazio compacto, usado inline dentro de seções (ex: lista de séries).
   if (size === 'small') {
-    if (!description && !actionLabel) {
+    if (true) {
       return (
         <p className="text-secondary" style={{ fontSize: '0.85rem', fontStyle: 'italic', ...style }}>

[Timeout] StringLiteral
src/components/ui/MtEmptyState.tsx:42:58
 
     return (
       <div style={style}>
-        <p className="text-secondary" style={{ fontSize: '0.85rem', fontStyle: 'italic', margin: 0 }}>
+        <p className="text-secondary" style={{ fontSize: "", fontStyle: 'italic', margin: 0 }}>
           {title}
         </p>

[Timeout] StringLiteral
src/components/ui/MtEmptyState.tsx:42:80
 
     return (
       <div style={style}>
-        <p className="text-secondary" style={{ fontSize: '0.85rem', fontStyle: 'italic', margin: 0 }}>
+        <p className="text-secondary" style={{ fontSize: '0.85rem', fontStyle: "", margin: 0 }}>
           {title}
         </p>

[Timeout] ConditionalExpression
src/components/ui/MtEmptyState.tsx:45:10
         <p className="text-secondary" style={{ fontSize: '0.85rem', fontStyle: 'italic', margin: 0 }}>
           {title}
         </p>
-        {description && (
-          <p className="text-secondary" style={{ fontSize: '0.8rem', fontStyle: 'italic', margin: 'var(--spacing-xs) 0 0' }}>
-            {description}
-          </p>
-        )}
+        {true}
         {actionLabel && onAction && (
           <MtButton variant="primary" onClick={onAction} style={{ marginTop: 'var(--spacing-sm)' }}>

[Timeout] ConditionalExpression
src/components/ui/MtEmptyState.tsx:45:10
         <p className="text-secondary" style={{ fontSize: '0.85rem', fontStyle: 'italic', margin: 0 }}>
           {title}
         </p>
-        {description && (
-          <p className="text-secondary" style={{ fontSize: '0.8rem', fontStyle: 'italic', margin: 'var(--spacing-xs) 0 0' }}>
-            {description}
-          </p>
-        )}
+        {false}
         {actionLabel && onAction && (
           <MtButton variant="primary" onClick={onAction} style={{ marginTop: 'var(--spacing-sm)' }}>

[Timeout] ObjectLiteral
src/components/ui/MtEmptyState.tsx:46:48
           {title}
         </p>
         {description && (
-          <p className="text-secondary" style={{ fontSize: '0.8rem', fontStyle: 'italic', margin: 'var(--spacing-xs) 0 0' }}>
+          <p className="text-secondary" style={{}}>
             {description}
           </p>

[Timeout] StringLiteral
src/components/ui/MtEmptyState.tsx:46:60
           {title}
         </p>
         {description && (
-          <p className="text-secondary" style={{ fontSize: '0.8rem', fontStyle: 'italic', margin: 'var(--spacing-xs) 0 0' }}>
+          <p className="text-secondary" style={{ fontSize: "", fontStyle: 'italic', margin: 'var(--spacing-xs) 0 0' }}>
             {description}
           </p>

[Timeout] ConditionalExpression
src/components/ui/MtEmptyState.tsx:50:10
             {description}
           </p>
         )}
-        {actionLabel && onAction && (
-          <MtButton variant="primary" onClick={onAction} style={{ marginTop: 'var(--spacing-sm)' }}>
-            {actionLabel}
-          </MtButton>
-        )}
+        {true}
       </div>
     );

[Timeout] ConditionalExpression
src/components/ui/MtEmptyState.tsx:50:10
             {description}
           </p>
         )}
-        {actionLabel && onAction && (
+        {true && (
           <MtButton variant="primary" onClick={onAction} style={{ marginTop: 'var(--spacing-sm)' }}>
             {actionLabel}

[Timeout] EqualityOperator
src/components/ui/MtEmptyState.tsx:59:22
     );
   }
 
-  const isCentered = align === 'center';
+  const isCentered = align !== 'center';
 
   return (

[Timeout] ConditionalExpression
src/components/ui/MtEmptyState.tsx:59:22
     );
   }
 
-  const isCentered = align === 'center';
+  const isCentered = false;
 
   return (

[Timeout] ConditionalExpression
src/components/ui/MtEmptyState.tsx:73:8
         ...style,
       }}
     >
-      {icon && <div style={{ opacity: 0.5 }}>{icon}</div>}
+      {false}
       <p
         className="text-secondary"

[Timeout] LogicalOperator
src/components/ui/MtEmptyState.tsx:73:8
         ...style,
       }}
     >
-      {icon && <div style={{ opacity: 0.5 }}>{icon}</div>}
+      {icon || <div style={{
+  opacity: 0.5
+}}>{icon}</div>}
       <p
         className="text-secondary"

[Timeout] StringLiteral
src/components/ui/MtEmptyState.tsx:77:21
       <p
         className="text-secondary"
         style={{
-          fontSize: '0.95rem',
+          fontSize: "",
           fontWeight: 500,
           margin: 0,

[Timeout] ConditionalExpression
src/components/ui/MtEmptyState.tsx:85:8
       >
         {title}
       </p>
-      {description && (
-        <p className="text-secondary" style={{ fontSize: '0.85rem', margin: 0 }}>
-          {description}
-        </p>
-      )}
+      {false}
       {actionLabel && onAction && (
         <MtButton variant="primary" onClick={onAction}>

[Timeout] ConditionalExpression
src/components/ui/MtEmptyState.tsx:85:8
       >
         {title}
       </p>
-      {description && (
-        <p className="text-secondary" style={{ fontSize: '0.85rem', margin: 0 }}>
-          {description}
-        </p>
-      )}
+      {true}
       {actionLabel && onAction && (
         <MtButton variant="primary" onClick={onAction}>

[Timeout] ObjectLiteral
src/components/ui/MtEmptyState.tsx:86:46
         {title}
       </p>
       {description && (
-        <p className="text-secondary" style={{ fontSize: '0.85rem', margin: 0 }}>
+        <p className="text-secondary" style={{}}>
           {description}
         </p>

[Timeout] StringLiteral
src/components/ui/MtEmptyState.tsx:86:58
         {title}
       </p>
       {description && (
-        <p className="text-secondary" style={{ fontSize: '0.85rem', margin: 0 }}>
+        <p className="text-secondary" style={{ fontSize: "", margin: 0 }}>
           {description}
         </p>

[Timeout] LogicalOperator
src/components/ui/MtEmptyState.tsx:90:8
           {description}
         </p>
       )}
-      {actionLabel && onAction && (
+      {actionLabel || onAction && (
         <MtButton variant="primary" onClick={onAction}>
           {actionLabel}

[Timeout] ConditionalExpression
src/components/ui/MtEmptyState.tsx:90:8
           {description}
         </p>
       )}
-      {actionLabel && onAction && (
-        <MtButton variant="primary" onClick={onAction}>
-          {actionLabel}
-        </MtButton>
-      )}
+      {true}
     </div>
   );
