[Timeout] StringLiteral
src/components/ui/MtField.tsx:20:10
   value,
   onChange,
   placeholder = '',
-  type = 'text',
+  type = "",
   step,
   required,

[Timeout] BlockStatement
src/components/ui/MtField.tsx:25:18
   required,
   style,
   labelStyle,
-}: MtFieldProps) {
-  return (
-    <div style={style}>
-      <label style={labelStyle}>{label}</label>
-      <input
-        type={type}
-        value={value}
-        onChange={onChange}
-        placeholder={placeholder}
-        step={step}
-        required={required}
-      />
-    </div>
-  );
-}
+}: MtFieldProps) {}
