[Timeout] BlockStatement
src/components/ui/MtInput.tsx:19:18
   type = 'text',
   style,
   onKeyDown,
-}: MtInputProps) {
-  return (
-    <input
-      type={type}
-      value={value}
-      onChange={onChange}
-      placeholder={placeholder}
-      style={style}
-      onKeyDown={onKeyDown}
-    />
-  );
-}
+}: MtInputProps) {}
