[Timeout] MethodExpression
src/components/ui/MtLastWorkoutSets.tsx:35:29
    * então basta pegar a primeira que combinar.
    */
   const ultimoTreino = useMemo(() => {
-    const nomeNormalizado = exerciseName.trim().toLowerCase();
+    const nomeNormalizado = exerciseName.trim().toUpperCase();
     if (nomeNormalizado === '') {
       return null;

[Timeout] MethodExpression
src/components/ui/MtLastWorkoutSets.tsx:35:29
    * então basta pegar a primeira que combinar.
    */
   const ultimoTreino = useMemo(() => {
-    const nomeNormalizado = exerciseName.trim().toLowerCase();
+    const nomeNormalizado = exerciseName.toLowerCase();
     if (nomeNormalizado === '') {
       return null;

[Timeout] ConditionalExpression
src/components/ui/MtLastWorkoutSets.tsx:36:9
    */
   const ultimoTreino = useMemo(() => {
     const nomeNormalizado = exerciseName.trim().toLowerCase();
-    if (nomeNormalizado === '') {
+    if (true) {
       return null;
     }

[Timeout] ConditionalExpression
src/components/ui/MtLastWorkoutSets.tsx:36:9
    */
   const ultimoTreino = useMemo(() => {
     const nomeNormalizado = exerciseName.trim().toLowerCase();
-    if (nomeNormalizado === '') {
+    if (false) {
       return null;
     }

[Timeout] BlockStatement
src/components/ui/MtLastWorkoutSets.tsx:41:36
     }
 
     const sessaoEncontrada = workoutHistory.find(
-      (session: WorkoutSession) => {
-        const contemExercicio = session.exercises.some(
-          (exercise) => exercise.name.trim().toLowerCase() === nomeNormalizado
-        );
-        return session.status === 'completed' && contemExercicio;
-      }
+      (session: WorkoutSession) => {}
     );
 

[Timeout] MethodExpression
src/components/ui/MtLastWorkoutSets.tsx:42:33
 
     const sessaoEncontrada = workoutHistory.find(
       (session: WorkoutSession) => {
-        const contemExercicio = session.exercises.some(
-          (exercise) => exercise.name.trim().toLowerCase() === nomeNormalizado
-        );
+        const contemExercicio = session.exercises.every(exercise => exercise.name.trim().toLowerCase() === nomeNormalizado);
         return session.status === 'completed' && contemExercicio;
       }

[Timeout] MethodExpression
src/components/ui/MtLastWorkoutSets.tsx:43:25
     const sessaoEncontrada = workoutHistory.find(
       (session: WorkoutSession) => {
         const contemExercicio = session.exercises.some(
-          (exercise) => exercise.name.trim().toLowerCase() === nomeNormalizado
+          (exercise) => exercise.name.trim().toUpperCase() === nomeNormalizado
         );
         return session.status === 'completed' && contemExercicio;

[Timeout] ArrowFunction
src/components/ui/MtLastWorkoutSets.tsx:43:11
     const sessaoEncontrada = workoutHistory.find(
       (session: WorkoutSession) => {
         const contemExercicio = session.exercises.some(
-          (exercise) => exercise.name.trim().toLowerCase() === nomeNormalizado
+          () => undefined
         );
         return session.status === 'completed' && contemExercicio;

[Timeout] EqualityOperator
src/components/ui/MtLastWorkoutSets.tsx:45:16
         const contemExercicio = session.exercises.some(
           (exercise) => exercise.name.trim().toLowerCase() === nomeNormalizado
         );
-        return session.status === 'completed' && contemExercicio;
+        return session.status !== 'completed' && contemExercicio;
       }
     );

[Timeout] ConditionalExpression
src/components/ui/MtLastWorkoutSets.tsx:45:16
         const contemExercicio = session.exercises.some(
           (exercise) => exercise.name.trim().toLowerCase() === nomeNormalizado
         );
-        return session.status === 'completed' && contemExercicio;
+        return true;
       }
     );

[Timeout] ConditionalExpression
src/components/ui/MtLastWorkoutSets.tsx:49:9
       }
     );
 
-    if (!sessaoEncontrada) {
+    if (false) {
       return null;
     }

[Timeout] BooleanLiteral
src/components/ui/MtLastWorkoutSets.tsx:49:9
       }
     );
 
-    if (!sessaoEncontrada) {
+    if (sessaoEncontrada) {
       return null;
     }

[Timeout] MethodExpression
src/components/ui/MtLastWorkoutSets.tsx:54:21
     }
 
     const exercicioDoUltimoTreino = sessaoEncontrada.exercises.find(
-      (exercise) => exercise.name.trim().toLowerCase() === nomeNormalizado
+      (exercise) => exercise.name.trim().toUpperCase() === nomeNormalizado
     );
 

[Timeout] MethodExpression
src/components/ui/MtLastWorkoutSets.tsx:54:21
     }
 
     const exercicioDoUltimoTreino = sessaoEncontrada.exercises.find(
-      (exercise) => exercise.name.trim().toLowerCase() === nomeNormalizado
+      (exercise) => exercise.name.toLowerCase() === nomeNormalizado
     );
 

[Timeout] LogicalOperator
src/components/ui/MtLastWorkoutSets.tsx:57:9
       (exercise) => exercise.name.trim().toLowerCase() === nomeNormalizado
     );
 
-    if (!exercicioDoUltimoTreino || exercicioDoUltimoTreino.sets.length === 0) {
+    if (!exercicioDoUltimoTreino && exercicioDoUltimoTreino.sets.length === 0) {
       return null;
     }

[Timeout] ConditionalExpression
src/components/ui/MtLastWorkoutSets.tsx:57:9
       (exercise) => exercise.name.trim().toLowerCase() === nomeNormalizado
     );
 
-    if (!exercicioDoUltimoTreino || exercicioDoUltimoTreino.sets.length === 0) {
+    if (false) {
       return null;
     }

[Timeout] BlockStatement
src/components/ui/MtLastWorkoutSets.tsx:70:66
   /**
    * Formata a data de um treino no padrão brasileiro (ex: "05/08, 14:30").
    */
-  const formatarDataDoTreino = (dataEmString: string): string => {
-    const data = new Date(dataEmString);
-    return data.toLocaleDateString('pt-BR', {
-      day: '2-digit',
-      month: '2-digit',
-      hour: '2-digit',
-      minute: '2-digit',
-    });
-  };
+  const formatarDataDoTreino = (dataEmString: string): string => {};
 
   return (

[Timeout] StringLiteral
src/components/ui/MtLastWorkoutSets.tsx:83:17
   return (
     <div
       style={{
-        border: '1px solid var(--border-color)',
+        border: "",
         borderRadius: 'var(--border-radius)',
         padding: 'var(--spacing-md)',

[Timeout] StringLiteral
src/components/ui/MtLastWorkoutSets.tsx:84:23
     <div
       style={{
         border: '1px solid var(--border-color)',
-        borderRadius: 'var(--border-radius)',
+        borderRadius: "",
         padding: 'var(--spacing-md)',
         backgroundColor: 'var(--background-color)',

[Timeout] StringLiteral
src/components/ui/MtLastWorkoutSets.tsx:85:18
       style={{
         border: '1px solid var(--border-color)',
         borderRadius: 'var(--border-radius)',
-        padding: 'var(--spacing-md)',
+        padding: "",
         backgroundColor: 'var(--background-color)',
       }}

[Timeout] StringLiteral
src/components/ui/MtLastWorkoutSets.tsx:86:26
         border: '1px solid var(--border-color)',
         borderRadius: 'var(--border-radius)',
         padding: 'var(--spacing-md)',
-        backgroundColor: 'var(--background-color)',
+        backgroundColor: "",
       }}
     >

[Timeout] ObjectLiteral
src/components/ui/MtLastWorkoutSets.tsx:107:20
         <>
           {/* Data do último treino em fonte menor e desativada */}
           <span
-            style={{
-              fontSize: '0.8rem',
-              color: 'var(--text-secondary)',
-              display: 'block',
-              marginBottom: 'var(--spacing-sm)',
-            }}
+            style={{}}
           >
             {formatarDataDoTreino(ultimoTreino.dataDoTreino)}

[Timeout] StringLiteral
src/components/ui/MtLastWorkoutSets.tsx:109:22
           <span
             style={{
               fontSize: '0.8rem',
-              color: 'var(--text-secondary)',
+              color: "",
               display: 'block',
               marginBottom: 'var(--spacing-sm)',

[Timeout] StringLiteral
src/components/ui/MtLastWorkoutSets.tsx:110:24
             style={{
               fontSize: '0.8rem',
               color: 'var(--text-secondary)',
-              display: 'block',
+              display: "",
               marginBottom: 'var(--spacing-sm)',
             }}

[Timeout] StringLiteral
src/components/ui/MtLastWorkoutSets.tsx:123:24
               listStyle: 'none',
               padding: 0,
               margin: 0,
-              display: 'flex',
+              display: "",
               flexDirection: 'column',
               gap: 'var(--spacing-xs)',

[Timeout] ObjectLiteral
src/components/ui/MtLastWorkoutSets.tsx:131:24
             {ultimoTreino.series.map((set, index) => (
               <li
                 key={index}
-                style={{
-                  display: 'flex',
-                  justifyContent: 'space-between',
-                  alignItems: 'center',
-                  padding: 'var(--spacing-xs) var(--spacing-sm)',
-                  backgroundColor: 'var(--card-background)',
-                  borderRadius: 'var(--border-radius)',
-                  fontSize: '0.95rem',
-                }}
+                style={{}}
               >
                 <span

[Timeout] StringLiteral
src/components/ui/MtLastWorkoutSets.tsx:138:29
                   padding: 'var(--spacing-xs) var(--spacing-sm)',
                   backgroundColor: 'var(--card-background)',
                   borderRadius: 'var(--border-radius)',
-                  fontSize: '0.95rem',
+                  fontSize: "",
                 }}
               >

[Timeout] ObjectLiteral
src/components/ui/MtLastWorkoutSets.tsx:142:26
                 }}
               >
                 <span
-                  style={{
-                    fontWeight: 600,
-                    color: 'var(--text-secondary)',
-                  }}
+                  style={{}}
                 >
                   #{index + 1}

[Timeout] ArithmeticOperator
src/components/ui/MtLastWorkoutSets.tsx:147:21
                     color: 'var(--text-secondary)',
                   }}
                 >
-                  #{index + 1}
+                  #{index - 1}
                 </span>
 

[Timeout] EqualityOperator
src/components/ui/MtLastWorkoutSets.tsx:159:18
                   <strong>{set.repetitions} reps</strong> @ {set.weightInKg}kg
                 </span>
 
-                {set.restTimeInSeconds > 0 && (
+                {set.restTimeInSeconds <= 0 && (
                   <span
                     style={{

[Timeout] ConditionalExpression
src/components/ui/MtLastWorkoutSets.tsx:159:18
                   <strong>{set.repetitions} reps</strong> @ {set.weightInKg}kg
                 </span>
 
-                {set.restTimeInSeconds > 0 && (
-                  <span
-                    style={{
-                      fontSize: '0.8rem',
-                      color: 'var(--text-secondary)',
-                    }}
-                  >
-                    {set.restTimeInSeconds}s
-                  </span>
-                )}
+                {true}
               </li>
             ))}

[Timeout] ObjectLiteral
src/components/ui/MtLastWorkoutSets.tsx:161:28
 
                 {set.restTimeInSeconds > 0 && (
                   <span
-                    style={{
-                      fontSize: '0.8rem',
-                      color: 'var(--text-secondary)',
-                    }}
+                    style={{}}
                   >
                     {set.restTimeInSeconds}s

[Timeout] StringLiteral
src/components/ui/MtLastWorkoutSets.tsx:162:33
                 {set.restTimeInSeconds > 0 && (
                   <span
                     style={{
-                      fontSize: '0.8rem',
+                      fontSize: "",
                       color: 'var(--text-secondary)',
                     }}

[Timeout] StringLiteral
src/components/ui/MtLastWorkoutSets.tsx:178:20
         <span
           style={{
             fontSize: '0.85rem',
-            color: 'var(--text-secondary)',
+            color: "",
             display: 'block',
             textAlign: 'center',
