[Timeout] BlockStatement
src/components/ui/MtSectionTitle.tsx:9:80
   style?: React.CSSProperties;
 }
 
-export function MtSectionTitle({ icon, children, style }: MtSectionTitleProps) {
-  return (
-    <div
-      style={{
-        display: 'flex',
-        alignItems: 'center',
-        gap: 'var(--spacing-sm)',
-        ...style,
-      }}
-    >
-      {icon}
-      <span style={{ fontSize: '0.9rem', fontWeight: 600, color: 'var(--text-primary)' }}>
-        {children}
-      </span>
-    </div>
-  );
-}
+export function MtSectionTitle({ icon, children, style }: MtSectionTitleProps) {}

[Timeout] StringLiteral
src/components/ui/MtSectionTitle.tsx:15:14
       style={{
         display: 'flex',
         alignItems: 'center',
-        gap: 'var(--spacing-sm)',
+        gap: "",
         ...style,
       }}
