[Timeout] StringLiteral
src/components/useExerciseScreen.ts:62:68
   onUpdateExercise,
 }: UseExerciseScreenProps): UseExerciseScreenResult {
   const [exercise, setExercise] = useState<WorkoutExercise>(initialExercise);
-  const [repetitionsInput, setRepetitionsInput] = useState<string>('');
+  const [repetitionsInput, setRepetitionsInput] = useState<string>("Stryker was here!");
   const [weightInput, setWeightInput] = useState<string>(
     initialExercise.weightInKg > 0 ? String(initialExercise.weightInKg) : ''

[Timeout] EqualityOperator
src/components/useExerciseScreen.ts:64:5
   const [exercise, setExercise] = useState<WorkoutExercise>(initialExercise);
   const [repetitionsInput, setRepetitionsInput] = useState<string>('');
   const [weightInput, setWeightInput] = useState<string>(
-    initialExercise.weightInKg > 0 ? String(initialExercise.weightInKg) : ''
+    initialExercise.weightInKg <= 0 ? String(initialExercise.weightInKg) : ''
   );
   const [restInput, setRestInput] = useState<string>('120');

[Timeout] EqualityOperator
src/components/useExerciseScreen.ts:64:5
   const [exercise, setExercise] = useState<WorkoutExercise>(initialExercise);
   const [repetitionsInput, setRepetitionsInput] = useState<string>('');
   const [weightInput, setWeightInput] = useState<string>(
-    initialExercise.weightInKg > 0 ? String(initialExercise.weightInKg) : ''
+    initialExercise.weightInKg >= 0 ? String(initialExercise.weightInKg) : ''
   );
   const [restInput, setRestInput] = useState<string>('120');

[Timeout] StringLiteral
src/components/useExerciseScreen.ts:66:54
   const [weightInput, setWeightInput] = useState<string>(
     initialExercise.weightInKg > 0 ? String(initialExercise.weightInKg) : ''
   );
-  const [restInput, setRestInput] = useState<string>('120');
+  const [restInput, setRestInput] = useState<string>("");
   const [selectedTechniques, setSelectedTechniques] = useState<AdvancedTechnique[]>([]);
 

[Timeout] BooleanLiteral
src/components/useExerciseScreen.ts:69:41
   const [restInput, setRestInput] = useState<string>('120');
   const [selectedTechniques, setSelectedTechniques] = useState<AdvancedTechnique[]>([]);
 
-  const restStopwatch = useStopwatch(0, false);
+  const restStopwatch = useStopwatch(0, true);
 
   const restTargetSeconds =

[Timeout] EqualityOperator
src/components/useExerciseScreen.ts:72:5
   const restStopwatch = useStopwatch(0, false);
 
   const restTargetSeconds =
-    exercise.sets.length > 0
+    exercise.sets.length >= 0
       ? exercise.sets[exercise.sets.length - 1].restTimeInSeconds
       : 0;

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:72:5
   const restStopwatch = useStopwatch(0, false);
 
   const restTargetSeconds =
-    exercise.sets.length > 0
+    true
       ? exercise.sets[exercise.sets.length - 1].restTimeInSeconds
       : 0;

[Timeout] ArithmeticOperator
src/components/useExerciseScreen.ts:73:23
 
   const restTargetSeconds =
     exercise.sets.length > 0
-      ? exercise.sets[exercise.sets.length - 1].restTimeInSeconds
+      ? exercise.sets[exercise.sets.length + 1].restTimeInSeconds
       : 0;
 

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:81:19
    * ou seja, quando o usuário navega para outro exercício. Os inputs de
    * série são reiniciados junto, mantendo o comportamento enxuto.
    */
-  useEffect(() => {
-    setExercise(initialExercise);
-    setRepetitionsInput('');
-    setWeightInput(initialExercise.weightInKg > 0 ? String(initialExercise.weightInKg) : '');
-    setRestInput('120');
-    setSelectedTechniques([]);
-  }, [initialExercise.id]);
+  useEffect(() => {}, [initialExercise.id]);
 
   /**

[Timeout] CallExpression
src/components/useExerciseScreen.ts:82:5
    * série são reiniciados junto, mantendo o comportamento enxuto.
    */
   useEffect(() => {
-    setExercise(initialExercise);
+    ;
     setRepetitionsInput('');
     setWeightInput(initialExercise.weightInKg > 0 ? String(initialExercise.weightInKg) : '');

[Timeout] EqualityOperator
src/components/useExerciseScreen.ts:84:20
   useEffect(() => {
     setExercise(initialExercise);
     setRepetitionsInput('');
-    setWeightInput(initialExercise.weightInKg > 0 ? String(initialExercise.weightInKg) : '');
+    setWeightInput(initialExercise.weightInKg <= 0 ? String(initialExercise.weightInKg) : '');
     setRestInput('120');
     setSelectedTechniques([]);

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:84:20
   useEffect(() => {
     setExercise(initialExercise);
     setRepetitionsInput('');
-    setWeightInput(initialExercise.weightInKg > 0 ? String(initialExercise.weightInKg) : '');
+    setWeightInput(true ? String(initialExercise.weightInKg) : '');
     setRestInput('120');
     setSelectedTechniques([]);

[Timeout] StringLiteral
src/components/useExerciseScreen.ts:85:18
     setExercise(initialExercise);
     setRepetitionsInput('');
     setWeightInput(initialExercise.weightInKg > 0 ? String(initialExercise.weightInKg) : '');
-    setRestInput('120');
+    setRestInput("");
     setSelectedTechniques([]);
   }, [initialExercise.id]);

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:95:43
    * synchronizar.
    */
   const updateExercise = useCallback(
-    (updatedExercise: WorkoutExercise) => {
-      setExercise(updatedExercise);
-      onUpdateExercise(updatedExercise);
-    },
+    (updatedExercise: WorkoutExercise) => {},
     [onUpdateExercise]
   );

[Timeout] CallExpression
src/components/useExerciseScreen.ts:96:7
    */
   const updateExercise = useCallback(
     (updatedExercise: WorkoutExercise) => {
-      setExercise(updatedExercise);
+      ;
       onUpdateExercise(updatedExercise);
     },

[Timeout] CallExpression
src/components/useExerciseScreen.ts:97:7
   const updateExercise = useCallback(
     (updatedExercise: WorkoutExercise) => {
       setExercise(updatedExercise);
-      onUpdateExercise(updatedExercise);
+      ;
     },
     [onUpdateExercise]

[Timeout] ArrayDeclaration
src/components/useExerciseScreen.ts:99:5
       setExercise(updatedExercise);
       onUpdateExercise(updatedExercise);
     },
-    [onUpdateExercise]
+    []
   );
 

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:103:47
   );
 
   const handleUpdateName = useCallback(
-    (event: ChangeEvent<HTMLInputElement>) => {
-      updateExercise({ ...exercise, name: event.target.value });
-    },
+    (event: ChangeEvent<HTMLInputElement>) => {},
     [exercise, updateExercise]
   );

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:110:47
   );
 
   const handleUpdateNotes = useCallback(
-    (event: ChangeEvent<HTMLInputElement>) => {
-      updateExercise({ ...exercise, notes: event.target.value });
-    },
+    (event: ChangeEvent<HTMLInputElement>) => {},
     [exercise, updateExercise]
   );

[Timeout] ObjectLiteral
src/components/useExerciseScreen.ts:111:22
 
   const handleUpdateNotes = useCallback(
     (event: ChangeEvent<HTMLInputElement>) => {
-      updateExercise({ ...exercise, notes: event.target.value });
+      updateExercise({});
     },
     [exercise, updateExercise]

[Timeout] ArrayDeclaration
src/components/useExerciseScreen.ts:113:5
     (event: ChangeEvent<HTMLInputElement>) => {
       updateExercise({ ...exercise, notes: event.target.value });
     },
-    [exercise, updateExercise]
+    []
   );
 

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:117:47
   );
 
   const handleUpdateReferenceWeight = useCallback(
-    (event: ChangeEvent<HTMLInputElement>) => {
-      const numericWeight = parseFloat(event.target.value) || 0;
-      updateExercise({ ...exercise, weightInKg: numericWeight });
-      setWeightInput(event.target.value);
-    },
+    (event: ChangeEvent<HTMLInputElement>) => {},
     [exercise, updateExercise]
   );

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:118:29
 
   const handleUpdateReferenceWeight = useCallback(
     (event: ChangeEvent<HTMLInputElement>) => {
-      const numericWeight = parseFloat(event.target.value) || 0;
+      const numericWeight = true;
       updateExercise({ ...exercise, weightInKg: numericWeight });
       setWeightInput(event.target.value);

[Timeout] LogicalOperator
src/components/useExerciseScreen.ts:118:29
 
   const handleUpdateReferenceWeight = useCallback(
     (event: ChangeEvent<HTMLInputElement>) => {
-      const numericWeight = parseFloat(event.target.value) || 0;
+      const numericWeight = parseFloat(event.target.value) && 0;
       updateExercise({ ...exercise, weightInKg: numericWeight });
       setWeightInput(event.target.value);

[Timeout] ObjectLiteral
src/components/useExerciseScreen.ts:119:22
   const handleUpdateReferenceWeight = useCallback(
     (event: ChangeEvent<HTMLInputElement>) => {
       const numericWeight = parseFloat(event.target.value) || 0;
-      updateExercise({ ...exercise, weightInKg: numericWeight });
+      updateExercise({});
       setWeightInput(event.target.value);
     },

[Timeout] CallExpression
src/components/useExerciseScreen.ts:120:7
     (event: ChangeEvent<HTMLInputElement>) => {
       const numericWeight = parseFloat(event.target.value) || 0;
       updateExercise({ ...exercise, weightInKg: numericWeight });
-      setWeightInput(event.target.value);
+      ;
     },
     [exercise, updateExercise]

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:125:79
     [exercise, updateExercise]
   );
 
-  const handleToggleTechnique = useCallback((technique: AdvancedTechnique) => {
-    setSelectedTechniques((previousTechniques) => {
-      if (previousTechniques.includes(technique)) {
-        return previousTechniques.filter((tech) => tech !== technique);
-      }
-      return [...previousTechniques, technique];
-    });
-  }, []);
+  const handleToggleTechnique = useCallback((technique: AdvancedTechnique) => {}, []);
 
   const handleAddSet = useCallback(() => {

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:126:51
   );
 
   const handleToggleTechnique = useCallback((technique: AdvancedTechnique) => {
-    setSelectedTechniques((previousTechniques) => {
-      if (previousTechniques.includes(technique)) {
-        return previousTechniques.filter((tech) => tech !== technique);
-      }
-      return [...previousTechniques, technique];
-    });
+    setSelectedTechniques((previousTechniques) => {});
   }, []);
 

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:127:11
 
   const handleToggleTechnique = useCallback((technique: AdvancedTechnique) => {
     setSelectedTechniques((previousTechniques) => {
-      if (previousTechniques.includes(technique)) {
+      if (false) {
         return previousTechniques.filter((tech) => tech !== technique);
       }

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:127:51
 
   const handleToggleTechnique = useCallback((technique: AdvancedTechnique) => {
     setSelectedTechniques((previousTechniques) => {
-      if (previousTechniques.includes(technique)) {
-        return previousTechniques.filter((tech) => tech !== technique);
-      }
+      if (previousTechniques.includes(technique)) {}
       return [...previousTechniques, technique];
     });

[Timeout] MethodExpression
src/components/useExerciseScreen.ts:128:16
   const handleToggleTechnique = useCallback((technique: AdvancedTechnique) => {
     setSelectedTechniques((previousTechniques) => {
       if (previousTechniques.includes(technique)) {
-        return previousTechniques.filter((tech) => tech !== technique);
+        return previousTechniques;
       }
       return [...previousTechniques, technique];

[Timeout] ArrowFunction
src/components/useExerciseScreen.ts:128:42
   const handleToggleTechnique = useCallback((technique: AdvancedTechnique) => {
     setSelectedTechniques((previousTechniques) => {
       if (previousTechniques.includes(technique)) {
-        return previousTechniques.filter((tech) => tech !== technique);
+        return previousTechniques.filter(() => undefined);
       }
       return [...previousTechniques, technique];

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:136:20
 
   const handleAddSet = useCallback(() => {
     const repetitions = parseInt(repetitionsInput, 10);
-    const weight = parseFloat(weightInput) || 0;
+    const weight = true;
     const rest = parseInt(restInput, 10) || 0;
 

[Timeout] LogicalOperator
src/components/useExerciseScreen.ts:136:20
 
   const handleAddSet = useCallback(() => {
     const repetitions = parseInt(repetitionsInput, 10);
-    const weight = parseFloat(weightInput) || 0;
+    const weight = parseFloat(weightInput) && 0;
     const rest = parseInt(restInput, 10) || 0;
 

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:137:18
   const handleAddSet = useCallback(() => {
     const repetitions = parseInt(repetitionsInput, 10);
     const weight = parseFloat(weightInput) || 0;
-    const rest = parseInt(restInput, 10) || 0;
+    const rest = false;
 
     if (isNaN(repetitions) || repetitions <= 0) {

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:137:18
   const handleAddSet = useCallback(() => {
     const repetitions = parseInt(repetitionsInput, 10);
     const weight = parseFloat(weightInput) || 0;
-    const rest = parseInt(restInput, 10) || 0;
+    const rest = true;
 
     if (isNaN(repetitions) || repetitions <= 0) {

[Timeout] LogicalOperator
src/components/useExerciseScreen.ts:139:9
     const weight = parseFloat(weightInput) || 0;
     const rest = parseInt(restInput, 10) || 0;
 
-    if (isNaN(repetitions) || repetitions <= 0) {
+    if (isNaN(repetitions) && repetitions <= 0) {
       alert('Por favor, informe um número válido de repetições.');
       return;

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:139:9
     const weight = parseFloat(weightInput) || 0;
     const rest = parseInt(restInput, 10) || 0;
 
-    if (isNaN(repetitions) || repetitions <= 0) {
+    if (false) {
       alert('Por favor, informe um número válido de repetições.');
       return;

[Timeout] ObjectLiteral
src/components/useExerciseScreen.ts:147:33
     // Se for FS (Feeder Set), o descanso é sempre 60s.
     const effectiveRest = selectedTechniques.includes('FS') ? 60 : rest;
 
-    const newSet: ExerciseSet = {
-      weightInKg: weight,
-      repetitions: repetitions,
-      restTimeInSeconds: effectiveRest,
-      advancedTechniques: [...selectedTechniques],
-    };
+    const newSet: ExerciseSet = {};
 
     updateExercise({ ...exercise, sets: [...exercise.sets, newSet] });

[Timeout] ObjectLiteral
src/components/useExerciseScreen.ts:154:20
       advancedTechniques: [...selectedTechniques],
     };
 
-    updateExercise({ ...exercise, sets: [...exercise.sets, newSet] });
+    updateExercise({});
     setRepetitionsInput('');
     setSelectedTechniques([]);

[Timeout] CallExpression
src/components/useExerciseScreen.ts:158:5
     setRepetitionsInput('');
     setSelectedTechniques([]);
     setRestInput('120');
-    restStopwatch.reset();
+    ;
   }, [repetitionsInput, weightInput, restInput, selectedTechniques, exercise, updateExercise, restStopwatch]);
 

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:162:35
   }, [repetitionsInput, weightInput, restInput, selectedTechniques, exercise, updateExercise, restStopwatch]);
 
   const handleDeleteSet = useCallback(
-    (setIndexToDelete: number) => {
-      updateExercise({
-        ...exercise,
-        sets: exercise.sets.filter((_, index) => index !== setIndexToDelete),
-      });
-    },
+    (setIndexToDelete: number) => {},
     [exercise, updateExercise]
   );

[Timeout] EqualityOperator
src/components/useExerciseScreen.ts:165:50
     (setIndexToDelete: number) => {
       updateExercise({
         ...exercise,
-        sets: exercise.sets.filter((_, index) => index !== setIndexToDelete),
+        sets: exercise.sets.filter((_, index) => index === setIndexToDelete),
       });
     },

[Timeout] ArrowFunction
src/components/useExerciseScreen.ts:165:36
     (setIndexToDelete: number) => {
       updateExercise({
         ...exercise,
-        sets: exercise.sets.filter((_, index) => index !== setIndexToDelete),
+        sets: exercise.sets.filter(() => undefined),
       });
     },

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:172:52
   );
 
   const handleUpdateSet = useCallback(
-    (setIndex: number, updatedSet: ExerciseSet) => {
-      updateExercise({
-        ...exercise,
-        sets: exercise.sets.map((currentSet, index) =>
-          index === setIndex ? updatedSet : currentSet
-        ),
-      });
-    },
+    (setIndex: number, updatedSet: ExerciseSet) => {},
     [exercise, updateExercise]
   );

[Timeout] ObjectLiteral
src/components/useExerciseScreen.ts:173:22
 
   const handleUpdateSet = useCallback(
     (setIndex: number, updatedSet: ExerciseSet) => {
-      updateExercise({
-        ...exercise,
-        sets: exercise.sets.map((currentSet, index) =>
-          index === setIndex ? updatedSet : currentSet
-        ),
-      });
+      updateExercise({});
     },
     [exercise, updateExercise]

[Timeout] ArrowFunction
src/components/useExerciseScreen.ts:175:33
     (setIndex: number, updatedSet: ExerciseSet) => {
       updateExercise({
         ...exercise,
-        sets: exercise.sets.map((currentSet, index) =>
-          index === setIndex ? updatedSet : currentSet
+        sets: exercise.sets.map(() => undefined
         ),
       });

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:176:11
       updateExercise({
         ...exercise,
         sets: exercise.sets.map((currentSet, index) =>
-          index === setIndex ? updatedSet : currentSet
+          false ? updatedSet : currentSet
         ),
       });

[Timeout] EqualityOperator
src/components/useExerciseScreen.ts:176:11
       updateExercise({
         ...exercise,
         sets: exercise.sets.map((currentSet, index) =>
-          index === setIndex ? updatedSet : currentSet
+          index !== setIndex ? updatedSet : currentSet
         ),
       });

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:184:24
   );
 
   const handleQuickAdjustReps = useCallback(
-    (delta: number) => {
-      const currentReps = parseInt(repetitionsInput, 10) || 0;
-      const newReps = Math.max(0, currentReps + delta);
-      setRepetitionsInput(String(newReps));
-    },
+    (delta: number) => {},
     [repetitionsInput]
   );

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:185:27
 
   const handleQuickAdjustReps = useCallback(
     (delta: number) => {
-      const currentReps = parseInt(repetitionsInput, 10) || 0;
+      const currentReps = true;
       const newReps = Math.max(0, currentReps + delta);
       setRepetitionsInput(String(newReps));

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:185:27
 
   const handleQuickAdjustReps = useCallback(
     (delta: number) => {
-      const currentReps = parseInt(repetitionsInput, 10) || 0;
+      const currentReps = false;
       const newReps = Math.max(0, currentReps + delta);
       setRepetitionsInput(String(newReps));

[Timeout] ArithmeticOperator
src/components/useExerciseScreen.ts:186:35
   const handleQuickAdjustReps = useCallback(
     (delta: number) => {
       const currentReps = parseInt(repetitionsInput, 10) || 0;
-      const newReps = Math.max(0, currentReps + delta);
+      const newReps = Math.max(0, currentReps - delta);
       setRepetitionsInput(String(newReps));
     },

[Timeout] MethodExpression
src/components/useExerciseScreen.ts:186:23
   const handleQuickAdjustReps = useCallback(
     (delta: number) => {
       const currentReps = parseInt(repetitionsInput, 10) || 0;
-      const newReps = Math.max(0, currentReps + delta);
+      const newReps = Math.min(0, currentReps + delta);
       setRepetitionsInput(String(newReps));
     },

[Timeout] CallExpression
src/components/useExerciseScreen.ts:187:7
     (delta: number) => {
       const currentReps = parseInt(repetitionsInput, 10) || 0;
       const newReps = Math.max(0, currentReps + delta);
-      setRepetitionsInput(String(newReps));
+      ;
     },
     [repetitionsInput]

[Timeout] ArrayDeclaration
src/components/useExerciseScreen.ts:189:5
       const newReps = Math.max(0, currentReps + delta);
       setRepetitionsInput(String(newReps));
     },
-    [repetitionsInput]
+    []
   );
 

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:192:51
     [repetitionsInput]
   );
 
-  const handleCopyLastSetReps = useCallback(() => {
-    if (exercise.sets.length > 0) {
-      const lastSet = exercise.sets[exercise.sets.length - 1];
-      setRepetitionsInput(String(lastSet.repetitions));
-    }
-  }, [exercise.sets]);
+  const handleCopyLastSetReps = useCallback(() => {}, [exercise.sets]);
 
   const resetForm = useCallback(() => {

[Timeout] EqualityOperator
src/components/useExerciseScreen.ts:193:9
   );
 
   const handleCopyLastSetReps = useCallback(() => {
-    if (exercise.sets.length > 0) {
+    if (exercise.sets.length <= 0) {
       const lastSet = exercise.sets[exercise.sets.length - 1];
       setRepetitionsInput(String(lastSet.repetitions));

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:193:9
   );
 
   const handleCopyLastSetReps = useCallback(() => {
-    if (exercise.sets.length > 0) {
+    if (false) {
       const lastSet = exercise.sets[exercise.sets.length - 1];
       setRepetitionsInput(String(lastSet.repetitions));

[Timeout] ArithmeticOperator
src/components/useExerciseScreen.ts:194:37
 
   const handleCopyLastSetReps = useCallback(() => {
     if (exercise.sets.length > 0) {
-      const lastSet = exercise.sets[exercise.sets.length - 1];
+      const lastSet = exercise.sets[exercise.sets.length + 1];
       setRepetitionsInput(String(lastSet.repetitions));
     }

[Timeout] CallExpression
src/components/useExerciseScreen.ts:195:7
   const handleCopyLastSetReps = useCallback(() => {
     if (exercise.sets.length > 0) {
       const lastSet = exercise.sets[exercise.sets.length - 1];
-      setRepetitionsInput(String(lastSet.repetitions));
+      ;
     }
   }, [exercise.sets]);

[Timeout] BlockStatement
src/components/useExerciseScreen.ts:199:39
     }
   }, [exercise.sets]);
 
-  const resetForm = useCallback(() => {
-    setRepetitionsInput('');
-    setWeightInput(exercise.weightInKg > 0 ? String(exercise.weightInKg) : '');
-    setRestInput('120');
-    setSelectedTechniques([]);
-  }, [exercise.weightInKg]);
+  const resetForm = useCallback(() => {}, [exercise.weightInKg]);
 
   return {

[Timeout] EqualityOperator
src/components/useExerciseScreen.ts:201:20
 
   const resetForm = useCallback(() => {
     setRepetitionsInput('');
-    setWeightInput(exercise.weightInKg > 0 ? String(exercise.weightInKg) : '');
+    setWeightInput(exercise.weightInKg >= 0 ? String(exercise.weightInKg) : '');
     setRestInput('120');
     setSelectedTechniques([]);

[Timeout] ConditionalExpression
src/components/useExerciseScreen.ts:201:20
 
   const resetForm = useCallback(() => {
     setRepetitionsInput('');
-    setWeightInput(exercise.weightInKg > 0 ? String(exercise.weightInKg) : '');
+    setWeightInput(true ? String(exercise.weightInKg) : '');
     setRestInput('120');
     setSelectedTechniques([]);
