[Timeout] BlockStatement
src/hooks/WorkoutProvider.tsx:9:69
   children: ReactNode;
 }
 
-export function WorkoutProvider({ children }: WorkoutProviderProps) {
-  const workout = useWorkout();
-
-  return (
-    <WorkoutContext.Provider value={workout}>
-      {children}
-    </WorkoutContext.Provider>
-  );
-}
+export function WorkoutProvider({ children }: WorkoutProviderProps) {}
