[Timeout] BlockStatement
src/hooks/useContextWorkout.ts:4:37
 import { useContext } from 'react';
 import { WorkoutContext } from './WorkoutContext';
 
-export function useContextWorkout() {
-  const context = useContext(WorkoutContext);
-  if (!context) {
-    throw new Error('useContextWorkout must be used within a WorkoutProvider');
-  }
-  return context;
-}
+export function useContextWorkout() {}

[Timeout] BooleanLiteral
src/hooks/useContextWorkout.ts:6:7
 
 export function useContextWorkout() {
   const context = useContext(WorkoutContext);
-  if (!context) {
+  if (context) {
     throw new Error('useContextWorkout must be used within a WorkoutProvider');
   }

[Timeout] ConditionalExpression
src/hooks/useContextWorkout.ts:6:7
 
 export function useContextWorkout() {
   const context = useContext(WorkoutContext);
-  if (!context) {
+  if (false) {
     throw new Error('useContextWorkout must be used within a WorkoutProvider');
   }
