[Timeout] ConditionalExpression
src/hooks/useExerciseNavigation.ts:22:28
   selectedExerciseId: string | null,
   onSelectExercise: (exerciseId: string) => void
 ): UseExerciseNavigationResult {
-  const selectedExercise = exercises.find((exercise) => exercise.id === selectedExerciseId) || null;
+  const selectedExercise = false;
   const currentExerciseIndex = exercises.findIndex((exercise) => exercise.id === selectedExerciseId);
 

[Timeout] ConditionalExpression
src/hooks/useExerciseNavigation.ts:22:28
   selectedExerciseId: string | null,
   onSelectExercise: (exerciseId: string) => void
 ): UseExerciseNavigationResult {
-  const selectedExercise = exercises.find((exercise) => exercise.id === selectedExerciseId) || null;
+  const selectedExercise = true;
   const currentExerciseIndex = exercises.findIndex((exercise) => exercise.id === selectedExerciseId);
 

[Timeout] EqualityOperator
src/hooks/useExerciseNavigation.ts:23:66
   onSelectExercise: (exerciseId: string) => void
 ): UseExerciseNavigationResult {
   const selectedExercise = exercises.find((exercise) => exercise.id === selectedExerciseId) || null;
-  const currentExerciseIndex = exercises.findIndex((exercise) => exercise.id === selectedExerciseId);
+  const currentExerciseIndex = exercises.findIndex((exercise) => exercise.id !== selectedExerciseId);
 
   const selectExercise = (exerciseId: string) => {

[Timeout] ConditionalExpression
src/hooks/useExerciseNavigation.ts:23:66
   onSelectExercise: (exerciseId: string) => void
 ): UseExerciseNavigationResult {
   const selectedExercise = exercises.find((exercise) => exercise.id === selectedExerciseId) || null;
-  const currentExerciseIndex = exercises.findIndex((exercise) => exercise.id === selectedExerciseId);
+  const currentExerciseIndex = exercises.findIndex((exercise) => false);
 
   const selectExercise = (exerciseId: string) => {

[Timeout] BlockStatement
src/hooks/useExerciseNavigation.ts:25:50
   const selectedExercise = exercises.find((exercise) => exercise.id === selectedExerciseId) || null;
   const currentExerciseIndex = exercises.findIndex((exercise) => exercise.id === selectedExerciseId);
 
-  const selectExercise = (exerciseId: string) => {
-    onSelectExercise(exerciseId);
-  };
+  const selectExercise = (exerciseId: string) => {};
 
   const goBackToList = () => {

[Timeout] CallExpression
src/hooks/useExerciseNavigation.ts:26:5
   const currentExerciseIndex = exercises.findIndex((exercise) => exercise.id === selectedExerciseId);
 
   const selectExercise = (exerciseId: string) => {
-    onSelectExercise(exerciseId);
+    ;
   };
 

[Timeout] BlockStatement
src/hooks/useExerciseNavigation.ts:29:30
     onSelectExercise(exerciseId);
   };
 
-  const goBackToList = () => {
-    onSelectExercise('');
-  };
+  const goBackToList = () => {};
 
   const navigatePrevious = () => {

[Timeout] BlockStatement
src/hooks/useExerciseNavigation.ts:33:34
     onSelectExercise('');
   };
 
-  const navigatePrevious = () => {
-    if (currentExerciseIndex > 0) {
-      const previousExercise = exercises[currentExerciseIndex - 1];
-      onSelectExercise(previousExercise.id);
-    }
-  };
+  const navigatePrevious = () => {};
 
   const navigateNext = () => {

[Timeout] ConditionalExpression
src/hooks/useExerciseNavigation.ts:34:9
   };
 
   const navigatePrevious = () => {
-    if (currentExerciseIndex > 0) {
+    if (false) {
       const previousExercise = exercises[currentExerciseIndex - 1];
       onSelectExercise(previousExercise.id);

[Timeout] EqualityOperator
src/hooks/useExerciseNavigation.ts:34:9
   };
 
   const navigatePrevious = () => {
-    if (currentExerciseIndex > 0) {
+    if (currentExerciseIndex >= 0) {
       const previousExercise = exercises[currentExerciseIndex - 1];
       onSelectExercise(previousExercise.id);

[Timeout] ArithmeticOperator
src/hooks/useExerciseNavigation.ts:35:42
 
   const navigatePrevious = () => {
     if (currentExerciseIndex > 0) {
-      const previousExercise = exercises[currentExerciseIndex - 1];
+      const previousExercise = exercises[currentExerciseIndex + 1];
       onSelectExercise(previousExercise.id);
     }

[Timeout] CallExpression
src/hooks/useExerciseNavigation.ts:36:7
   const navigatePrevious = () => {
     if (currentExerciseIndex > 0) {
       const previousExercise = exercises[currentExerciseIndex - 1];
-      onSelectExercise(previousExercise.id);
+      ;
     }
   };

[Timeout] BlockStatement
src/hooks/useExerciseNavigation.ts:40:30
     }
   };
 
-  const navigateNext = () => {
-    if (currentExerciseIndex < exercises.length - 1) {
-      const nextExercise = exercises[currentExerciseIndex + 1];
-      onSelectExercise(nextExercise.id);
-    }
-  };
+  const navigateNext = () => {};
 
   return useMemo(() => ({

[Timeout] EqualityOperator
src/hooks/useExerciseNavigation.ts:41:9
   };
 
   const navigateNext = () => {
-    if (currentExerciseIndex < exercises.length - 1) {
+    if (currentExerciseIndex <= exercises.length - 1) {
       const nextExercise = exercises[currentExerciseIndex + 1];
       onSelectExercise(nextExercise.id);

[Timeout] BlockStatement
src/hooks/useExerciseNavigation.ts:41:54
   };
 
   const navigateNext = () => {
-    if (currentExerciseIndex < exercises.length - 1) {
-      const nextExercise = exercises[currentExerciseIndex + 1];
-      onSelectExercise(nextExercise.id);
-    }
+    if (currentExerciseIndex < exercises.length - 1) {}
   };
 

[Timeout] ArithmeticOperator
src/hooks/useExerciseNavigation.ts:42:38
 
   const navigateNext = () => {
     if (currentExerciseIndex < exercises.length - 1) {
-      const nextExercise = exercises[currentExerciseIndex + 1];
+      const nextExercise = exercises[currentExerciseIndex - 1];
       onSelectExercise(nextExercise.id);
     }

[Timeout] CallExpression
src/hooks/useExerciseNavigation.ts:43:7
   const navigateNext = () => {
     if (currentExerciseIndex < exercises.length - 1) {
       const nextExercise = exercises[currentExerciseIndex + 1];
-      onSelectExercise(nextExercise.id);
+      ;
     }
   };

[Timeout] ArrowFunction
src/hooks/useExerciseNavigation.ts:47:18
     }
   };
 
-  return useMemo(() => ({
-    selectedExercise,
-    selectedExerciseId,
-    currentExerciseIndex: currentExerciseIndex ?? -1,
-    hasPrevious: currentExerciseIndex > 0,
-    hasNext: currentExerciseIndex < exercises.length - 1,
-    selectExercise,
-    goBackToList,
-    navigatePrevious,
-    navigateNext,
-  }), [selectedExercise, selectedExerciseId, currentExerciseIndex, exercises.length, onSelectExercise]);
+  return useMemo(() => undefined, [selectedExercise, selectedExerciseId, currentExerciseIndex, exercises.length, onSelectExercise]);
 }
 

[Timeout] ObjectLiteral
src/hooks/useExerciseNavigation.ts:47:25
     }
   };
 
-  return useMemo(() => ({
-    selectedExercise,
-    selectedExerciseId,
-    currentExerciseIndex: currentExerciseIndex ?? -1,
-    hasPrevious: currentExerciseIndex > 0,
-    hasNext: currentExerciseIndex < exercises.length - 1,
-    selectExercise,
-    goBackToList,
-    navigatePrevious,
-    navigateNext,
-  }), [selectedExercise, selectedExerciseId, currentExerciseIndex, exercises.length, onSelectExercise]);
+  return useMemo(() => ({}), [selectedExercise, selectedExerciseId, currentExerciseIndex, exercises.length, onSelectExercise]);
 }
 

[Timeout] UnaryOperator
src/hooks/useExerciseNavigation.ts:50:51
   return useMemo(() => ({
     selectedExercise,
     selectedExerciseId,
-    currentExerciseIndex: currentExerciseIndex ?? -1,
+    currentExerciseIndex: currentExerciseIndex ?? +1,
     hasPrevious: currentExerciseIndex > 0,
     hasNext: currentExerciseIndex < exercises.length - 1,

[Timeout] LogicalOperator
src/hooks/useExerciseNavigation.ts:50:27
   return useMemo(() => ({
     selectedExercise,
     selectedExerciseId,
-    currentExerciseIndex: currentExerciseIndex ?? -1,
+    currentExerciseIndex: currentExerciseIndex && -1,
     hasPrevious: currentExerciseIndex > 0,
     hasNext: currentExerciseIndex < exercises.length - 1,

[Timeout] ConditionalExpression
src/hooks/useExerciseNavigation.ts:51:18
     selectedExercise,
     selectedExerciseId,
     currentExerciseIndex: currentExerciseIndex ?? -1,
-    hasPrevious: currentExerciseIndex > 0,
+    hasPrevious: true,
     hasNext: currentExerciseIndex < exercises.length - 1,
     selectExercise,

[Timeout] EqualityOperator
src/hooks/useExerciseNavigation.ts:51:18
     selectedExercise,
     selectedExerciseId,
     currentExerciseIndex: currentExerciseIndex ?? -1,
-    hasPrevious: currentExerciseIndex > 0,
+    hasPrevious: currentExerciseIndex >= 0,
     hasNext: currentExerciseIndex < exercises.length - 1,
     selectExercise,

[Timeout] ArithmeticOperator
src/hooks/useExerciseNavigation.ts:52:37
     selectedExerciseId,
     currentExerciseIndex: currentExerciseIndex ?? -1,
     hasPrevious: currentExerciseIndex > 0,
-    hasNext: currentExerciseIndex < exercises.length - 1,
+    hasNext: currentExerciseIndex < exercises.length + 1,
     selectExercise,
     goBackToList,

[Timeout] ConditionalExpression
src/hooks/useExerciseNavigation.ts:52:14
     selectedExerciseId,
     currentExerciseIndex: currentExerciseIndex ?? -1,
     hasPrevious: currentExerciseIndex > 0,
-    hasNext: currentExerciseIndex < exercises.length - 1,
+    hasNext: false,
     selectExercise,
     goBackToList,
