[Timeout] BlockStatement
src/hooks/useHistoryFormatters.ts:4:40
 /**
  * Hook para formatar dados de exibição do histórico de treinos
  */
-export function useHistoryFormatters() {
-  const formatWorkoutDate = (dateString: string) => {
-    const parsedDate = new Date(dateString);
-    return parsedDate.toLocaleDateString('pt-BR', {
-      day: '2-digit',
-      month: '2-digit',
-      year: 'numeric',
-      hour: '2-digit',
-      minute: '2-digit',
-    });
-  };
-
-  const formatWorkoutDuration = (durationInSeconds: number) => {
-    const durationInMinutes = Math.round(durationInSeconds / 60);
-    return `${durationInMinutes} min`;
-  };
-
-  return {
-    formatWorkoutDate,
-    formatWorkoutDuration,
-  };
-}
+export function useHistoryFormatters() {}

[Timeout] BlockStatement
src/hooks/useHistoryFormatters.ts:5:53
  * Hook para formatar dados de exibição do histórico de treinos
  */
 export function useHistoryFormatters() {
-  const formatWorkoutDate = (dateString: string) => {
-    const parsedDate = new Date(dateString);
-    return parsedDate.toLocaleDateString('pt-BR', {
-      day: '2-digit',
-      month: '2-digit',
-      year: 'numeric',
-      hour: '2-digit',
-      minute: '2-digit',
-    });
-  };
+  const formatWorkoutDate = (dateString: string) => {};
 
   const formatWorkoutDuration = (durationInSeconds: number) => {

[Timeout] StringLiteral
src/hooks/useHistoryFormatters.ts:8:12
   const formatWorkoutDate = (dateString: string) => {
     const parsedDate = new Date(dateString);
     return parsedDate.toLocaleDateString('pt-BR', {
-      day: '2-digit',
+      day: "",
       month: '2-digit',
       year: 'numeric',

[Timeout] BlockStatement
src/hooks/useHistoryFormatters.ts:16:64
     });
   };
 
-  const formatWorkoutDuration = (durationInSeconds: number) => {
-    const durationInMinutes = Math.round(durationInSeconds / 60);
-    return `${durationInMinutes} min`;
-  };
+  const formatWorkoutDuration = (durationInSeconds: number) => {};
 
   return {

[Timeout] ArithmeticOperator
src/hooks/useHistoryFormatters.ts:17:42
   };
 
   const formatWorkoutDuration = (durationInSeconds: number) => {
-    const durationInMinutes = Math.round(durationInSeconds / 60);
+    const durationInMinutes = Math.round(durationInSeconds * 60);
     return `${durationInMinutes} min`;
   };
