[Timeout] BooleanLiteral
src/hooks/useStopwatch.ts:21:79
  * Mantém o tempo acumulado em um ref e recalcula o valor exibido
  * usando performance.now() para garantir precisão sem drift.
  */
-export function useStopwatch(initialSeconds: number = 0, autoStart: boolean = false): UseStopwatchResult {
+export function useStopwatch(initialSeconds: number = 0, autoStart: boolean = true): UseStopwatchResult {
   const [seconds, setSecondsState] = useState<number>(initialSeconds);
   const [isRunning, setIsRunning] = useState<boolean>(autoStart);

[Timeout] BlockStatement
src/hooks/useStopwatch.ts:30:19
   const intervalRef = useRef<number | null>(null);
 
   // Reset stopwatch when initialSeconds or autoStart changes
-  useEffect(() => {
-    accumulatedSecondsRef.current = initialSeconds;
-    setSecondsState(initialSeconds);
-    if (autoStart) {
-      setIsRunning(true);
-      startTimeRef.current = performance.now();
-    } else {
-      setIsRunning(false);
-      startTimeRef.current = null;
-    }
-  }, [initialSeconds, autoStart]);
+  useEffect(() => {}, [initialSeconds, autoStart]);
 
   const updateTime = () => {

[Timeout] CallExpression
src/hooks/useStopwatch.ts:32:5
   // Reset stopwatch when initialSeconds or autoStart changes
   useEffect(() => {
     accumulatedSecondsRef.current = initialSeconds;
-    setSecondsState(initialSeconds);
+    ;
     if (autoStart) {
       setIsRunning(true);

[Timeout] ConditionalExpression
src/hooks/useStopwatch.ts:33:9
   useEffect(() => {
     accumulatedSecondsRef.current = initialSeconds;
     setSecondsState(initialSeconds);
-    if (autoStart) {
+    if (false) {
       setIsRunning(true);
       startTimeRef.current = performance.now();

[Timeout] ConditionalExpression
src/hooks/useStopwatch.ts:33:9
   useEffect(() => {
     accumulatedSecondsRef.current = initialSeconds;
     setSecondsState(initialSeconds);
-    if (autoStart) {
+    if (true) {
       setIsRunning(true);
       startTimeRef.current = performance.now();

[Timeout] BooleanLiteral
src/hooks/useStopwatch.ts:34:20
     accumulatedSecondsRef.current = initialSeconds;
     setSecondsState(initialSeconds);
     if (autoStart) {
-      setIsRunning(true);
+      setIsRunning(false);
       startTimeRef.current = performance.now();
     } else {

[Timeout] BlockStatement
src/hooks/useStopwatch.ts:36:12
     if (autoStart) {
       setIsRunning(true);
       startTimeRef.current = performance.now();
-    } else {
-      setIsRunning(false);
-      startTimeRef.current = null;
-    }
+    } else {}
   }, [initialSeconds, autoStart]);
 

[Timeout] BooleanLiteral
src/hooks/useStopwatch.ts:37:20
       setIsRunning(true);
       startTimeRef.current = performance.now();
     } else {
-      setIsRunning(false);
+      setIsRunning(true);
       startTimeRef.current = null;
     }

[Timeout] ArrayDeclaration
src/hooks/useStopwatch.ts:40:6
       setIsRunning(false);
       startTimeRef.current = null;
     }
-  }, [initialSeconds, autoStart]);
+  }, []);
 
   const updateTime = () => {

[Timeout] BlockStatement
src/hooks/useStopwatch.ts:42:28
     }
   }, [initialSeconds, autoStart]);
 
-  const updateTime = () => {
-    if (startTimeRef.current !== null) {
-      const elapsedMs = performance.now() - startTimeRef.current;
-      const elapsedSeconds = Math.floor(elapsedMs / 1000);
-      setSecondsState(accumulatedSecondsRef.current + elapsedSeconds);
-    }
-  };
+  const updateTime = () => {};
 
   useEffect(() => {

[Timeout] ConditionalExpression
src/hooks/useStopwatch.ts:43:9
   }, [initialSeconds, autoStart]);
 
   const updateTime = () => {
-    if (startTimeRef.current !== null) {
+    if (true) {
       const elapsedMs = performance.now() - startTimeRef.current;
       const elapsedSeconds = Math.floor(elapsedMs / 1000);

[Timeout] EqualityOperator
src/hooks/useStopwatch.ts:43:9
   }, [initialSeconds, autoStart]);
 
   const updateTime = () => {
-    if (startTimeRef.current !== null) {
+    if (startTimeRef.current === null) {
       const elapsedMs = performance.now() - startTimeRef.current;
       const elapsedSeconds = Math.floor(elapsedMs / 1000);

[Timeout] ArithmeticOperator
src/hooks/useStopwatch.ts:44:25
 
   const updateTime = () => {
     if (startTimeRef.current !== null) {
-      const elapsedMs = performance.now() - startTimeRef.current;
+      const elapsedMs = performance.now() + startTimeRef.current;
       const elapsedSeconds = Math.floor(elapsedMs / 1000);
       setSecondsState(accumulatedSecondsRef.current + elapsedSeconds);

[Timeout] ArithmeticOperator
src/hooks/useStopwatch.ts:45:41
   const updateTime = () => {
     if (startTimeRef.current !== null) {
       const elapsedMs = performance.now() - startTimeRef.current;
-      const elapsedSeconds = Math.floor(elapsedMs / 1000);
+      const elapsedSeconds = Math.floor(elapsedMs * 1000);
       setSecondsState(accumulatedSecondsRef.current + elapsedSeconds);
     }

[Timeout] ArithmeticOperator
src/hooks/useStopwatch.ts:46:23
     if (startTimeRef.current !== null) {
       const elapsedMs = performance.now() - startTimeRef.current;
       const elapsedSeconds = Math.floor(elapsedMs / 1000);
-      setSecondsState(accumulatedSecondsRef.current + elapsedSeconds);
+      setSecondsState(accumulatedSecondsRef.current - elapsedSeconds);
     }
   };

[Timeout] BlockStatement
src/hooks/useStopwatch.ts:50:19
     }
   };
 
-  useEffect(() => {
-    if (isRunning) {
-      startTimeRef.current = performance.now();
-      intervalRef.current = window.setInterval(updateTime, 1000);
-    } else {
-      if (intervalRef.current !== null) {
-        clearInterval(intervalRef.current);
-        intervalRef.current = null;
-      }
-      if (startTimeRef.current !== null) {
-        const elapsedMs = performance.now() - startTimeRef.current;
-        const elapsedSeconds = Math.floor(elapsedMs / 1000);
-        accumulatedSecondsRef.current += elapsedSeconds;
-        startTimeRef.current = null;
-        setSecondsState(accumulatedSecondsRef.current);
-      }
-    }
-
-    return () => {
-      if (intervalRef.current !== null) {
-        clearInterval(intervalRef.current);
-        intervalRef.current = null;
-      }
-    };
-  }, [isRunning]);
+  useEffect(() => {}, [isRunning]);
 
   const start = () => {

[Timeout] ConditionalExpression
src/hooks/useStopwatch.ts:51:9
   };
 
   useEffect(() => {
-    if (isRunning) {
+    if (false) {
       startTimeRef.current = performance.now();
       intervalRef.current = window.setInterval(updateTime, 1000);

[Timeout] ConditionalExpression
src/hooks/useStopwatch.ts:51:9
   };
 
   useEffect(() => {
-    if (isRunning) {
+    if (true) {
       startTimeRef.current = performance.now();
       intervalRef.current = window.setInterval(updateTime, 1000);

[Timeout] BlockStatement
src/hooks/useStopwatch.ts:54:12
     if (isRunning) {
       startTimeRef.current = performance.now();
       intervalRef.current = window.setInterval(updateTime, 1000);
-    } else {
-      if (intervalRef.current !== null) {
-        clearInterval(intervalRef.current);
-        intervalRef.current = null;
-      }
-      if (startTimeRef.current !== null) {
-        const elapsedMs = performance.now() - startTimeRef.current;
-        const elapsedSeconds = Math.floor(elapsedMs / 1000);
-        accumulatedSecondsRef.current += elapsedSeconds;
-        startTimeRef.current = null;
-        setSecondsState(accumulatedSecondsRef.current);
-      }
-    }
+    } else {}
 
     return () => {

[Timeout] ConditionalExpression
src/hooks/useStopwatch.ts:55:11
       startTimeRef.current = performance.now();
       intervalRef.current = window.setInterval(updateTime, 1000);
     } else {
-      if (intervalRef.current !== null) {
+      if (true) {
         clearInterval(intervalRef.current);
         intervalRef.current = null;

[Timeout] ConditionalExpression
src/hooks/useStopwatch.ts:55:11
       startTimeRef.current = performance.now();
       intervalRef.current = window.setInterval(updateTime, 1000);
     } else {
-      if (intervalRef.current !== null) {
+      if (false) {
         clearInterval(intervalRef.current);
         intervalRef.current = null;

[Timeout] CallExpression
src/hooks/useStopwatch.ts:56:9
       intervalRef.current = window.setInterval(updateTime, 1000);
     } else {
       if (intervalRef.current !== null) {
-        clearInterval(intervalRef.current);
+        ;
         intervalRef.current = null;
       }

[Timeout] EqualityOperator
src/hooks/useStopwatch.ts:59:11
         clearInterval(intervalRef.current);
         intervalRef.current = null;
       }
-      if (startTimeRef.current !== null) {
+      if (startTimeRef.current === null) {
         const elapsedMs = performance.now() - startTimeRef.current;
         const elapsedSeconds = Math.floor(elapsedMs / 1000);

[Timeout] ConditionalExpression
src/hooks/useStopwatch.ts:59:11
         clearInterval(intervalRef.current);
         intervalRef.current = null;
       }
-      if (startTimeRef.current !== null) {
+      if (false) {
         const elapsedMs = performance.now() - startTimeRef.current;
         const elapsedSeconds = Math.floor(elapsedMs / 1000);

[Timeout] AssignmentOperator
src/hooks/useStopwatch.ts:62:9
       if (startTimeRef.current !== null) {
         const elapsedMs = performance.now() - startTimeRef.current;
         const elapsedSeconds = Math.floor(elapsedMs / 1000);
-        accumulatedSecondsRef.current += elapsedSeconds;
+        accumulatedSecondsRef.current -= elapsedSeconds;
         startTimeRef.current = null;
         setSecondsState(accumulatedSecondsRef.current);

[Timeout] CallExpression
src/hooks/useStopwatch.ts:64:9
         const elapsedSeconds = Math.floor(elapsedMs / 1000);
         accumulatedSecondsRef.current += elapsedSeconds;
         startTimeRef.current = null;
-        setSecondsState(accumulatedSecondsRef.current);
+        ;
       }
     }

[Timeout] BlockStatement
src/hooks/useStopwatch.ts:68:18
       }
     }
 
-    return () => {
-      if (intervalRef.current !== null) {
-        clearInterval(intervalRef.current);
-        intervalRef.current = null;
-      }
-    };
+    return () => {};
   }, [isRunning]);
 

[Timeout] ConditionalExpression
src/hooks/useStopwatch.ts:69:11
     }
 
     return () => {
-      if (intervalRef.current !== null) {
+      if (true) {
         clearInterval(intervalRef.current);
         intervalRef.current = null;

[Timeout] ConditionalExpression
src/hooks/useStopwatch.ts:69:11
     }
 
     return () => {
-      if (intervalRef.current !== null) {
+      if (false) {
         clearInterval(intervalRef.current);
         intervalRef.current = null;

[Timeout] BlockStatement
src/hooks/useStopwatch.ts:76:23
     };
   }, [isRunning]);
 
-  const start = () => {
-    setIsRunning(true);
-  };
+  const start = () => {};
 
   const pause = () => {

[Timeout] BooleanLiteral
src/hooks/useStopwatch.ts:77:18
   }, [isRunning]);
 
   const start = () => {
-    setIsRunning(true);
+    setIsRunning(false);
   };
 

[Timeout] BlockStatement
src/hooks/useStopwatch.ts:80:23
     setIsRunning(true);
   };
 
-  const pause = () => {
-    setIsRunning(false);
-  };
+  const pause = () => {};
 
   const reset = () => {

[Timeout] BooleanLiteral
src/hooks/useStopwatch.ts:81:18
   };
 
   const pause = () => {
-    setIsRunning(false);
+    setIsRunning(true);
   };
 

[Timeout] BlockStatement
src/hooks/useStopwatch.ts:84:23
     setIsRunning(false);
   };
 
-  const reset = () => {
-    accumulatedSecondsRef.current = 0;
-    startTimeRef.current = performance.now();
-    setSecondsState(0);
-    setIsRunning(true);
-  };
+  const reset = () => {};
 
   const setSeconds = (newSeconds: number) => {

[Timeout] CallExpression
src/hooks/useStopwatch.ts:87:5
   const reset = () => {
     accumulatedSecondsRef.current = 0;
     startTimeRef.current = performance.now();
-    setSecondsState(0);
+    ;
     setIsRunning(true);
   };

[Timeout] BooleanLiteral
src/hooks/useStopwatch.ts:88:18
     accumulatedSecondsRef.current = 0;
     startTimeRef.current = performance.now();
     setSecondsState(0);
-    setIsRunning(true);
+    setIsRunning(false);
   };
 

[Timeout] BlockStatement
src/hooks/useStopwatch.ts:91:46
     setIsRunning(true);
   };
 
-  const setSeconds = (newSeconds: number) => {
-    accumulatedSecondsRef.current = newSeconds;
-    if (isRunning) {
-      startTimeRef.current = performance.now();
-    } else {
-      startTimeRef.current = null;
-      setSecondsState(newSeconds);
-    }
-  };
+  const setSeconds = (newSeconds: number) => {};
 
   return {

[Timeout] ConditionalExpression
src/hooks/useStopwatch.ts:93:9
 
   const setSeconds = (newSeconds: number) => {
     accumulatedSecondsRef.current = newSeconds;
-    if (isRunning) {
+    if (true) {
       startTimeRef.current = performance.now();
     } else {

[Timeout] BlockStatement
src/hooks/useStopwatch.ts:93:20
 
   const setSeconds = (newSeconds: number) => {
     accumulatedSecondsRef.current = newSeconds;
-    if (isRunning) {
-      startTimeRef.current = performance.now();
-    } else {
+    if (isRunning) {} else {
       startTimeRef.current = null;
       setSecondsState(newSeconds);

[Timeout] BlockStatement
src/hooks/useStopwatch.ts:95:12
     accumulatedSecondsRef.current = newSeconds;
     if (isRunning) {
       startTimeRef.current = performance.now();
-    } else {
-      startTimeRef.current = null;
-      setSecondsState(newSeconds);
-    }
+    } else {}
   };
 

[Timeout] CallExpression
src/hooks/useStopwatch.ts:97:7
       startTimeRef.current = performance.now();
     } else {
       startTimeRef.current = null;
-      setSecondsState(newSeconds);
+      ;
     }
   };
