[Timeout] ArrayDeclaration
src/hooks/useWorkout.ts:36:74
  */
 export function useWorkout(): UseWorkoutResult {
   const [currentView, setCurrentView] = useState<'history' | 'active_workout'>('history');
-  const [workoutHistory, setWorkoutHistory] = useState<WorkoutSession[]>([]);
+  const [workoutHistory, setWorkoutHistory] = useState<WorkoutSession[]>(["Stryker was here"]);
   const [activeSession, setActiveSession] = useState<WorkoutSession | null>(null);
   const [editingSession, setEditingSession] = useState<WorkoutSession | null>(null);

[Timeout] BlockStatement
src/hooks/useWorkout.ts:40:19
   const [activeSession, setActiveSession] = useState<WorkoutSession | null>(null);
   const [editingSession, setEditingSession] = useState<WorkoutSession | null>(null);
 
-  useEffect(() => {
-    setWorkoutHistory(getWorkoutHistory());
-    setActiveSession(getActiveWorkoutSession());
-  }, []);
+  useEffect(() => {}, []);
 
   const reloadAllData = () => {

[Timeout] CallExpression
src/hooks/useWorkout.ts:41:5
   const [editingSession, setEditingSession] = useState<WorkoutSession | null>(null);
 
   useEffect(() => {
-    setWorkoutHistory(getWorkoutHistory());
+    ;
     setActiveSession(getActiveWorkoutSession());
   }, []);

[Timeout] CallExpression
src/hooks/useWorkout.ts:42:5
 
   useEffect(() => {
     setWorkoutHistory(getWorkoutHistory());
-    setActiveSession(getActiveWorkoutSession());
+    ;
   }, []);
 

[Timeout] BlockStatement
src/hooks/useWorkout.ts:45:31
     setActiveSession(getActiveWorkoutSession());
   }, []);
 
-  const reloadAllData = () => {
-    setWorkoutHistory(getWorkoutHistory());
-    setActiveSession(getActiveWorkoutSession());
-  };
+  const reloadAllData = () => {};
 
   const navigateToHistory = () => {

[Timeout] CallExpression
src/hooks/useWorkout.ts:46:5
   }, []);
 
   const reloadAllData = () => {
-    setWorkoutHistory(getWorkoutHistory());
+    ;
     setActiveSession(getActiveWorkoutSession());
   };

[Timeout] BlockStatement
src/hooks/useWorkout.ts:50:35
     setActiveSession(getActiveWorkoutSession());
   };
 
-  const navigateToHistory = () => {
-    setCurrentView('history');
-    setEditingSession(null);
-  };
+  const navigateToHistory = () => {};
 
   const startNewWorkout = (templateSession?: WorkoutSession | null) => {

[Timeout] CallExpression
src/hooks/useWorkout.ts:52:5
 
   const navigateToHistory = () => {
     setCurrentView('history');
-    setEditingSession(null);
+    ;
   };
 

[Timeout] ArrayDeclaration
src/hooks/useWorkout.ts:59:47
     const newSessionId = crypto.randomUUID();
     const newSessionDate = new Date().toISOString();
     
-    let initialExercises: WorkoutExercise[] = [];
+    let initialExercises: WorkoutExercise[] = ["Stryker was here"];
     if (templateSession) {
       initialExercises = templateSession.exercises.map((exercise) => {

[Timeout] BlockStatement
src/hooks/useWorkout.ts:60:26
     const newSessionDate = new Date().toISOString();
     
     let initialExercises: WorkoutExercise[] = [];
-    if (templateSession) {
-      initialExercises = templateSession.exercises.map((exercise) => {
-        return {
-          id: crypto.randomUUID(),
-          name: exercise.name,
-          weightInKg: exercise.weightInKg,
-          notes: exercise.notes,
-          sets: [],
-        };
-      });
-    }
+    if (templateSession) {}
 
     const newWorkoutSession: WorkoutSession = {

[Timeout] ConditionalExpression
src/hooks/useWorkout.ts:60:9
     const newSessionDate = new Date().toISOString();
     
     let initialExercises: WorkoutExercise[] = [];
-    if (templateSession) {
+    if (false) {
       initialExercises = templateSession.exercises.map((exercise) => {
         return {

[Timeout] BlockStatement
src/hooks/useWorkout.ts:61:70
     
     let initialExercises: WorkoutExercise[] = [];
     if (templateSession) {
-      initialExercises = templateSession.exercises.map((exercise) => {
-        return {
-          id: crypto.randomUUID(),
-          name: exercise.name,
-          weightInKg: exercise.weightInKg,
-          notes: exercise.notes,
-          sets: [],
-        };
-      });
+      initialExercises = templateSession.exercises.map((exercise) => {});
     }
 

[Timeout] ArrayDeclaration
src/hooks/useWorkout.ts:77:59
       date: newSessionDate,
       durationInSeconds: 0,
       name: templateSession ? templateSession.name : 'Treino Livre',
-      cues: templateSession ? [...templateSession.cues] : [],
+      cues: templateSession ? [...templateSession.cues] : ["Stryker was here"],
       exercises: initialExercises,
       isTemplate: false,

[Timeout] BooleanLiteral
src/hooks/useWorkout.ts:79:19
       name: templateSession ? templateSession.name : 'Treino Livre',
       cues: templateSession ? [...templateSession.cues] : [],
       exercises: initialExercises,
-      isTemplate: false,
+      isTemplate: true,
       status: 'in_progress',
     };

[Timeout] StringLiteral
src/hooks/useWorkout.ts:80:15
       cues: templateSession ? [...templateSession.cues] : [],
       exercises: initialExercises,
       isTemplate: false,
-      status: 'in_progress',
+      status: "",
     };
 

[Timeout] CallExpression
src/hooks/useWorkout.ts:83:5
       status: 'in_progress',
     };
 
-    setActiveSession(newWorkoutSession);
+    ;
     saveActiveWorkoutSession(newWorkoutSession);
     setCurrentView('active_workout');

[Timeout] CallExpression
src/hooks/useWorkout.ts:84:5
     };
 
     setActiveSession(newWorkoutSession);
-    saveActiveWorkoutSession(newWorkoutSession);
+    ;
     setCurrentView('active_workout');
     setEditingSession(null);

[Timeout] StringLiteral
src/hooks/useWorkout.ts:85:20
 
     setActiveSession(newWorkoutSession);
     saveActiveWorkoutSession(newWorkoutSession);
-    setCurrentView('active_workout');
+    setCurrentView("");
     setEditingSession(null);
   };

[Timeout] CallExpression
src/hooks/useWorkout.ts:86:5
     setActiveSession(newWorkoutSession);
     saveActiveWorkoutSession(newWorkoutSession);
     setCurrentView('active_workout');
-    setEditingSession(null);
+    ;
   };
 

[Timeout] BlockStatement
src/hooks/useWorkout.ts:89:67
     setEditingSession(null);
   };
 
-  const startEditingWorkout = (workoutSession: WorkoutSession) => {
-    setEditingSession(workoutSession);
-    setCurrentView('active_workout');
-    setActiveSession(null);
-  };
+  const startEditingWorkout = (workoutSession: WorkoutSession) => {};
 
   const cancelActiveWorkout = () => {

[Timeout] CallExpression
src/hooks/useWorkout.ts:90:5
   };
 
   const startEditingWorkout = (workoutSession: WorkoutSession) => {
-    setEditingSession(workoutSession);
+    ;
     setCurrentView('active_workout');
     setActiveSession(null);

[Timeout] CallExpression
src/hooks/useWorkout.ts:92:5
   const startEditingWorkout = (workoutSession: WorkoutSession) => {
     setEditingSession(workoutSession);
     setCurrentView('active_workout');
-    setActiveSession(null);
+    ;
   };
 

[Timeout] BlockStatement
src/hooks/useWorkout.ts:95:37
     setActiveSession(null);
   };
 
-  const cancelActiveWorkout = () => {
-    setActiveSession(null);
-    saveActiveWorkoutSession(null);
-    setCurrentView('history');
-  };
+  const cancelActiveWorkout = () => {};
 
   const updateActiveSession = (updatedSession: WorkoutSession) => {

[Timeout] CallExpression
src/hooks/useWorkout.ts:96:5
   };
 
   const cancelActiveWorkout = () => {
-    setActiveSession(null);
+    ;
     saveActiveWorkoutSession(null);
     setCurrentView('history');

[Timeout] CallExpression
src/hooks/useWorkout.ts:97:5
 
   const cancelActiveWorkout = () => {
     setActiveSession(null);
-    saveActiveWorkoutSession(null);
+    ;
     setCurrentView('history');
   };

[Timeout] BlockStatement
src/hooks/useWorkout.ts:101:67
     setCurrentView('history');
   };
 
-  const updateActiveSession = (updatedSession: WorkoutSession) => {
-    setActiveSession(updatedSession);
-    saveActiveWorkoutSession(updatedSession);
-  };
+  const updateActiveSession = (updatedSession: WorkoutSession) => {};
 
   const updateEditingSession = (updatedSession: WorkoutSession) => {

[Timeout] CallExpression
src/hooks/useWorkout.ts:102:5
   };
 
   const updateActiveSession = (updatedSession: WorkoutSession) => {
-    setActiveSession(updatedSession);
+    ;
     saveActiveWorkoutSession(updatedSession);
   };

[Timeout] CallExpression
src/hooks/useWorkout.ts:103:5
 
   const updateActiveSession = (updatedSession: WorkoutSession) => {
     setActiveSession(updatedSession);
-    saveActiveWorkoutSession(updatedSession);
+    ;
   };
 

[Timeout] BlockStatement
src/hooks/useWorkout.ts:106:68
     saveActiveWorkoutSession(updatedSession);
   };
 
-  const updateEditingSession = (updatedSession: WorkoutSession) => {
-    setEditingSession(updatedSession);
-  };
+  const updateEditingSession = (updatedSession: WorkoutSession) => {};
 
   const finishActiveWorkout = (sessionToComplete?: WorkoutSession) => {

[Timeout] CallExpression
src/hooks/useWorkout.ts:107:5
   };
 
   const updateEditingSession = (updatedSession: WorkoutSession) => {
-    setEditingSession(updatedSession);
+    ;
   };
 

[Timeout] BlockStatement
src/hooks/useWorkout.ts:110:71
     setEditingSession(updatedSession);
   };
 
-  const finishActiveWorkout = (sessionToComplete?: WorkoutSession) => {
-    // Usa a sessão informada quando disponível (já com a duração atualizada
-    // pelo cronômetro), evitando ler o estado que ainda não foi atualizado.
-    const sessionToClose = sessionToComplete ?? activeSession;
-    if (!sessionToClose) {
-      return;
-    }
-
-    const completedSession: WorkoutSession = {
-      ...sessionToClose,
-      status: 'completed',
-    };
-
-    saveWorkoutSession(completedSession);
-    saveActiveWorkoutSession(null);
-    setActiveSession(null);
-
-    setWorkoutHistory(getWorkoutHistory());
-    setCurrentView('history');
-  };
+  const finishActiveWorkout = (sessionToComplete?: WorkoutSession) => {};
 
   const saveEditedWorkout = (sessionToSave?: WorkoutSession) => {

[Timeout] LogicalOperator
src/hooks/useWorkout.ts:113:28
   const finishActiveWorkout = (sessionToComplete?: WorkoutSession) => {
     // Usa a sessão informada quando disponível (já com a duração atualizada
     // pelo cronômetro), evitando ler o estado que ainda não foi atualizado.
-    const sessionToClose = sessionToComplete ?? activeSession;
+    const sessionToClose = sessionToComplete && activeSession;
     if (!sessionToClose) {
       return;

[Timeout] ConditionalExpression
src/hooks/useWorkout.ts:114:9
     // Usa a sessão informada quando disponível (já com a duração atualizada
     // pelo cronômetro), evitando ler o estado que ainda não foi atualizado.
     const sessionToClose = sessionToComplete ?? activeSession;
-    if (!sessionToClose) {
+    if (true) {
       return;
     }

[Timeout] BlockStatement
src/hooks/useWorkout.ts:114:26
     // Usa a sessão informada quando disponível (já com a duração atualizada
     // pelo cronômetro), evitando ler o estado que ainda não foi atualizado.
     const sessionToClose = sessionToComplete ?? activeSession;
-    if (!sessionToClose) {
-      return;
-    }
+    if (!sessionToClose) {}
 
     const completedSession: WorkoutSession = {

[Survived] ObjectLiteral
src/hooks/useWorkout.ts:118:46
       return;
     }
 
-    const completedSession: WorkoutSession = {
-      ...sessionToClose,
-      status: 'completed',
-    };
+    const completedSession: WorkoutSession = {};
 
     saveWorkoutSession(completedSession);

[Timeout] StringLiteral
src/hooks/useWorkout.ts:120:15
 
     const completedSession: WorkoutSession = {
       ...sessionToClose,
-      status: 'completed',
+      status: "",
     };
 

[Timeout] CallExpression
src/hooks/useWorkout.ts:123:5
       status: 'completed',
     };
 
-    saveWorkoutSession(completedSession);
+    ;
     saveActiveWorkoutSession(null);
     setActiveSession(null);

[Timeout] CallExpression
src/hooks/useWorkout.ts:124:5
     };
 
     saveWorkoutSession(completedSession);
-    saveActiveWorkoutSession(null);
+    ;
     setActiveSession(null);
 

[Timeout] CallExpression
src/hooks/useWorkout.ts:125:5
 
     saveWorkoutSession(completedSession);
     saveActiveWorkoutSession(null);
-    setActiveSession(null);
+    ;
 
     setWorkoutHistory(getWorkoutHistory());

[Timeout] CallExpression
src/hooks/useWorkout.ts:127:5
     saveActiveWorkoutSession(null);
     setActiveSession(null);
 
-    setWorkoutHistory(getWorkoutHistory());
+    ;
     setCurrentView('history');
   };

[Timeout] StringLiteral
src/hooks/useWorkout.ts:128:20
     setActiveSession(null);
 
     setWorkoutHistory(getWorkoutHistory());
-    setCurrentView('history');
+    setCurrentView("");
   };
 

[Timeout] BlockStatement
src/hooks/useWorkout.ts:131:65
     setCurrentView('history');
   };
 
-  const saveEditedWorkout = (sessionToSave?: WorkoutSession) => {
-    // Usa a sessão informada quando disponível (já com a duração atualizada),
-    // evitando ler o estado que ainda não foi atualizado.
-    const sessionToPersist = sessionToSave ?? editingSession;
-    if (!sessionToPersist) {
-      return;
-    }
-
-    saveWorkoutSession(sessionToPersist);
-    setEditingSession(null);
-    setWorkoutHistory(getWorkoutHistory());
-    setCurrentView('history');
-  };
+  const saveEditedWorkout = (sessionToSave?: WorkoutSession) => {};
 
   const deleteSession = (sessionId: string) => {

[Timeout] LogicalOperator
src/hooks/useWorkout.ts:134:30
   const saveEditedWorkout = (sessionToSave?: WorkoutSession) => {
     // Usa a sessão informada quando disponível (já com a duração atualizada),
     // evitando ler o estado que ainda não foi atualizado.
-    const sessionToPersist = sessionToSave ?? editingSession;
+    const sessionToPersist = sessionToSave && editingSession;
     if (!sessionToPersist) {
       return;

[Timeout] BooleanLiteral
src/hooks/useWorkout.ts:135:9
     // Usa a sessão informada quando disponível (já com a duração atualizada),
     // evitando ler o estado que ainda não foi atualizado.
     const sessionToPersist = sessionToSave ?? editingSession;
-    if (!sessionToPersist) {
+    if (sessionToPersist) {
       return;
     }

[Timeout] ConditionalExpression
src/hooks/useWorkout.ts:135:9
     // Usa a sessão informada quando disponível (já com a duração atualizada),
     // evitando ler o estado que ainda não foi atualizado.
     const sessionToPersist = sessionToSave ?? editingSession;
-    if (!sessionToPersist) {
+    if (true) {
       return;
     }

[Timeout] CallExpression
src/hooks/useWorkout.ts:139:5
       return;
     }
 
-    saveWorkoutSession(sessionToPersist);
+    ;
     setEditingSession(null);
     setWorkoutHistory(getWorkoutHistory());

[Timeout] CallExpression
src/hooks/useWorkout.ts:140:5
     }
 
     saveWorkoutSession(sessionToPersist);
-    setEditingSession(null);
+    ;
     setWorkoutHistory(getWorkoutHistory());
     setCurrentView('history');

[Timeout] CallExpression
src/hooks/useWorkout.ts:141:5
 
     saveWorkoutSession(sessionToPersist);
     setEditingSession(null);
-    setWorkoutHistory(getWorkoutHistory());
+    ;
     setCurrentView('history');
   };

[Timeout] BlockStatement
src/hooks/useWorkout.ts:145:48
     setCurrentView('history');
   };
 
-  const deleteSession = (sessionId: string) => {
-    deleteWorkoutSession(sessionId);
-    setWorkoutHistory(getWorkoutHistory());
-  };
+  const deleteSession = (sessionId: string) => {};
 
   return {

[Timeout] CallExpression
src/hooks/useWorkout.ts:146:5
   };
 
   const deleteSession = (sessionId: string) => {
-    deleteWorkoutSession(sessionId);
+    ;
     setWorkoutHistory(getWorkoutHistory());
   };

[Timeout] CallExpression
src/hooks/useWorkout.ts:147:5
 
   const deleteSession = (sessionId: string) => {
     deleteWorkoutSession(sessionId);
-    setWorkoutHistory(getWorkoutHistory());
+    ;
   };
 
