[Timeout] BlockStatement
src/services/backupService.ts:25:45
 /**
  * Gera um arquivo JSON contendo todos os dados do aplicativo e inicia o download no navegador.
  */
-export function exportWorkoutBackup(): void {
-  const history = getWorkoutHistory();
-  const backupData: BackupData = {
-    version: 1,
-    history: history,
-  };
-
-  const jsonString = JSON.stringify(backupData, null, 2);
-  const blob = new Blob([jsonString], { type: 'application/json' });
-  const downloadUrl = URL.createObjectURL(blob);
-  
-  const anchorElement = document.createElement('a');
-  anchorElement.href = downloadUrl;
-  anchorElement.download = `meu_treino_backup_${new Date().toISOString().slice(0, 10)}.json`;
-  
-  document.body.appendChild(anchorElement);
-  anchorElement.click();
-  
-  document.body.removeChild(anchorElement);
-  URL.revokeObjectURL(downloadUrl);
-
-  saveLastBackupWorkoutCount(history.length);
-}
+export function exportWorkoutBackup(): void {}
 
 /**

[Timeout] ObjectLiteral
src/services/backupService.ts:27:34
  */
 export function exportWorkoutBackup(): void {
   const history = getWorkoutHistory();
-  const backupData: BackupData = {
-    version: 1,
-    history: history,
-  };
+  const backupData: BackupData = {};
 
   const jsonString = JSON.stringify(backupData, null, 2);

[Timeout] StringLiteral
src/services/backupService.ts:33:47
   };
 
   const jsonString = JSON.stringify(backupData, null, 2);
-  const blob = new Blob([jsonString], { type: 'application/json' });
+  const blob = new Blob([jsonString], { type: "" });
   const downloadUrl = URL.createObjectURL(blob);
   

[Timeout] StringLiteral
src/services/backupService.ts:36:48
   const blob = new Blob([jsonString], { type: 'application/json' });
   const downloadUrl = URL.createObjectURL(blob);
   
-  const anchorElement = document.createElement('a');
+  const anchorElement = document.createElement("");
   anchorElement.href = downloadUrl;
   anchorElement.download = `meu_treino_backup_${new Date().toISOString().slice(0, 10)}.json`;

[Timeout] MethodExpression
src/services/backupService.ts:38:49
   
   const anchorElement = document.createElement('a');
   anchorElement.href = downloadUrl;
-  anchorElement.download = `meu_treino_backup_${new Date().toISOString().slice(0, 10)}.json`;
+  anchorElement.download = `meu_treino_backup_${new Date().toISOString()}.json`;
   
   document.body.appendChild(anchorElement);

[Timeout] CallExpression
src/services/backupService.ts:40:3
   anchorElement.href = downloadUrl;
   anchorElement.download = `meu_treino_backup_${new Date().toISOString().slice(0, 10)}.json`;
   
-  document.body.appendChild(anchorElement);
+  ;
   anchorElement.click();
   

[Timeout] CallExpression
src/services/backupService.ts:41:3
   anchorElement.download = `meu_treino_backup_${new Date().toISOString().slice(0, 10)}.json`;
   
   document.body.appendChild(anchorElement);
-  anchorElement.click();
+  ;
   
   document.body.removeChild(anchorElement);

[Timeout] CallExpression
src/services/backupService.ts:43:3
   document.body.appendChild(anchorElement);
   anchorElement.click();
   
-  document.body.removeChild(anchorElement);
+  ;
   URL.revokeObjectURL(downloadUrl);
 

[Timeout] CallExpression
src/services/backupService.ts:44:3
   anchorElement.click();
   
   document.body.removeChild(anchorElement);
-  URL.revokeObjectURL(downloadUrl);
+  ;
 
   saveLastBackupWorkoutCount(history.length);

[Timeout] CallExpression
src/services/backupService.ts:46:3
   document.body.removeChild(anchorElement);
   URL.revokeObjectURL(downloadUrl);
 
-  saveLastBackupWorkoutCount(history.length);
+  ;
 }
 

[Timeout] BlockStatement
src/services/backupService.ts:52:73
 /**
  * Valida a estrutura de dados de uma sessão de treino importada.
  */
-function isValidWorkoutSession(session: any): session is WorkoutSession {
-  return (
-    session &&
-    typeof session.id === 'string' &&
-    typeof session.date === 'string' &&
-    typeof session.durationInSeconds === 'number' &&
-    typeof session.name === 'string' &&
-    Array.isArray(session.cues) &&
-    Array.isArray(session.exercises)
-  );
-}
+function isValidWorkoutSession(session: any): session is WorkoutSession {}
 
 /**

[Timeout] ConditionalExpression
src/services/backupService.ts:54:5
  */
 function isValidWorkoutSession(session: any): session is WorkoutSession {
   return (
-    session &&
-    typeof session.id === 'string' &&
-    typeof session.date === 'string' &&
-    typeof session.durationInSeconds === 'number' &&
-    typeof session.name === 'string' &&
-    Array.isArray(session.cues) &&
-    Array.isArray(session.exercises)
+    true
   );
 }

[Timeout] ConditionalExpression
src/services/backupService.ts:54:5
  */
 function isValidWorkoutSession(session: any): session is WorkoutSession {
   return (
-    session &&
-    typeof session.id === 'string' &&
-    typeof session.date === 'string' &&
-    typeof session.durationInSeconds === 'number' &&
-    typeof session.name === 'string' &&
-    Array.isArray(session.cues) &&
+    true &&
     Array.isArray(session.exercises)
   );

[Timeout] ConditionalExpression
src/services/backupService.ts:55:5
 function isValidWorkoutSession(session: any): session is WorkoutSession {
   return (
     session &&
-    typeof session.id === 'string' &&
+    true &&
     typeof session.date === 'string' &&
     typeof session.durationInSeconds === 'number' &&

[Timeout] EqualityOperator
src/services/backupService.ts:55:5
 function isValidWorkoutSession(session: any): session is WorkoutSession {
   return (
     session &&
-    typeof session.id === 'string' &&
+    typeof session.id !== 'string' &&
     typeof session.date === 'string' &&
     typeof session.durationInSeconds === 'number' &&

[Timeout] EqualityOperator
src/services/backupService.ts:56:5
   return (
     session &&
     typeof session.id === 'string' &&
-    typeof session.date === 'string' &&
+    typeof session.date !== 'string' &&
     typeof session.durationInSeconds === 'number' &&
     typeof session.name === 'string' &&

[Timeout] ConditionalExpression
src/services/backupService.ts:56:5
   return (
     session &&
     typeof session.id === 'string' &&
-    typeof session.date === 'string' &&
+    true &&
     typeof session.durationInSeconds === 'number' &&
     typeof session.name === 'string' &&

[Timeout] ConditionalExpression
src/services/backupService.ts:57:5
     session &&
     typeof session.id === 'string' &&
     typeof session.date === 'string' &&
-    typeof session.durationInSeconds === 'number' &&
+    true &&
     typeof session.name === 'string' &&
     Array.isArray(session.cues) &&

[Timeout] EqualityOperator
src/services/backupService.ts:57:5
     session &&
     typeof session.id === 'string' &&
     typeof session.date === 'string' &&
-    typeof session.durationInSeconds === 'number' &&
+    typeof session.durationInSeconds !== 'number' &&
     typeof session.name === 'string' &&
     Array.isArray(session.cues) &&

[Timeout] ConditionalExpression
src/services/backupService.ts:58:5
     typeof session.id === 'string' &&
     typeof session.date === 'string' &&
     typeof session.durationInSeconds === 'number' &&
-    typeof session.name === 'string' &&
+    true &&
     Array.isArray(session.cues) &&
     Array.isArray(session.exercises)

[Timeout] EqualityOperator
src/services/backupService.ts:58:5
     typeof session.id === 'string' &&
     typeof session.date === 'string' &&
     typeof session.durationInSeconds === 'number' &&
-    typeof session.name === 'string' &&
+    typeof session.name !== 'string' &&
     Array.isArray(session.cues) &&
     Array.isArray(session.exercises)

[Timeout] BlockStatement
src/services/backupService.ts:68:7
  * Importa dados de um arquivo de backup JSON, validando sua estrutura e atualizando o LocalStorage.
  */
 export function importWorkoutBackup(jsonString: string): boolean {
-  try {
-    const parsedData = JSON.parse(jsonString);
-
-    if (!parsedData || typeof parsedData !== 'object') {
-      return false;
-    }
-
-    const hasValidHistory = Array.isArray(parsedData.history);
-
-    if (!hasValidHistory) {
-      return false;
-    }
-
-    const validatedHistory = (parsedData.history as any[]).filter((session) => {
-      return isValidWorkoutSession(session);
-    });
-
-    validatedHistory.forEach((session) => {
-      saveWorkoutSession(session);
-    });
-
-    saveLastBackupWorkoutCount(validatedHistory.length);
-
-    return true;
-  } catch (error) {
+  try {} catch (error) {
     return false;
   }

[Timeout] EqualityOperator
src/services/backupService.ts:71:24
   try {
     const parsedData = JSON.parse(jsonString);
 
-    if (!parsedData || typeof parsedData !== 'object') {
+    if (!parsedData || typeof parsedData === 'object') {
       return false;
     }

[Timeout] LogicalOperator
src/services/backupService.ts:71:9
   try {
     const parsedData = JSON.parse(jsonString);
 
-    if (!parsedData || typeof parsedData !== 'object') {
+    if (!parsedData && typeof parsedData !== 'object') {
       return false;
     }

[Timeout] BooleanLiteral
src/services/backupService.ts:72:14
     const parsedData = JSON.parse(jsonString);
 
     if (!parsedData || typeof parsedData !== 'object') {
-      return false;
+      return true;
     }
 

[Timeout] ConditionalExpression
src/services/backupService.ts:77:9
 
     const hasValidHistory = Array.isArray(parsedData.history);
 
-    if (!hasValidHistory) {
+    if (true) {
       return false;
     }

[Timeout] BooleanLiteral
src/services/backupService.ts:77:9
 
     const hasValidHistory = Array.isArray(parsedData.history);
 
-    if (!hasValidHistory) {
+    if (hasValidHistory) {
       return false;
     }

[Timeout] BooleanLiteral
src/services/backupService.ts:78:14
     const hasValidHistory = Array.isArray(parsedData.history);
 
     if (!hasValidHistory) {
-      return false;
+      return true;
     }
 

[Timeout] BlockStatement
src/services/backupService.ts:81:80
       return false;
     }
 
-    const validatedHistory = (parsedData.history as any[]).filter((session) => {
-      return isValidWorkoutSession(session);
-    });
+    const validatedHistory = (parsedData.history as any[]).filter((session) => {});
 
     validatedHistory.forEach((session) => {

[Timeout] MethodExpression
src/services/backupService.ts:81:30
       return false;
     }
 
-    const validatedHistory = (parsedData.history as any[]).filter((session) => {
-      return isValidWorkoutSession(session);
-    });
+    const validatedHistory = parsedData.history as any[];
 
     validatedHistory.forEach((session) => {

[Timeout] BlockStatement
src/services/backupService.ts:85:43
       return isValidWorkoutSession(session);
     });
 
-    validatedHistory.forEach((session) => {
-      saveWorkoutSession(session);
-    });
+    validatedHistory.forEach((session) => {});
 
     saveLastBackupWorkoutCount(validatedHistory.length);

[Timeout] CallExpression
src/services/backupService.ts:86:7
     });
 
     validatedHistory.forEach((session) => {
-      saveWorkoutSession(session);
+      ;
     });
 

[Timeout] CallExpression
src/services/backupService.ts:89:5
       saveWorkoutSession(session);
     });
 
-    saveLastBackupWorkoutCount(validatedHistory.length);
+    ;
 
     return true;

[Timeout] BlockStatement
src/services/backupService.ts:92:19
     saveLastBackupWorkoutCount(validatedHistory.length);
 
     return true;
-  } catch (error) {
-    return false;
-  }
+  } catch (error) {}
 }
 

[Timeout] BooleanLiteral
src/services/backupService.ts:93:12
 
     return true;
   } catch (error) {
-    return false;
+    return true;
   }
 }
