[Timeout] StringLiteral
src/services/storageService.ts:5:36
 
 const HISTORY_STORAGE_KEY = 'meu_treino_history';
 const TEMPLATE_STORAGE_KEY = 'meu_treino_templates';
-const ACTIVE_WORKOUT_STORAGE_KEY = 'meu_treino_active';
+const ACTIVE_WORKOUT_STORAGE_KEY = "";
 
 /**

[Timeout] BlockStatement
src/services/storageService.ts:10:55
 /**
  * Recupera o histórico completo de sessões de treino salvas.
  */
-export function getWorkoutHistory(): WorkoutSession[] {
-  const historyJson = localStorage.getItem(HISTORY_STORAGE_KEY);
-  if (!historyJson) {
-    return [];
-  }
-  try {
-    const workoutSessions = JSON.parse(historyJson) as WorkoutSession[];
-    return workoutSessions.sort((firstSession, secondSession) => {
-      return new Date(secondSession.date).getTime() - new Date(firstSession.date).getTime();
-    });
-  } catch (error) {
-    return [];
-  }
-}
+export function getWorkoutHistory(): WorkoutSession[] {}
 
 /**

[Timeout] ConditionalExpression
src/services/storageService.ts:12:7
  */
 export function getWorkoutHistory(): WorkoutSession[] {
   const historyJson = localStorage.getItem(HISTORY_STORAGE_KEY);
-  if (!historyJson) {
+  if (true) {
     return [];
   }

[Timeout] BlockStatement
src/services/storageService.ts:12:21
  */
 export function getWorkoutHistory(): WorkoutSession[] {
   const historyJson = localStorage.getItem(HISTORY_STORAGE_KEY);
-  if (!historyJson) {
-    return [];
-  }
+  if (!historyJson) {}
   try {
     const workoutSessions = JSON.parse(historyJson) as WorkoutSession[];

[Timeout] BlockStatement
src/services/storageService.ts:15:7
   if (!historyJson) {
     return [];
   }
-  try {
-    const workoutSessions = JSON.parse(historyJson) as WorkoutSession[];
-    return workoutSessions.sort((firstSession, secondSession) => {
-      return new Date(secondSession.date).getTime() - new Date(firstSession.date).getTime();
-    });
-  } catch (error) {
+  try {} catch (error) {
     return [];
   }

[Timeout] BlockStatement
src/services/storageService.ts:17:66
   }
   try {
     const workoutSessions = JSON.parse(historyJson) as WorkoutSession[];
-    return workoutSessions.sort((firstSession, secondSession) => {
-      return new Date(secondSession.date).getTime() - new Date(firstSession.date).getTime();
-    });
+    return workoutSessions.sort((firstSession, secondSession) => {});
   } catch (error) {
     return [];

[Timeout] MethodExpression
src/services/storageService.ts:17:12
   }
   try {
     const workoutSessions = JSON.parse(historyJson) as WorkoutSession[];
-    return workoutSessions.sort((firstSession, secondSession) => {
-      return new Date(secondSession.date).getTime() - new Date(firstSession.date).getTime();
-    });
+    return workoutSessions;
   } catch (error) {
     return [];

[Timeout] ArithmeticOperator
src/services/storageService.ts:18:14
   try {
     const workoutSessions = JSON.parse(historyJson) as WorkoutSession[];
     return workoutSessions.sort((firstSession, secondSession) => {
-      return new Date(secondSession.date).getTime() - new Date(firstSession.date).getTime();
+      return new Date(secondSession.date).getTime() + new Date(firstSession.date).getTime();
     });
   } catch (error) {

[Timeout] BlockStatement
src/services/storageService.ts:20:19
     return workoutSessions.sort((firstSession, secondSession) => {
       return new Date(secondSession.date).getTime() - new Date(firstSession.date).getTime();
     });
-  } catch (error) {
-    return [];
-  }
+  } catch (error) {}
 }
 

[Timeout] BlockStatement
src/services/storageService.ts:28:74
 /**
  * Salva ou atualiza uma sessão de treino no histórico.
  */
-export function saveWorkoutSession(workoutSession: WorkoutSession): void {
-  const currentHistory = getWorkoutHistory();
-  const existingSessionIndex = currentHistory.findIndex((session) => {
-    return session.id === workoutSession.id;
-  });
-
-  if (existingSessionIndex !== -1) {
-    currentHistory[existingSessionIndex] = workoutSession;
-  } else {
-    currentHistory.push(workoutSession);
-  }
-
-  localStorage.setItem(HISTORY_STORAGE_KEY, JSON.stringify(currentHistory));
-}
+export function saveWorkoutSession(workoutSession: WorkoutSession): void {}
 
 /**

[Timeout] BlockStatement
src/services/storageService.ts:30:70
  */
 export function saveWorkoutSession(workoutSession: WorkoutSession): void {
   const currentHistory = getWorkoutHistory();
-  const existingSessionIndex = currentHistory.findIndex((session) => {
-    return session.id === workoutSession.id;
-  });
+  const existingSessionIndex = currentHistory.findIndex((session) => {});
 
   if (existingSessionIndex !== -1) {

[Timeout] ConditionalExpression
src/services/storageService.ts:31:12
 export function saveWorkoutSession(workoutSession: WorkoutSession): void {
   const currentHistory = getWorkoutHistory();
   const existingSessionIndex = currentHistory.findIndex((session) => {
-    return session.id === workoutSession.id;
+    return true;
   });
 

[Timeout] EqualityOperator
src/services/storageService.ts:31:12
 export function saveWorkoutSession(workoutSession: WorkoutSession): void {
   const currentHistory = getWorkoutHistory();
   const existingSessionIndex = currentHistory.findIndex((session) => {
-    return session.id === workoutSession.id;
+    return session.id !== workoutSession.id;
   });
 

[Timeout] ConditionalExpression
src/services/storageService.ts:34:7
     return session.id === workoutSession.id;
   });
 
-  if (existingSessionIndex !== -1) {
+  if (false) {
     currentHistory[existingSessionIndex] = workoutSession;
   } else {

[Timeout] EqualityOperator
src/services/storageService.ts:34:7
     return session.id === workoutSession.id;
   });
 
-  if (existingSessionIndex !== -1) {
+  if (existingSessionIndex === -1) {
     currentHistory[existingSessionIndex] = workoutSession;
   } else {

[Timeout] BlockStatement
src/services/storageService.ts:36:10
 
   if (existingSessionIndex !== -1) {
     currentHistory[existingSessionIndex] = workoutSession;
-  } else {
-    currentHistory.push(workoutSession);
-  }
+  } else {}
 
   localStorage.setItem(HISTORY_STORAGE_KEY, JSON.stringify(currentHistory));

[Timeout] CallExpression
src/services/storageService.ts:37:5
   if (existingSessionIndex !== -1) {
     currentHistory[existingSessionIndex] = workoutSession;
   } else {
-    currentHistory.push(workoutSession);
+    ;
   }
 

[Timeout] CallExpression
src/services/storageService.ts:40:3
     currentHistory.push(workoutSession);
   }
 
-  localStorage.setItem(HISTORY_STORAGE_KEY, JSON.stringify(currentHistory));
+  ;
 }
 

[Timeout] BlockStatement
src/services/storageService.ts:46:70
 /**
  * Remove uma sessão de treino do histórico pelo identificador.
  */
-export function deleteWorkoutSession(workoutSessionId: string): void {
-  const currentHistory = getWorkoutHistory();
-  const filteredHistory = currentHistory.filter((session) => {
-    return session.id !== workoutSessionId;
-  });
-  localStorage.setItem(HISTORY_STORAGE_KEY, JSON.stringify(filteredHistory));
-}
+export function deleteWorkoutSession(workoutSessionId: string): void {}
 
 /**

[Timeout] MethodExpression
src/services/storageService.ts:48:27
  */
 export function deleteWorkoutSession(workoutSessionId: string): void {
   const currentHistory = getWorkoutHistory();
-  const filteredHistory = currentHistory.filter((session) => {
-    return session.id !== workoutSessionId;
-  });
+  const filteredHistory = currentHistory;
   localStorage.setItem(HISTORY_STORAGE_KEY, JSON.stringify(filteredHistory));
 }

[Timeout] BlockStatement
src/services/storageService.ts:48:62
  */
 export function deleteWorkoutSession(workoutSessionId: string): void {
   const currentHistory = getWorkoutHistory();
-  const filteredHistory = currentHistory.filter((session) => {
-    return session.id !== workoutSessionId;
-  });
+  const filteredHistory = currentHistory.filter((session) => {});
   localStorage.setItem(HISTORY_STORAGE_KEY, JSON.stringify(filteredHistory));
 }

[Timeout] EqualityOperator
src/services/storageService.ts:49:12
 export function deleteWorkoutSession(workoutSessionId: string): void {
   const currentHistory = getWorkoutHistory();
   const filteredHistory = currentHistory.filter((session) => {
-    return session.id !== workoutSessionId;
+    return session.id === workoutSessionId;
   });
   localStorage.setItem(HISTORY_STORAGE_KEY, JSON.stringify(filteredHistory));

[Timeout] ConditionalExpression
src/services/storageService.ts:49:12
 export function deleteWorkoutSession(workoutSessionId: string): void {
   const currentHistory = getWorkoutHistory();
   const filteredHistory = currentHistory.filter((session) => {
-    return session.id !== workoutSessionId;
+    return false;
   });
   localStorage.setItem(HISTORY_STORAGE_KEY, JSON.stringify(filteredHistory));

[Timeout] CallExpression
src/services/storageService.ts:51:3
   const filteredHistory = currentHistory.filter((session) => {
     return session.id !== workoutSessionId;
   });
-  localStorage.setItem(HISTORY_STORAGE_KEY, JSON.stringify(filteredHistory));
+  ;
 }
 

[Timeout] BlockStatement
src/services/storageService.ts:57:57
 /**
  * Recupera todos os templates de treino salvos.
  */
-export function getWorkoutTemplates(): WorkoutSession[] {
-  const templatesJson = localStorage.getItem(TEMPLATE_STORAGE_KEY);
-  if (!templatesJson) {
-    return [];
-  }
-  try {
-    return JSON.parse(templatesJson) as WorkoutSession[];
-  } catch (error) {
-    return [];
-  }
-}
+export function getWorkoutTemplates(): WorkoutSession[] {}
 
 /**

[Timeout] BooleanLiteral
src/services/storageService.ts:59:7
  */
 export function getWorkoutTemplates(): WorkoutSession[] {
   const templatesJson = localStorage.getItem(TEMPLATE_STORAGE_KEY);
-  if (!templatesJson) {
+  if (templatesJson) {
     return [];
   }

[Timeout] ConditionalExpression
src/services/storageService.ts:59:7
  */
 export function getWorkoutTemplates(): WorkoutSession[] {
   const templatesJson = localStorage.getItem(TEMPLATE_STORAGE_KEY);
-  if (!templatesJson) {
+  if (true) {
     return [];
   }

[Timeout] ArrayDeclaration
src/services/storageService.ts:60:12
 export function getWorkoutTemplates(): WorkoutSession[] {
   const templatesJson = localStorage.getItem(TEMPLATE_STORAGE_KEY);
   if (!templatesJson) {
-    return [];
+    return ["Stryker was here"];
   }
   try {

[Timeout] BlockStatement
src/services/storageService.ts:62:7
   if (!templatesJson) {
     return [];
   }
-  try {
-    return JSON.parse(templatesJson) as WorkoutSession[];
-  } catch (error) {
+  try {} catch (error) {
     return [];
   }

[Timeout] BlockStatement
src/services/storageService.ts:64:19
   }
   try {
     return JSON.parse(templatesJson) as WorkoutSession[];
-  } catch (error) {
-    return [];
-  }
+  } catch (error) {}
 }
 

[Timeout] BlockStatement
src/services/storageService.ts:72:76
 /**
  * Salva ou atualiza um template de treino.
  */
-export function saveWorkoutTemplate(workoutTemplate: WorkoutSession): void {
-  const currentTemplates = getWorkoutTemplates();
-  const existingTemplateIndex = currentTemplates.findIndex((template) => {
-    return template.id === workoutTemplate.id;
-  });
-
-  if (existingTemplateIndex !== -1) {
-    currentTemplates[existingTemplateIndex] = workoutTemplate;
-  } else {
-    currentTemplates.push(workoutTemplate);
-  }
-
-  localStorage.setItem(TEMPLATE_STORAGE_KEY, JSON.stringify(currentTemplates));
-}
+export function saveWorkoutTemplate(workoutTemplate: WorkoutSession): void {}
 
 /**

[Timeout] BlockStatement
src/services/storageService.ts:74:74
  */
 export function saveWorkoutTemplate(workoutTemplate: WorkoutSession): void {
   const currentTemplates = getWorkoutTemplates();
-  const existingTemplateIndex = currentTemplates.findIndex((template) => {
-    return template.id === workoutTemplate.id;
-  });
+  const existingTemplateIndex = currentTemplates.findIndex((template) => {});
 
   if (existingTemplateIndex !== -1) {

[Timeout] ConditionalExpression
src/services/storageService.ts:75:12
 export function saveWorkoutTemplate(workoutTemplate: WorkoutSession): void {
   const currentTemplates = getWorkoutTemplates();
   const existingTemplateIndex = currentTemplates.findIndex((template) => {
-    return template.id === workoutTemplate.id;
+    return false;
   });
 

[Timeout] ConditionalExpression
src/services/storageService.ts:75:12
 export function saveWorkoutTemplate(workoutTemplate: WorkoutSession): void {
   const currentTemplates = getWorkoutTemplates();
   const existingTemplateIndex = currentTemplates.findIndex((template) => {
-    return template.id === workoutTemplate.id;
+    return true;
   });
 

[Timeout] EqualityOperator
src/services/storageService.ts:78:7
     return template.id === workoutTemplate.id;
   });
 
-  if (existingTemplateIndex !== -1) {
+  if (existingTemplateIndex === -1) {
     currentTemplates[existingTemplateIndex] = workoutTemplate;
   } else {

[Timeout] ConditionalExpression
src/services/storageService.ts:78:7
     return template.id === workoutTemplate.id;
   });
 
-  if (existingTemplateIndex !== -1) {
+  if (true) {
     currentTemplates[existingTemplateIndex] = workoutTemplate;
   } else {

[Timeout] BlockStatement
src/services/storageService.ts:80:10
 
   if (existingTemplateIndex !== -1) {
     currentTemplates[existingTemplateIndex] = workoutTemplate;
-  } else {
-    currentTemplates.push(workoutTemplate);
-  }
+  } else {}
 
   localStorage.setItem(TEMPLATE_STORAGE_KEY, JSON.stringify(currentTemplates));

[Timeout] CallExpression
src/services/storageService.ts:81:5
   if (existingTemplateIndex !== -1) {
     currentTemplates[existingTemplateIndex] = workoutTemplate;
   } else {
-    currentTemplates.push(workoutTemplate);
+    ;
   }
 

[Timeout] CallExpression
src/services/storageService.ts:84:3
     currentTemplates.push(workoutTemplate);
   }
 
-  localStorage.setItem(TEMPLATE_STORAGE_KEY, JSON.stringify(currentTemplates));
+  ;
 }
 

[Timeout] BlockStatement
src/services/storageService.ts:90:72
 /**
  * Remove um template de treino pelo identificador.
  */
-export function deleteWorkoutTemplate(workoutTemplateId: string): void {
-  const currentTemplates = getWorkoutTemplates();
-  const filteredTemplates = currentTemplates.filter((template) => {
-    return template.id !== workoutTemplateId;
-  });
-  localStorage.setItem(TEMPLATE_STORAGE_KEY, JSON.stringify(filteredTemplates));
-}
+export function deleteWorkoutTemplate(workoutTemplateId: string): void {}
 
 /**

[Timeout] BlockStatement
src/services/storageService.ts:92:67
  */
 export function deleteWorkoutTemplate(workoutTemplateId: string): void {
   const currentTemplates = getWorkoutTemplates();
-  const filteredTemplates = currentTemplates.filter((template) => {
-    return template.id !== workoutTemplateId;
-  });
+  const filteredTemplates = currentTemplates.filter((template) => {});
   localStorage.setItem(TEMPLATE_STORAGE_KEY, JSON.stringify(filteredTemplates));
 }

[Timeout] MethodExpression
src/services/storageService.ts:92:29
  */
 export function deleteWorkoutTemplate(workoutTemplateId: string): void {
   const currentTemplates = getWorkoutTemplates();
-  const filteredTemplates = currentTemplates.filter((template) => {
-    return template.id !== workoutTemplateId;
-  });
+  const filteredTemplates = currentTemplates;
   localStorage.setItem(TEMPLATE_STORAGE_KEY, JSON.stringify(filteredTemplates));
 }

[Timeout] EqualityOperator
src/services/storageService.ts:93:12
 export function deleteWorkoutTemplate(workoutTemplateId: string): void {
   const currentTemplates = getWorkoutTemplates();
   const filteredTemplates = currentTemplates.filter((template) => {
-    return template.id !== workoutTemplateId;
+    return template.id === workoutTemplateId;
   });
   localStorage.setItem(TEMPLATE_STORAGE_KEY, JSON.stringify(filteredTemplates));

[Timeout] ConditionalExpression
src/services/storageService.ts:93:12
 export function deleteWorkoutTemplate(workoutTemplateId: string): void {
   const currentTemplates = getWorkoutTemplates();
   const filteredTemplates = currentTemplates.filter((template) => {
-    return template.id !== workoutTemplateId;
+    return false;
   });
   localStorage.setItem(TEMPLATE_STORAGE_KEY, JSON.stringify(filteredTemplates));

[Timeout] CallExpression
src/services/storageService.ts:95:3
   const filteredTemplates = currentTemplates.filter((template) => {
     return template.id !== workoutTemplateId;
   });
-  localStorage.setItem(TEMPLATE_STORAGE_KEY, JSON.stringify(filteredTemplates));
+  ;
 }
 

[Timeout] BlockStatement
src/services/storageService.ts:101:66
 /**
  * Recupera a sessão de treino ativa atual, se houver uma em andamento.
  */
-export function getActiveWorkoutSession(): WorkoutSession | null {
-  const activeWorkoutJson = localStorage.getItem(ACTIVE_WORKOUT_STORAGE_KEY);
-  if (!activeWorkoutJson) {
-    return null;
-  }
-  try {
-    return JSON.parse(activeWorkoutJson) as WorkoutSession;
-  } catch (error) {
-    return null;
-  }
-}
+export function getActiveWorkoutSession(): WorkoutSession | null {}
 
 /**

[Timeout] ConditionalExpression
src/services/storageService.ts:103:7
  */
 export function getActiveWorkoutSession(): WorkoutSession | null {
   const activeWorkoutJson = localStorage.getItem(ACTIVE_WORKOUT_STORAGE_KEY);
-  if (!activeWorkoutJson) {
+  if (true) {
     return null;
   }

[Timeout] BlockStatement
src/services/storageService.ts:103:27
  */
 export function getActiveWorkoutSession(): WorkoutSession | null {
   const activeWorkoutJson = localStorage.getItem(ACTIVE_WORKOUT_STORAGE_KEY);
-  if (!activeWorkoutJson) {
-    return null;
-  }
+  if (!activeWorkoutJson) {}
   try {
     return JSON.parse(activeWorkoutJson) as WorkoutSession;

[Timeout] BlockStatement
src/services/storageService.ts:106:7
   if (!activeWorkoutJson) {
     return null;
   }
-  try {
-    return JSON.parse(activeWorkoutJson) as WorkoutSession;
-  } catch (error) {
+  try {} catch (error) {
     return null;
   }

[Timeout] BlockStatement
src/services/storageService.ts:108:19
   }
   try {
     return JSON.parse(activeWorkoutJson) as WorkoutSession;
-  } catch (error) {
-    return null;
-  }
+  } catch (error) {}
 }
 

[Timeout] BlockStatement
src/services/storageService.ts:116:87
 /**
  * Salva a sessão de treino ativa atual ou remove do armazenamento se nulo.
  */
-export function saveActiveWorkoutSession(workoutSession: WorkoutSession | null): void {
-  if (workoutSession === null) {
-    localStorage.removeItem(ACTIVE_WORKOUT_STORAGE_KEY);
-  } else {
-    localStorage.setItem(ACTIVE_WORKOUT_STORAGE_KEY, JSON.stringify(workoutSession));
-  }
-}
+export function saveActiveWorkoutSession(workoutSession: WorkoutSession | null): void {}
 
 const LAST_BACKUP_COUNT_STORAGE_KEY = 'meu_treino_last_backup_count';

[Timeout] ConditionalExpression
src/services/storageService.ts:117:7
  * Salva a sessão de treino ativa atual ou remove do armazenamento se nulo.
  */
 export function saveActiveWorkoutSession(workoutSession: WorkoutSession | null): void {
-  if (workoutSession === null) {
+  if (true) {
     localStorage.removeItem(ACTIVE_WORKOUT_STORAGE_KEY);
   } else {

[Timeout] BlockStatement
src/services/storageService.ts:117:32
  * Salva a sessão de treino ativa atual ou remove do armazenamento se nulo.
  */
 export function saveActiveWorkoutSession(workoutSession: WorkoutSession | null): void {
-  if (workoutSession === null) {
-    localStorage.removeItem(ACTIVE_WORKOUT_STORAGE_KEY);
-  } else {
+  if (workoutSession === null) {} else {
     localStorage.setItem(ACTIVE_WORKOUT_STORAGE_KEY, JSON.stringify(workoutSession));
   }

[Timeout] CallExpression
src/services/storageService.ts:118:5
  */
 export function saveActiveWorkoutSession(workoutSession: WorkoutSession | null): void {
   if (workoutSession === null) {
-    localStorage.removeItem(ACTIVE_WORKOUT_STORAGE_KEY);
+    ;
   } else {
     localStorage.setItem(ACTIVE_WORKOUT_STORAGE_KEY, JSON.stringify(workoutSession));

[Timeout] BlockStatement
src/services/storageService.ts:119:10
 export function saveActiveWorkoutSession(workoutSession: WorkoutSession | null): void {
   if (workoutSession === null) {
     localStorage.removeItem(ACTIVE_WORKOUT_STORAGE_KEY);
-  } else {
-    localStorage.setItem(ACTIVE_WORKOUT_STORAGE_KEY, JSON.stringify(workoutSession));
-  }
+  } else {}
 }
 

[Timeout] CallExpression
src/services/storageService.ts:120:5
   if (workoutSession === null) {
     localStorage.removeItem(ACTIVE_WORKOUT_STORAGE_KEY);
   } else {
-    localStorage.setItem(ACTIVE_WORKOUT_STORAGE_KEY, JSON.stringify(workoutSession));
+    ;
   }
 }

[Timeout] StringLiteral
src/services/storageService.ts:124:39
   }
 }
 
-const LAST_BACKUP_COUNT_STORAGE_KEY = 'meu_treino_last_backup_count';
+const LAST_BACKUP_COUNT_STORAGE_KEY = "";
 
 /**

[Timeout] BlockStatement
src/services/storageService.ts:129:53
 /**
  * Recupera o número de treinos salvos que estavam no histórico durante o último backup.
  */
-export function getLastBackupWorkoutCount(): number {
-  const lastBackupCountString = localStorage.getItem(LAST_BACKUP_COUNT_STORAGE_KEY);
-  if (!lastBackupCountString) {
-    return 0;
-  }
-  const numericCount = parseInt(lastBackupCountString, 10);
-  return isNaN(numericCount) ? 0 : numericCount;
-}
+export function getLastBackupWorkoutCount(): number {}
 
 /**

[Timeout] ConditionalExpression
src/services/storageService.ts:131:7
  */
 export function getLastBackupWorkoutCount(): number {
   const lastBackupCountString = localStorage.getItem(LAST_BACKUP_COUNT_STORAGE_KEY);
-  if (!lastBackupCountString) {
+  if (true) {
     return 0;
   }

[Timeout] BlockStatement
src/services/storageService.ts:131:31
  */
 export function getLastBackupWorkoutCount(): number {
   const lastBackupCountString = localStorage.getItem(LAST_BACKUP_COUNT_STORAGE_KEY);
-  if (!lastBackupCountString) {
-    return 0;
-  }
+  if (!lastBackupCountString) {}
   const numericCount = parseInt(lastBackupCountString, 10);
   return isNaN(numericCount) ? 0 : numericCount;

[Timeout] BlockStatement
src/services/storageService.ts:141:72
 /**
  * Define o número de treinos no histórico no momento em que o backup foi realizado.
  */
-export function saveLastBackupWorkoutCount(workoutCount: number): void {
-  localStorage.setItem(LAST_BACKUP_COUNT_STORAGE_KEY, String(workoutCount));
-}
+export function saveLastBackupWorkoutCount(workoutCount: number): void {}
 
 /**

[Timeout] CallExpression
src/services/storageService.ts:142:3
  * Define o número de treinos no histórico no momento em que o backup foi realizado.
  */
 export function saveLastBackupWorkoutCount(workoutCount: number): void {
-  localStorage.setItem(LAST_BACKUP_COUNT_STORAGE_KEY, String(workoutCount));
+  ;
 }
 

[Timeout] BlockStatement
src/services/storageService.ts:148:45
 /**
  * Limpa todo o histórico de dados local do aplicativo (usado para resets ou limpezas).
  */
-export function clearAllWorkoutData(): void {
-  localStorage.removeItem(HISTORY_STORAGE_KEY);
-  localStorage.removeItem(TEMPLATE_STORAGE_KEY);
-  localStorage.removeItem(ACTIVE_WORKOUT_STORAGE_KEY);
-  localStorage.removeItem(LAST_BACKUP_COUNT_STORAGE_KEY);
-}
+export function clearAllWorkoutData(): void {}
 

[Timeout] CallExpression
src/services/storageService.ts:149:3
  * Limpa todo o histórico de dados local do aplicativo (usado para resets ou limpezas).
  */
 export function clearAllWorkoutData(): void {
-  localStorage.removeItem(HISTORY_STORAGE_KEY);
+  ;
   localStorage.removeItem(TEMPLATE_STORAGE_KEY);
   localStorage.removeItem(ACTIVE_WORKOUT_STORAGE_KEY);

[Timeout] CallExpression
src/services/storageService.ts:150:3
  */
 export function clearAllWorkoutData(): void {
   localStorage.removeItem(HISTORY_STORAGE_KEY);
-  localStorage.removeItem(TEMPLATE_STORAGE_KEY);
+  ;
   localStorage.removeItem(ACTIVE_WORKOUT_STORAGE_KEY);
   localStorage.removeItem(LAST_BACKUP_COUNT_STORAGE_KEY);

[Timeout] CallExpression
src/services/storageService.ts:151:3
 export function clearAllWorkoutData(): void {
   localStorage.removeItem(HISTORY_STORAGE_KEY);
   localStorage.removeItem(TEMPLATE_STORAGE_KEY);
-  localStorage.removeItem(ACTIVE_WORKOUT_STORAGE_KEY);
+  ;
   localStorage.removeItem(LAST_BACKUP_COUNT_STORAGE_KEY);
 }

[Timeout] CallExpression
src/services/storageService.ts:152:3
   localStorage.removeItem(HISTORY_STORAGE_KEY);
   localStorage.removeItem(TEMPLATE_STORAGE_KEY);
   localStorage.removeItem(ACTIVE_WORKOUT_STORAGE_KEY);
-  localStorage.removeItem(LAST_BACKUP_COUNT_STORAGE_KEY);
+  ;
 }
 
