[Timeout] BlockStatement
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:43:68
    */
   const [currentExerciseId, setCurrentExerciseId] = useState<string | null>(null);
 
-  const handleSelectExercise = useCallback((exerciseId: string) => {
-    setCurrentExerciseId(exerciseId);
-  }, []);
+  const handleSelectExercise = useCallback((exerciseId: string) => {}, []);
 
   const handleBackToList = useCallback(() => {

[Timeout] CallExpression
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:44:5
   const [currentExerciseId, setCurrentExerciseId] = useState<string | null>(null);
 
   const handleSelectExercise = useCallback((exerciseId: string) => {
-    setCurrentExerciseId(exerciseId);
+    ;
   }, []);
 

[Timeout] BlockStatement
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:47:46
     setCurrentExerciseId(exerciseId);
   }, []);
 
-  const handleBackToList = useCallback(() => {
-    setCurrentExerciseId(null);
-  }, []);
+  const handleBackToList = useCallback(() => {}, []);
 
   const navigation = useExerciseNavigation(

[Timeout] CallExpression
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:48:5
   }, []);
 
   const handleBackToList = useCallback(() => {
-    setCurrentExerciseId(null);
+    ;
   }, []);
 

[Timeout] BooleanLiteral
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:57:7
     handleSelectExercise
   );
 
-  if (!session) {
+  if (session) {
     return (
       <main>

[Timeout] BlockStatement
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:57:17
     handleSelectExercise
   );
 
-  if (!session) {
-    return (
-      <main>
-        <div className="card">
-          <MtEmptyState
-            align="left"
-            title="Erro de Sessão"
-            titleStyle={{ fontSize: '1.1rem', fontWeight: 600 }}
-            description="Nenhum treino ativo ou em edição foi encontrado."
-            actionLabel="Voltar ao Histórico"
-            onAction={cancel}
-          />
-        </div>
-      </main>
-    );
-  }
+  if (!session) {}
 
   return (

[Timeout] ObjectLiteral
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:64:25
           <MtEmptyState
             align="left"
             title="Erro de Sessão"
-            titleStyle={{ fontSize: '1.1rem', fontWeight: 600 }}
+            titleStyle={{}}
             description="Nenhum treino ativo ou em edição foi encontrado."
             actionLabel="Voltar ao Histórico"

[Timeout] LogicalOperator
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:85:10
       />
 
       <main style={{ paddingBottom: currentExerciseId ? '20px' : '120px' }}>
-        {currentExerciseId && navigation.selectedExercise ? (
+        {currentExerciseId || navigation.selectedExercise ? (
           <ExerciseScreen
             exercise={navigation.selectedExercise}

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:85:10
       />
 
       <main style={{ paddingBottom: currentExerciseId ? '20px' : '120px' }}>
-        {currentExerciseId && navigation.selectedExercise ? (
+        {false ? (
           <ExerciseScreen
             exercise={navigation.selectedExercise}

[Timeout] BlockStatement
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:89:37
           <ExerciseScreen
             exercise={navigation.selectedExercise}
             onUpdateExercise={updateExercise}
-            onDeleteExercise={() => {
-              deleteExercise(navigation.selectedExercise!.id);
-              handleBackToList();
-            }}
+            onDeleteExercise={() => {}}
             exerciseNavigation={{
               onBack: handleBackToList,

[Timeout] CallExpression
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:90:15
             exercise={navigation.selectedExercise}
             onUpdateExercise={updateExercise}
             onDeleteExercise={() => {
-              deleteExercise(navigation.selectedExercise!.id);
+              ;
               handleBackToList();
             }}

[Timeout] CallExpression
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:91:15
             onUpdateExercise={updateExercise}
             onDeleteExercise={() => {
               deleteExercise(navigation.selectedExercise!.id);
-              handleBackToList();
+              ;
             }}
             exerciseNavigation={{

[Timeout] ObjectLiteral
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:109:29
               onRemoveCue={removeCue}
             />
 
-            <section style={{ marginTop: 'var(--spacing-md)' }}>
+            <section style={{}}>
               <MtSectionTitle
                 icon={<Dumbbell size={18} />}

[Timeout] StringLiteral
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:109:42
               onRemoveCue={removeCue}
             />
 
-            <section style={{ marginTop: 'var(--spacing-md)' }}>
+            <section style={{ marginTop: "" }}>
               <MtSectionTitle
                 icon={<Dumbbell size={18} />}

[Timeout] ObjectLiteral
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:112:24
             <section style={{ marginTop: 'var(--spacing-md)' }}>
               <MtSectionTitle
                 icon={<Dumbbell size={18} />}
-                style={{ fontSize: '1.1rem', marginBottom: 'var(--spacing-sm)' }}
+                style={{}}
               >
                 Exercícios

[Timeout] BlockStatement
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:125:50
 
             <ExerciseSearch
               onAddExercise={addExercise}
-              getSuggestions={(query: string) => {
-                const uniqueExerciseNames = Array.from(
-                  new Set(
-                    workoutHistory.flatMap((sessionItem) =>
-                      sessionItem.exercises.map((exercise) => exercise.name)
-                    )
-                  )
-                );
-
-                if (query.trim() === '') {
-                  return [];
-                }
-
-                return uniqueExerciseNames
-                  .filter((name) => name.toLowerCase().includes(query.toLowerCase()))
-                  .map((name: string) => ({ id: name, name }));
-              }}
+              getSuggestions={(query: string) => {}}
             />
           </>

[Timeout] ArrowFunction
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:128:44
               getSuggestions={(query: string) => {
                 const uniqueExerciseNames = Array.from(
                   new Set(
-                    workoutHistory.flatMap((sessionItem) =>
-                      sessionItem.exercises.map((exercise) => exercise.name)
+                    workoutHistory.flatMap(() => undefined
                     )
                   )

[Timeout] ArrowFunction
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:129:49
                 const uniqueExerciseNames = Array.from(
                   new Set(
                     workoutHistory.flatMap((sessionItem) =>
-                      sessionItem.exercises.map((exercise) => exercise.name)
+                      sessionItem.exercises.map(() => undefined)
                     )
                   )

[Timeout] MethodExpression
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:134:21
                   )
                 );
 
-                if (query.trim() === '') {
+                if (query === '') {
                   return [];
                 }

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:134:21
                   )
                 );
 
-                if (query.trim() === '') {
+                if (false) {
                   return [];
                 }

[Timeout] MethodExpression
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:138:24
                   return [];
                 }
 
-                return uniqueExerciseNames
-                  .filter((name) => name.toLowerCase().includes(query.toLowerCase()))
+                return uniqueExerciseNames
                   .map((name: string) => ({ id: name, name }));
               }}

[Timeout] MethodExpression
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:139:65
                 }
 
                 return uniqueExerciseNames
-                  .filter((name) => name.toLowerCase().includes(query.toLowerCase()))
+                  .filter((name) => name.toLowerCase().includes(query.toUpperCase()))
                   .map((name: string) => ({ id: name, name }));
               }}

[Timeout] ArrowFunction
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:139:27
                 }
 
                 return uniqueExerciseNames
-                  .filter((name) => name.toLowerCase().includes(query.toLowerCase()))
+                  .filter(() => undefined)
                   .map((name: string) => ({ id: name, name }));
               }}

[Timeout] ArrowFunction
src/views/ActiveWorkoutView/ActiveWorkoutView.tsx:140:24
 
                 return uniqueExerciseNames
                   .filter((name) => name.toLowerCase().includes(query.toLowerCase()))
-                  .map((name: string) => ({ id: name, name }));
+                  .map(() => undefined);
               }}
             />
