[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:79:19
     cancelActiveWorkout,
   } = useContextWorkout();
 
-  const session = editingSession || activeSession;
+  const session = true;
   const isEditing = editingSession !== null;
 

[Timeout] LogicalOperator
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:79:19
     cancelActiveWorkout,
   } = useContextWorkout();
 
-  const session = editingSession || activeSession;
+  const session = editingSession && activeSession;
   const isEditing = editingSession !== null;
 

[Timeout] EqualityOperator
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:80:21
   } = useContextWorkout();
 
   const session = editingSession || activeSession;
-  const isEditing = editingSession !== null;
+  const isEditing = editingSession === null;
 
   const sessionStopwatch = useStopwatch(

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:80:21
   } = useContextWorkout();
 
   const session = editingSession || activeSession;
-  const isEditing = editingSession !== null;
+  const isEditing = true;
 
   const sessionStopwatch = useStopwatch(

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:84:5
 
   const sessionStopwatch = useStopwatch(
     session ? session.durationInSeconds : 0,
-    !isEditing && session?.status === 'in_progress'
+    false
   );
 

[Timeout] LogicalOperator
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:84:5
 
   const sessionStopwatch = useStopwatch(
     session ? session.durationInSeconds : 0,
-    !isEditing && session?.status === 'in_progress'
+    !isEditing || session?.status === 'in_progress'
   );
 

[Timeout] BlockStatement
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:90:73
   /**
    * Aplica uma sessão modificada no estado correto (ativo ou edição).
    */
-  const updateSession = useCallback((updatedSession: WorkoutSession) => {
-    if (isEditing) {
-      updateEditingSession(updatedSession);
-    } else {
-      updateActiveSession(updatedSession);
-    }
-  }, [isEditing, updateActiveSession, updateEditingSession]);
+  const updateSession = useCallback((updatedSession: WorkoutSession) => {}, [isEditing, updateActiveSession, updateEditingSession]);
 
   const addCue = useCallback((cue: string) => {

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:91:9
    * Aplica uma sessão modificada no estado correto (ativo ou edição).
    */
   const updateSession = useCallback((updatedSession: WorkoutSession) => {
-    if (isEditing) {
+    if (true) {
       updateEditingSession(updatedSession);
     } else {

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:91:9
    * Aplica uma sessão modificada no estado correto (ativo ou edição).
    */
   const updateSession = useCallback((updatedSession: WorkoutSession) => {
-    if (isEditing) {
+    if (false) {
       updateEditingSession(updatedSession);
     } else {

[Timeout] CallExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:92:7
    */
   const updateSession = useCallback((updatedSession: WorkoutSession) => {
     if (isEditing) {
-      updateEditingSession(updatedSession);
+      ;
     } else {
       updateActiveSession(updatedSession);

[Timeout] BlockStatement
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:93:12
   const updateSession = useCallback((updatedSession: WorkoutSession) => {
     if (isEditing) {
       updateEditingSession(updatedSession);
-    } else {
-      updateActiveSession(updatedSession);
-    }
+    } else {}
   }, [isEditing, updateActiveSession, updateEditingSession]);
 

[Timeout] CallExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:94:7
     if (isEditing) {
       updateEditingSession(updatedSession);
     } else {
-      updateActiveSession(updatedSession);
+      ;
     }
   }, [isEditing, updateActiveSession, updateEditingSession]);

[Timeout] BlockStatement
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:98:47
     }
   }, [isEditing, updateActiveSession, updateEditingSession]);
 
-  const addCue = useCallback((cue: string) => {
-    if (!session) return;
-    updateSession({ ...session, cues: [...session.cues, cue] });
-  }, [session, updateSession]);
+  const addCue = useCallback((cue: string) => {}, [session, updateSession]);
 
   const removeCue = useCallback((cueIndex: number) => {

[Timeout] BooleanLiteral
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:99:9
   }, [isEditing, updateActiveSession, updateEditingSession]);
 
   const addCue = useCallback((cue: string) => {
-    if (!session) return;
+    if (session) return;
     updateSession({ ...session, cues: [...session.cues, cue] });
   }, [session, updateSession]);

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:99:9
   }, [isEditing, updateActiveSession, updateEditingSession]);
 
   const addCue = useCallback((cue: string) => {
-    if (!session) return;
+    if (false) return;
     updateSession({ ...session, cues: [...session.cues, cue] });
   }, [session, updateSession]);

[Timeout] ArrayDeclaration
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:100:39
 
   const addCue = useCallback((cue: string) => {
     if (!session) return;
-    updateSession({ ...session, cues: [...session.cues, cue] });
+    updateSession({ ...session, cues: [] });
   }, [session, updateSession]);
 

[Timeout] ArrayDeclaration
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:101:6
   const addCue = useCallback((cue: string) => {
     if (!session) return;
     updateSession({ ...session, cues: [...session.cues, cue] });
-  }, [session, updateSession]);
+  }, []);
 
   const removeCue = useCallback((cueIndex: number) => {

[Timeout] BlockStatement
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:103:55
     updateSession({ ...session, cues: [...session.cues, cue] });
   }, [session, updateSession]);
 
-  const removeCue = useCallback((cueIndex: number) => {
-    if (!session) return;
-    updateSession({ ...session, cues: session.cues.filter((_, index) => index !== cueIndex) });
-  }, [session, updateSession]);
+  const removeCue = useCallback((cueIndex: number) => {}, [session, updateSession]);
 
   const addExercise = useCallback((exerciseName: string) => {

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:104:9
   }, [session, updateSession]);
 
   const removeCue = useCallback((cueIndex: number) => {
-    if (!session) return;
+    if (true) return;
     updateSession({ ...session, cues: session.cues.filter((_, index) => index !== cueIndex) });
   }, [session, updateSession]);

[Timeout] BooleanLiteral
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:104:9
   }, [session, updateSession]);
 
   const removeCue = useCallback((cueIndex: number) => {
-    if (!session) return;
+    if (session) return;
     updateSession({ ...session, cues: session.cues.filter((_, index) => index !== cueIndex) });
   }, [session, updateSession]);

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:105:73
 
   const removeCue = useCallback((cueIndex: number) => {
     if (!session) return;
-    updateSession({ ...session, cues: session.cues.filter((_, index) => index !== cueIndex) });
+    updateSession({ ...session, cues: session.cues.filter((_, index) => false) });
   }, [session, updateSession]);
 

[Timeout] ArrowFunction
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:105:59
 
   const removeCue = useCallback((cueIndex: number) => {
     if (!session) return;
-    updateSession({ ...session, cues: session.cues.filter((_, index) => index !== cueIndex) });
+    updateSession({ ...session, cues: session.cues.filter(() => undefined) });
   }, [session, updateSession]);
 

[Timeout] BlockStatement
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:108:61
     updateSession({ ...session, cues: session.cues.filter((_, index) => index !== cueIndex) });
   }, [session, updateSession]);
 
-  const addExercise = useCallback((exerciseName: string) => {
-    if (!session) return;
-    const trimmedName = exerciseName.trim();
-    if (trimmedName === '') return;
-
-    const newExercise: WorkoutExercise = {
-      id: crypto.randomUUID(),
-      name: trimmedName,
-      weightInKg: 0,
-      notes: '',
-      sets: [],
-    };
-
-    updateSession({ ...session, exercises: [...session.exercises, newExercise] });
-  }, [session, updateSession]);
+  const addExercise = useCallback((exerciseName: string) => {}, [session, updateSession]);
 
   const updateExercise = useCallback((updatedExercise: WorkoutExercise) => {

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:109:9
   }, [session, updateSession]);
 
   const addExercise = useCallback((exerciseName: string) => {
-    if (!session) return;
+    if (true) return;
     const trimmedName = exerciseName.trim();
     if (trimmedName === '') return;

[Timeout] BooleanLiteral
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:109:9
   }, [session, updateSession]);
 
   const addExercise = useCallback((exerciseName: string) => {
-    if (!session) return;
+    if (session) return;
     const trimmedName = exerciseName.trim();
     if (trimmedName === '') return;

[Timeout] MethodExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:110:25
 
   const addExercise = useCallback((exerciseName: string) => {
     if (!session) return;
-    const trimmedName = exerciseName.trim();
+    const trimmedName = exerciseName;
     if (trimmedName === '') return;
 

[Timeout] EqualityOperator
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:111:9
   const addExercise = useCallback((exerciseName: string) => {
     if (!session) return;
     const trimmedName = exerciseName.trim();
-    if (trimmedName === '') return;
+    if (trimmedName !== '') return;
 
     const newExercise: WorkoutExercise = {

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:111:9
   const addExercise = useCallback((exerciseName: string) => {
     if (!session) return;
     const trimmedName = exerciseName.trim();
-    if (trimmedName === '') return;
+    if (true) return;
 
     const newExercise: WorkoutExercise = {

[Timeout] StringLiteral
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:117:14
       id: crypto.randomUUID(),
       name: trimmedName,
       weightInKg: 0,
-      notes: '',
+      notes: "Stryker was here!",
       sets: [],
     };

[Timeout] ArrayDeclaration
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:121:44
       sets: [],
     };
 
-    updateSession({ ...session, exercises: [...session.exercises, newExercise] });
+    updateSession({ ...session, exercises: [] });
   }, [session, updateSession]);
 

[Timeout] ArrayDeclaration
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:122:6
     };
 
     updateSession({ ...session, exercises: [...session.exercises, newExercise] });
-  }, [session, updateSession]);
+  }, []);
 
   const updateExercise = useCallback((updatedExercise: WorkoutExercise) => {

[Timeout] BlockStatement
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:124:76
     updateSession({ ...session, exercises: [...session.exercises, newExercise] });
   }, [session, updateSession]);
 
-  const updateExercise = useCallback((updatedExercise: WorkoutExercise) => {
-    if (!session) return;
-    updateSession({
-      ...session,
-      exercises: session.exercises.map((exercise) =>
-        exercise.id === updatedExercise.id ? updatedExercise : exercise
-      ),
-    });
-  }, [session, updateSession]);
+  const updateExercise = useCallback((updatedExercise: WorkoutExercise) => {}, [session, updateSession]);
 
   const deleteExercise = useCallback((exerciseId: string) => {

[Timeout] BooleanLiteral
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:125:9
   }, [session, updateSession]);
 
   const updateExercise = useCallback((updatedExercise: WorkoutExercise) => {
-    if (!session) return;
+    if (session) return;
     updateSession({
       ...session,

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:125:9
   }, [session, updateSession]);
 
   const updateExercise = useCallback((updatedExercise: WorkoutExercise) => {
-    if (!session) return;
+    if (true) return;
     updateSession({
       ...session,

[Timeout] ObjectLiteral
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:126:19
 
   const updateExercise = useCallback((updatedExercise: WorkoutExercise) => {
     if (!session) return;
-    updateSession({
-      ...session,
-      exercises: session.exercises.map((exercise) =>
-        exercise.id === updatedExercise.id ? updatedExercise : exercise
-      ),
-    });
+    updateSession({});
   }, [session, updateSession]);
 

[Timeout] ArrowFunction
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:128:40
     if (!session) return;
     updateSession({
       ...session,
-      exercises: session.exercises.map((exercise) =>
-        exercise.id === updatedExercise.id ? updatedExercise : exercise
+      exercises: session.exercises.map(() => undefined
       ),
     });

[Timeout] EqualityOperator
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:129:9
     updateSession({
       ...session,
       exercises: session.exercises.map((exercise) =>
-        exercise.id === updatedExercise.id ? updatedExercise : exercise
+        exercise.id !== updatedExercise.id ? updatedExercise : exercise
       ),
     });

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:129:9
     updateSession({
       ...session,
       exercises: session.exercises.map((exercise) =>
-        exercise.id === updatedExercise.id ? updatedExercise : exercise
+        false ? updatedExercise : exercise
       ),
     });

[Timeout] ArrayDeclaration
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:132:6
         exercise.id === updatedExercise.id ? updatedExercise : exercise
       ),
     });
-  }, [session, updateSession]);
+  }, []);
 
   const deleteExercise = useCallback((exerciseId: string) => {

[Timeout] BlockStatement
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:134:62
     });
   }, [session, updateSession]);
 
-  const deleteExercise = useCallback((exerciseId: string) => {
-    if (!session) return;
-    const userConfirmed = window.confirm('Deseja realmente remover este exercício do treino?');
-    if (!userConfirmed) return;
-
-    updateSession({
-      ...session,
-      exercises: session.exercises.filter((exercise) => exercise.id !== exerciseId),
-    });
-  }, [session, updateSession]);
+  const deleteExercise = useCallback((exerciseId: string) => {}, [session, updateSession]);
 
   /**

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:135:9
   }, [session, updateSession]);
 
   const deleteExercise = useCallback((exerciseId: string) => {
-    if (!session) return;
+    if (true) return;
     const userConfirmed = window.confirm('Deseja realmente remover este exercício do treino?');
     if (!userConfirmed) return;

[Timeout] BooleanLiteral
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:135:9
   }, [session, updateSession]);
 
   const deleteExercise = useCallback((exerciseId: string) => {
-    if (!session) return;
+    if (session) return;
     const userConfirmed = window.confirm('Deseja realmente remover este exercício do treino?');
     if (!userConfirmed) return;

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:137:9
   const deleteExercise = useCallback((exerciseId: string) => {
     if (!session) return;
     const userConfirmed = window.confirm('Deseja realmente remover este exercício do treino?');
-    if (!userConfirmed) return;
+    if (true) return;
 
     updateSession({

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:137:9
   const deleteExercise = useCallback((exerciseId: string) => {
     if (!session) return;
     const userConfirmed = window.confirm('Deseja realmente remover este exercício do treino?');
-    if (!userConfirmed) return;
+    if (false) return;
 
     updateSession({

[Timeout] EqualityOperator
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:141:57
 
     updateSession({
       ...session,
-      exercises: session.exercises.filter((exercise) => exercise.id !== exerciseId),
+      exercises: session.exercises.filter((exercise) => exercise.id === exerciseId),
     });
   }, [session, updateSession]);

[Timeout] MethodExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:141:18
 
     updateSession({
       ...session,
-      exercises: session.exercises.filter((exercise) => exercise.id !== exerciseId),
+      exercises: session.exercises,
     });
   }, [session, updateSession]);

[Timeout] BlockStatement
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:150:42
    * duração atualizada — diretamente para o contexto, evitando a
    * leitura de estado stale feita antes.
    */
-  const saveOrFinish = useCallback(() => {
-    if (!session) return;
-    const finalSession: WorkoutSession = {
-      ...session,
-      durationInSeconds: sessionStopwatch.seconds,
-    };
-
-    if (isEditing) {
-      saveEditedWorkout(finalSession);
-    } else {
-      finishActiveWorkout(finalSession);
-    }
-  }, [session, sessionStopwatch.seconds, isEditing, saveEditedWorkout, finishActiveWorkout]);
+  const saveOrFinish = useCallback(() => {}, [session, sessionStopwatch.seconds, isEditing, saveEditedWorkout, finishActiveWorkout]);
 
   const cancel = useCallback(() => {

[Timeout] BooleanLiteral
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:151:9
    * leitura de estado stale feita antes.
    */
   const saveOrFinish = useCallback(() => {
-    if (!session) return;
+    if (session) return;
     const finalSession: WorkoutSession = {
       ...session,

[Timeout] ConditionalExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:151:9
    * leitura de estado stale feita antes.
    */
   const saveOrFinish = useCallback(() => {
-    if (!session) return;
+    if (false) return;
     const finalSession: WorkoutSession = {
       ...session,

[Timeout] BlockStatement
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:157:20
       durationInSeconds: sessionStopwatch.seconds,
     };
 
-    if (isEditing) {
-      saveEditedWorkout(finalSession);
-    } else {
+    if (isEditing) {} else {
       finishActiveWorkout(finalSession);
     }

[Timeout] CallExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:158:7
     };
 
     if (isEditing) {
-      saveEditedWorkout(finalSession);
+      ;
     } else {
       finishActiveWorkout(finalSession);

[Timeout] BlockStatement
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:159:12
 
     if (isEditing) {
       saveEditedWorkout(finalSession);
-    } else {
-      finishActiveWorkout(finalSession);
-    }
+    } else {}
   }, [session, sessionStopwatch.seconds, isEditing, saveEditedWorkout, finishActiveWorkout]);
 

[Timeout] CallExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:160:7
     if (isEditing) {
       saveEditedWorkout(finalSession);
     } else {
-      finishActiveWorkout(finalSession);
+      ;
     }
   }, [session, sessionStopwatch.seconds, isEditing, saveEditedWorkout, finishActiveWorkout]);

[Timeout] BlockStatement
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:164:36
     }
   }, [session, sessionStopwatch.seconds, isEditing, saveEditedWorkout, finishActiveWorkout]);
 
-  const cancel = useCallback(() => {
-    cancelActiveWorkout();
-  }, [cancelActiveWorkout]);
+  const cancel = useCallback(() => {}, [cancelActiveWorkout]);
 
   return useMemo(() => ({

[Timeout] CallExpression
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:165:5
   }, [session, sessionStopwatch.seconds, isEditing, saveEditedWorkout, finishActiveWorkout]);
 
   const cancel = useCallback(() => {
-    cancelActiveWorkout();
+    ;
   }, [cancelActiveWorkout]);
 

[Timeout] ArrowFunction
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:168:18
     cancelActiveWorkout();
   }, [cancelActiveWorkout]);
 
-  return useMemo(() => ({
-    session: session!,
-    isEditing,
-    durationStopwatch: sessionStopwatch,
-    workoutHistory,
-    addCue,
-    removeCue,
-    addExercise,
-    updateExercise,
-    deleteExercise,
-    saveOrFinish,
-    cancel,
-  }), [
+  return useMemo(() => undefined, [
     session,
     isEditing,

[Timeout] ArrayDeclaration
src/views/ActiveWorkoutView/useActiveWorkoutScreen.ts:180:7
     deleteExercise,
     saveOrFinish,
     cancel,
-  }), [
-    session,
-    isEditing,
-    sessionStopwatch,
-    workoutHistory,
-    addCue,
-    removeCue,
-    addExercise,
-    updateExercise,
-    deleteExercise,
-    saveOrFinish,
-    cancel,
-  ]);
+  }), []);
 }
 
