[Timeout] LogicalOperator
src/views/HistoryView/HistoryView.tsx:44:10
           workoutHistoryLength={workoutHistory.length}
         />
 
-        {activeSession && (
-          <ActiveWorkoutCard
-            activeSession={activeSession}
-            onResume={resumeActiveWorkout}
-            formatWorkoutDate={formatWorkoutDate}
-          />
-        )}
+        {activeSession || <ActiveWorkoutCard activeSession={activeSession} onResume={resumeActiveWorkout} formatWorkoutDate={formatWorkoutDate} />}
 
         <section className="card" style={{ gap: 'var(--spacing-sm)' }}>

[Timeout] ConditionalExpression
src/views/HistoryView/HistoryView.tsx:44:10
           workoutHistoryLength={workoutHistory.length}
         />
 
-        {activeSession && (
-          <ActiveWorkoutCard
-            activeSession={activeSession}
-            onResume={resumeActiveWorkout}
-            formatWorkoutDate={formatWorkoutDate}
-          />
-        )}
+        {true}
 
         <section className="card" style={{ gap: 'var(--spacing-sm)' }}>
