[Timeout] BlockStatement
src/views/HistoryView/useHistoryView.ts:64:69
 
   const { formatWorkoutDate, formatWorkoutDuration } = useHistoryFormatters();
 
-  const handleSessionTap = useCallback((session: WorkoutSession) => {
-    startEditingWorkout(session);
-  }, [startEditingWorkout]);
+  const handleSessionTap = useCallback((session: WorkoutSession) => {}, [startEditingWorkout]);
 
   const handleSessionLongPress = useCallback((sessionId: string) => {

[Timeout] CallExpression
src/views/HistoryView/useHistoryView.ts:65:5
   const { formatWorkoutDate, formatWorkoutDuration } = useHistoryFormatters();
 
   const handleSessionTap = useCallback((session: WorkoutSession) => {
-    startEditingWorkout(session);
+    ;
   }, [startEditingWorkout]);
 

[Timeout] BlockStatement
src/views/HistoryView/useHistoryView.ts:68:69
     startEditingWorkout(session);
   }, [startEditingWorkout]);
 
-  const handleSessionLongPress = useCallback((sessionId: string) => {
-    const userConfirmed = window.confirm(
-      'Deseja realmente excluir este treino do histórico?'
-    );
-    if (userConfirmed) {
-      deleteSession(sessionId);
-    }
-  }, [deleteSession]);
+  const handleSessionLongPress = useCallback((sessionId: string) => {}, [deleteSession]);
 
   const handleImportSuccess = useCallback(() => {

[Timeout] StringLiteral
src/views/HistoryView/useHistoryView.ts:70:7
 
   const handleSessionLongPress = useCallback((sessionId: string) => {
     const userConfirmed = window.confirm(
-      'Deseja realmente excluir este treino do histórico?'
+      ""
     );
     if (userConfirmed) {

[Timeout] ConditionalExpression
src/views/HistoryView/useHistoryView.ts:72:9
     const userConfirmed = window.confirm(
       'Deseja realmente excluir este treino do histórico?'
     );
-    if (userConfirmed) {
+    if (false) {
       deleteSession(sessionId);
     }

[Timeout] BlockStatement
src/views/HistoryView/useHistoryView.ts:72:24
     const userConfirmed = window.confirm(
       'Deseja realmente excluir este treino do histórico?'
     );
-    if (userConfirmed) {
-      deleteSession(sessionId);
-    }
+    if (userConfirmed) {}
   }, [deleteSession]);
 

[Timeout] CallExpression
src/views/HistoryView/useHistoryView.ts:73:7
       'Deseja realmente excluir este treino do histórico?'
     );
     if (userConfirmed) {
-      deleteSession(sessionId);
+      ;
     }
   }, [deleteSession]);

[Timeout] BlockStatement
src/views/HistoryView/useHistoryView.ts:77:49
     }
   }, [deleteSession]);
 
-  const handleImportSuccess = useCallback(() => {
-    navigateToHistory();
-  }, [navigateToHistory]);
+  const handleImportSuccess = useCallback(() => {}, [navigateToHistory]);
 
   const handleCreateNewWorkout = useCallback(() => {

[Survived] CallExpression
src/views/HistoryView/useHistoryView.ts:78:5
   }, [deleteSession]);
 
   const handleImportSuccess = useCallback(() => {
-    navigateToHistory();
+    ;
   }, [navigateToHistory]);
 

[Timeout] BlockStatement
src/views/HistoryView/useHistoryView.ts:81:52
     navigateToHistory();
   }, [navigateToHistory]);
 
-  const handleCreateNewWorkout = useCallback(() => {
-    startNewWorkout(null);
-  }, [startNewWorkout]);
+  const handleCreateNewWorkout = useCallback(() => {}, [startNewWorkout]);
 
   return {

[Survived] CallExpression
src/views/HistoryView/useHistoryView.ts:82:5
   }, [navigateToHistory]);
 
   const handleCreateNewWorkout = useCallback(() => {
-    startNewWorkout(null);
+    ;
   }, [startNewWorkout]);
 
